wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/**
* @file CDD_Sbc_fs23_Regs.h
* @version 1.0
*/
/*==================================================================================================
*   Project              : RTD AUTOSAR 4.7
*   Platform             : CORTEXM
*   Peripheral           : Sbc_fs23
*   Dependencies         : 
*
*   Autosar Version      : 4.7.0
*   Autosar Revision     : ASR_REL_4_7_REV_0000
*   Autosar Conf.Variant :
*   SW Version           : 1.0.0
*   Build Version        : S32K3_RTD_1_0_0_D2402_ASR_REL_4_7_REV_0000_20240206
*
*   (c) Copyright 2020 - 2024 NXP
*   All Rights Reserved.
*
*   NXP Confidential. This software is owned or controlled by NXP and may only be
*   used strictly in accordance with the applicable license terms. By expressly
*   accepting such terms or by downloading, installing, activating and/or otherwise
*   using the software, you are agreeing that you have read, and that you agree to
*   comply with and are bound by, such license terms. If you do not agree to be
*   bound by the applicable license terms, then you may not retain, install,
*   activate or otherwise use the software.
==================================================================================================*/

#ifndef CDD_SBC_FS23_REGS_H_
#define CDD_SBC_FS23_REGS_H_

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, global macro not referenced
* The register header defines macros for all bitfields to be used by the application code.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
*/

/******************************************************************************/
/* M_DEV_CFG - Type: RW                                                       */
/******************************************************************************/

#define SBC_FS23_M_DEV_CFG_ADDR              ((uint8)(0x00U))
#define SBC_FS23_M_DEV_CFG_DEFAULT           ((uint16)(0x0000U))

/* Report the enable of VMON_EXT */
#define SBC_FS23_M_V0MON_EN_MASK             ((uint16)(0x0004U))
#define SBC_FS23_M_V0MON_EN_SHIFT            ((uint16)(0x0002U))
/* Report the enable of LIMP0 */
#define SBC_FS23_M_LIMP0_EN_MASK             ((uint16)(0x0008U))
#define SBC_FS23_M_LIMP0_EN_SHIFT            ((uint16)(0x0003U))
/* Report the enable of FS0B */
#define SBC_FS23_M_FS0B_EN_MASK              ((uint16)(0x0010U))
#define SBC_FS23_M_FS0B_EN_SHIFT             ((uint16)(0x0004U))
/* Report the enable of FCCU */
#define SBC_FS23_M_FCCU_EN_MASK              ((uint16)(0x0020U))
#define SBC_FS23_M_FCCU_EN_SHIFT             ((uint16)(0x0005U))
/* Report the enable of ABIST on demand */
#define SBC_FS23_M_ABIST_EN_MASK             ((uint16)(0x0040U))
#define SBC_FS23_M_ABIST_EN_SHIFT            ((uint16)(0x0006U))
/* Report the enable of V1 PNP mode */
#define SBC_FS23_M_V1_PNP_EN_MASK            ((uint16)(0x0080U))
#define SBC_FS23_M_V1_PNP_EN_SHIFT           ((uint16)(0x0007U))
/* Report the enable of V2 regulator by OTP */
#define SBC_FS23_M_V2_EN_MASK                ((uint16)(0x0100U))
#define SBC_FS23_M_V2_EN_SHIFT               ((uint16)(0x0008U))
/* Report the enable of HS2 and HS4 */
#define SBC_FS23_M_HSD24_EN_MASK             ((uint16)(0x0200U))
#define SBC_FS23_M_HSD24_EN_SHIFT            ((uint16)(0x0009U))
/* Report the enable of HS1 and HS3 */
#define SBC_FS23_M_HSD13_EN_MASK             ((uint16)(0x0400U))
#define SBC_FS23_M_HSD13_EN_SHIFT            ((uint16)(0x000AU))
/* Report the enable of the Long Duration Timer (LDT) */
#define SBC_FS23_M_LDTIM_EN_MASK             ((uint16)(0x0800U))
#define SBC_FS23_M_LDTIM_EN_SHIFT            ((uint16)(0x000BU))
/* Report the enable of the LIN */
#define SBC_FS23_M_LIN_EN_MASK               ((uint16)(0x1000U))
#define SBC_FS23_M_LIN_EN_SHIFT              ((uint16)(0x000CU))
/* Report the enable of the CAN */
#define SBC_FS23_M_CAN_EN_MASK               ((uint16)(0x2000U))
#define SBC_FS23_M_CAN_EN_SHIFT              ((uint16)(0x000DU))

/* VMON_EXT is disabled */
#define SBC_FS23_M_V0MON_EN_DISABLED         ((uint16)((uint16)0x0000U << SBC_FS23_M_V0MON_EN_SHIFT))
/* VMON_EXT is enabled */
#define SBC_FS23_M_V0MON_EN_ENABLED          ((uint16)((uint16)0x0001U << SBC_FS23_M_V0MON_EN_SHIFT))

/* LIMP0 is disabled */
#define SBC_FS23_M_LIMP0_EN_DISABLED         ((uint16)((uint16)0x0000U << SBC_FS23_M_LIMP0_EN_SHIFT))
/* LIMP0 is enabled */
#define SBC_FS23_M_LIMP0_EN_ENABLED          ((uint16)((uint16)0x0001U << SBC_FS23_M_LIMP0_EN_SHIFT))

/* FS0B is disabled */
#define SBC_FS23_M_FS0B_EN_DISABLED          ((uint16)((uint16)0x0000U << SBC_FS23_M_FS0B_EN_SHIFT))
/* FS0B is enabled */
#define SBC_FS23_M_FS0B_EN_ENABLED           ((uint16)((uint16)0x0001U << SBC_FS23_M_FS0B_EN_SHIFT))

/* FCCU is disabled */
#define SBC_FS23_M_FCCU_EN_DISABLED          ((uint16)((uint16)0x0000U << SBC_FS23_M_FCCU_EN_SHIFT))
/* FCCU is enabled */
#define SBC_FS23_M_FCCU_EN_ENABLED           ((uint16)((uint16)0x0001U << SBC_FS23_M_FCCU_EN_SHIFT))

/* ABIST on demand is disabled */
#define SBC_FS23_M_ABIST_EN_DISABLED         ((uint16)((uint16)0x0000U << SBC_FS23_M_ABIST_EN_SHIFT))
/* ABIST on demand is enabled */
#define SBC_FS23_M_ABIST_EN_ENABLED          ((uint16)((uint16)0x0001U << SBC_FS23_M_ABIST_EN_SHIFT))

/* V1 PNP mode is disabled */
#define SBC_FS23_M_V1_PNP_EN_DISABLED        ((uint16)((uint16)0x0000U << SBC_FS23_M_V1_PNP_EN_SHIFT))
/* V1 PNP mode is enabled */
#define SBC_FS23_M_V1_PNP_EN_ENABLED         ((uint16)((uint16)0x0001U << SBC_FS23_M_V1_PNP_EN_SHIFT))

/* V2 regulator is disabled by OTP */
#define SBC_FS23_M_V2_EN_DISABLED            ((uint16)((uint16)0x0000U << SBC_FS23_M_V2_EN_SHIFT))
/* V2 regulator is enabled by OTP */
#define SBC_FS23_M_V2_EN_ENABLED             ((uint16)((uint16)0x0001U << SBC_FS23_M_V2_EN_SHIFT))

/* HS2 and HS4 are disabled */
#define SBC_FS23_M_HSD24_EN_DISABLED         ((uint16)((uint16)0x0000U << SBC_FS23_M_HSD24_EN_SHIFT))
/* HS2 and HS4 are enabled */
#define SBC_FS23_M_HSD24_EN_ENABLED          ((uint16)((uint16)0x0001U << SBC_FS23_M_HSD24_EN_SHIFT))

/* HS1 and HS3 are disabled */
#define SBC_FS23_M_HSD13_EN_DISABLED         ((uint16)((uint16)0x0000U << SBC_FS23_M_HSD13_EN_SHIFT))
/* HS1 and HS3 are enabled */
#define SBC_FS23_M_HSD13_EN_ENABLED          ((uint16)((uint16)0x0001U << SBC_FS23_M_HSD13_EN_SHIFT))

/* LDT is disabled */
#define SBC_FS23_M_LDTIM_EN_DISABLED         ((uint16)((uint16)0x0000U << SBC_FS23_M_LDTIM_EN_SHIFT))
/* LDT is enabled */
#define SBC_FS23_M_LDTIM_EN_ENABLED          ((uint16)((uint16)0x0001U << SBC_FS23_M_LDTIM_EN_SHIFT))

/* The LIN is disabled */
#define SBC_FS23_M_LIN_EN_DISABLED           ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_EN_SHIFT))
/* The LIN is enabled */
#define SBC_FS23_M_LIN_EN_ENABLED            ((uint16)((uint16)0x0001U << SBC_FS23_M_LIN_EN_SHIFT))

/* The CAN is disabled */
#define SBC_FS23_M_CAN_EN_DISABLED           ((uint16)((uint16)0x0000U << SBC_FS23_M_CAN_EN_SHIFT))
/* The CAN is enabled */
#define SBC_FS23_M_CAN_EN_ENABLED            ((uint16)((uint16)0x0001U << SBC_FS23_M_CAN_EN_SHIFT))

/******************************************************************************/
/* M_DEV_PROG_ID - Type: RW                                                   */
/******************************************************************************/

#define SBC_FS23_M_DEV_PROG_ID_ADDR          ((uint8)(0x01U))
#define SBC_FS23_M_DEV_PROG_ID_DEFAULT       ((uint16)(0x1000U))

/* Report the first digit of the OTP code (A-R) */
#define SBC_FS23_M_PROG_IDL_MASK             ((uint16)(0x000FU))
#define SBC_FS23_M_PROG_IDL_SHIFT            ((uint16)(0x0000U))
/* Report the second digit of the OTP code (0-F) */
#define SBC_FS23_M_PROG_IDH_MASK             ((uint16)(0x00F0U))
#define SBC_FS23_M_PROG_IDH_SHIFT            ((uint16)(0x0004U))
/* Report the Metal Mask revision */
#define SBC_FS23_M_METAL_LAYER_REV_MASK      ((uint16)(0x0F00U))
#define SBC_FS23_M_METAL_LAYER_REV_SHIFT     ((uint16)(0x0008U))
/* Report the Full Layer Mask revision (X) */
#define SBC_FS23_M_FULL_LAYER_REV_MASK       ((uint16)(0xF000U))
#define SBC_FS23_M_FULL_LAYER_REV_SHIFT      ((uint16)(0x000CU))

