wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* Rev A0 ( Default full Layer revision) */
#define SBC_FS23_M_METAL_LAYER_REV_A0        ((uint16)((uint16)0x0000U << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X1 */
#define SBC_FS23_M_METAL_LAYER_REV_X1        ((uint16)((uint16)0x0001U << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X2 */
#define SBC_FS23_M_METAL_LAYER_REV_X2        ((uint16)((uint16)0x0002U << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X3 */
#define SBC_FS23_M_METAL_LAYER_REV_X3        ((uint16)((uint16)0x0003U << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X4 */
#define SBC_FS23_M_METAL_LAYER_REV_X4        ((uint16)((uint16)0x0004U << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X5 */
#define SBC_FS23_M_METAL_LAYER_REV_X5        ((uint16)((uint16)0x0005U << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X6 */
#define SBC_FS23_M_METAL_LAYER_REV_X6        ((uint16)((uint16)0x0006U << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X7 */
#define SBC_FS23_M_METAL_LAYER_REV_X7        ((uint16)((uint16)0x0007U << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X8 */
#define SBC_FS23_M_METAL_LAYER_REV_X8        ((uint16)((uint16)0x0008U << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X9 */
#define SBC_FS23_M_METAL_LAYER_REV_X9        ((uint16)((uint16)0x0009U << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X10 */
#define SBC_FS23_M_METAL_LAYER_REV_X10       ((uint16)((uint16)0x000AU << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X11 */
#define SBC_FS23_M_METAL_LAYER_REV_X11       ((uint16)((uint16)0x000BU << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X12 */
#define SBC_FS23_M_METAL_LAYER_REV_X12       ((uint16)((uint16)0x000CU << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X13 */
#define SBC_FS23_M_METAL_LAYER_REV_X13       ((uint16)((uint16)0x000DU << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X14 */
#define SBC_FS23_M_METAL_LAYER_REV_X14       ((uint16)((uint16)0x000EU << SBC_FS23_M_METAL_LAYER_REV_SHIFT))
/* Rev X15 */
#define SBC_FS23_M_METAL_LAYER_REV_X15       ((uint16)((uint16)0x000FU << SBC_FS23_M_METAL_LAYER_REV_SHIFT))

/* Unused */
#define SBC_FS23_M_FULL_LAYER_REV_UNUSED     ((uint16)((uint16)0x0000U << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass A silicon */
#define SBC_FS23_M_FULL_LAYER_REV_A          ((uint16)((uint16)0x0001U << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass B silicon */
#define SBC_FS23_M_FULL_LAYER_REV_B          ((uint16)((uint16)0x0002U << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass C silicon */
#define SBC_FS23_M_FULL_LAYER_REV_C          ((uint16)((uint16)0x0003U << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass D silicon */
#define SBC_FS23_M_FULL_LAYER_REV_D          ((uint16)((uint16)0x0004U << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass E silicon */
#define SBC_FS23_M_FULL_LAYER_REV_E          ((uint16)((uint16)0x0005U << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass F silicon */
#define SBC_FS23_M_FULL_LAYER_REV_F          ((uint16)((uint16)0x0006U << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass G silicon */
#define SBC_FS23_M_FULL_LAYER_REV_G          ((uint16)((uint16)0x0007U << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass H silicon */
#define SBC_FS23_M_FULL_LAYER_REV_H          ((uint16)((uint16)0x0008U << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass I silicon */
#define SBC_FS23_M_FULL_LAYER_REV_I          ((uint16)((uint16)0x0009U << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass J silicon */
#define SBC_FS23_M_FULL_LAYER_REV_J          ((uint16)((uint16)0x000AU << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass K silicon */
#define SBC_FS23_M_FULL_LAYER_REV_K          ((uint16)((uint16)0x000BU << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass L silicon */
#define SBC_FS23_M_FULL_LAYER_REV_L          ((uint16)((uint16)0x000CU << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass M silicon */
#define SBC_FS23_M_FULL_LAYER_REV_M          ((uint16)((uint16)0x000DU << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass N silicon */
#define SBC_FS23_M_FULL_LAYER_REV_N          ((uint16)((uint16)0x000EU << SBC_FS23_M_FULL_LAYER_REV_SHIFT))
/* Pass O silicon */
#define SBC_FS23_M_FULL_LAYER_REV_O          ((uint16)((uint16)0x000FU << SBC_FS23_M_FULL_LAYER_REV_SHIFT))

/******************************************************************************/
/* M_GEN_FLAG - Type: RW                                                      */
/******************************************************************************/

#define SBC_FS23_M_GEN_FLAG_ADDR             ((uint8)(0x02U))
#define SBC_FS23_M_GEN_FLAG_DEFAULT          ((uint16)(0x0000U))

/* Report an event on a regulator VxG */
#define SBC_FS23_M_VXG_MASK                  ((uint16)(0x0001U))
#define SBC_FS23_M_VXG_SHIFT                 ((uint16)(0x0000U))
/* Report a VSUP error VSUPG = VSUP_UV_I or VSUP_OV_I or VSHS_OV_I or VSHS_UV_I */
#define SBC_FS23_M_VSUPG_MASK                ((uint16)(0x0002U))
#define SBC_FS23_M_VSUPG_SHIFT               ((uint16)(0x0001U))
/* Report an error on the communication (SPI or I2C) COMG */
#define SBC_FS23_M_COMG_MASK                 ((uint16)(0x0004U))
#define SBC_FS23_M_COMG_SHIFT                ((uint16)(0x0002U))
/* Report an IO or LDT event IOTIMG */
#define SBC_FS23_M_IOTIMG_MASK               ((uint16)(0x0008U))
#define SBC_FS23_M_IOTIMG_SHIFT              ((uint16)(0x0003U))
/* Report a wake up event WUG */
#define SBC_FS23_M_WUG_MASK                  ((uint16)(0x0010U))
#define SBC_FS23_M_WUG_SHIFT                 ((uint16)(0x0004U))
/* Report a Physical Layer error PHYG */
#define SBC_FS23_M_PHYG_MASK                 ((uint16)(0x0020U))
#define SBC_FS23_M_PHYG_SHIFT                ((uint16)(0x0005U))
/* Report a safety related error SAFETYG */
#define SBC_FS23_M_SAFETYG_MASK              ((uint16)(0x0040U))
#define SBC_FS23_M_SAFETYG_SHIFT             ((uint16)(0x0006U))
/* Report a High Side event or a Cyclic Sense event HSxG */
#define SBC_FS23_M_HSXG_MASK                 ((uint16)(0x0080U))
#define SBC_FS23_M_HSXG_SHIFT                ((uint16)(0x0007U))

/* No event */
#define SBC_FS23_M_VXG_NO_ERROR              ((uint16)((uint16)0x0000U << SBC_FS23_M_VXG_SHIFT))
/* Vx event occurred */
#define SBC_FS23_M_VXG_ERROR                 ((uint16)((uint16)0x0001U << SBC_FS23_M_VXG_SHIFT))

