wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* No error */
#define SBC_FS23_M_VSUPG_NO_ERROR            ((uint16)((uint16)0x0000U << SBC_FS23_M_VSUPG_SHIFT))
/* VSUP error reported */
#define SBC_FS23_M_VSUPG_ERROR               ((uint16)((uint16)0x0001U << SBC_FS23_M_VSUPG_SHIFT))

/* No error */
#define SBC_FS23_M_COMG_NO_ERROR             ((uint16)((uint16)0x0000U << SBC_FS23_M_COMG_SHIFT))
/* Communication error reported */
#define SBC_FS23_M_COMG_ERROR                ((uint16)((uint16)0x0001U << SBC_FS23_M_COMG_SHIFT))

/* No event */
#define SBC_FS23_M_IOTIMG_NO_ERROR           ((uint16)((uint16)0x0000U << SBC_FS23_M_IOTIMG_SHIFT))
/* IO or LDT event occurred */
#define SBC_FS23_M_IOTIMG_ERROR              ((uint16)((uint16)0x0001U << SBC_FS23_M_IOTIMG_SHIFT))

/* No event */
#define SBC_FS23_M_WUG_NO_ERROR              ((uint16)((uint16)0x0000U << SBC_FS23_M_WUG_SHIFT))
/* Wake up event occurred */
#define SBC_FS23_M_WUG_ERROR                 ((uint16)((uint16)0x0001U << SBC_FS23_M_WUG_SHIFT))

/* No error */
#define SBC_FS23_M_PHYG_NO_ERROR             ((uint16)((uint16)0x0000U << SBC_FS23_M_PHYG_SHIFT))
/* CAN or LIN error reported */
#define SBC_FS23_M_PHYG_ERROR                ((uint16)((uint16)0x0001U << SBC_FS23_M_PHYG_SHIFT))

/* No error */
#define SBC_FS23_M_SAFETYG_NO_ERROR          ((uint16)((uint16)0x0000U << SBC_FS23_M_SAFETYG_SHIFT))
/* Watchdog refresh error reported */
#define SBC_FS23_M_SAFETYG_ERROR             ((uint16)((uint16)0x0001U << SBC_FS23_M_SAFETYG_SHIFT))

/* No error */
#define SBC_FS23_M_HSXG_NO_ERROR             ((uint16)((uint16)0x0000U << SBC_FS23_M_HSXG_SHIFT))
/* High Side event or a Cyclic Sense event reported */
#define SBC_FS23_M_HSXG_ERROR                ((uint16)((uint16)0x0001U << SBC_FS23_M_HSXG_SHIFT))

/******************************************************************************/
/* M_STATUS - Type: RW                                                        */
/******************************************************************************/

#define SBC_FS23_M_STATUS_ADDR               ((uint8)(0x03U))
#define SBC_FS23_M_STATUS_DEFAULT            ((uint16)(0x0000U))

/* Real time Status of V3 Regulator */
#define SBC_FS23_M_V3_S_MASK                 ((uint16)(0x0001U))
#define SBC_FS23_M_V3_S_SHIFT                ((uint16)(0x0000U))
/* Real time status of V2 Regulator */
#define SBC_FS23_M_V2_S_MASK                 ((uint16)(0x0002U))
#define SBC_FS23_M_V2_S_SHIFT                ((uint16)(0x0001U))
/* Real time status of V1 Regulator */
#define SBC_FS23_M_V1_S_MASK                 ((uint16)(0x0004U))
#define SBC_FS23_M_V1_S_SHIFT                ((uint16)(0x0002U))
/* Real time status of the HVBUCK mode or HVLDO1 mode when used with ext PNP */
#define SBC_FS23_M_V1_MODE_MASK              ((uint16)(0x0008U))
#define SBC_FS23_M_V1_MODE_SHIFT             ((uint16)(0x0003U))
/* Real time status of LVIO3 input */
#define SBC_FS23_M_LVIO3_S_MASK              ((uint16)(0x0010U))
#define SBC_FS23_M_LVIO3_S_SHIFT             ((uint16)(0x0004U))
/* Real time status of LVIO4 input */
#define SBC_FS23_M_LVIO4_S_MASK              ((uint16)(0x0020U))
#define SBC_FS23_M_LVIO4_S_SHIFT             ((uint16)(0x0005U))
/* Real time status of LVI5 input */
#define SBC_FS23_M_LVI5_S_MASK               ((uint16)(0x0040U))
#define SBC_FS23_M_LVI5_S_SHIFT              ((uint16)(0x0006U))
/* Real time status of HVIO1 input */
#define SBC_FS23_M_HVIO1_S_MASK              ((uint16)(0x0080U))
#define SBC_FS23_M_HVIO1_S_SHIFT             ((uint16)(0x0007U))
/* Real time status of HVIO2 input */
#define SBC_FS23_M_HVIO2_S_MASK              ((uint16)(0x0100U))
#define SBC_FS23_M_HVIO2_S_SHIFT             ((uint16)(0x0008U))
/* Real time status of WAKE1 input */
#define SBC_FS23_M_WK1_S_MASK                ((uint16)(0x0200U))
#define SBC_FS23_M_WK1_S_SHIFT               ((uint16)(0x0009U))
/* Real time status of WAKE2 input */
#define SBC_FS23_M_WK2_S_MASK                ((uint16)(0x0400U))
#define SBC_FS23_M_WK2_S_SHIFT               ((uint16)(0x000AU))
/* Real time status of INIT mode */
#define SBC_FS23_M_INIT_S_MASK               ((uint16)(0x1000U))
#define SBC_FS23_M_INIT_S_SHIFT              ((uint16)(0x000CU))
/* Real time status of Normal mode */
#define SBC_FS23_M_NORMAL_S_MASK             ((uint16)(0x2000U))
#define SBC_FS23_M_NORMAL_S_SHIFT            ((uint16)(0x000DU))
/* Real time status of LPON mode */
#define SBC_FS23_M_LPON_S_MASK               ((uint16)(0x4000U))
#define SBC_FS23_M_LPON_S_SHIFT              ((uint16)(0x000EU))
/* Real time status of V1 temperature */
#define SBC_FS23_M_V1TWARN_S_MASK            ((uint16)(0x8000U))
#define SBC_FS23_M_V1TWARN_S_SHIFT           ((uint16)(0x000FU))

/* V3 is Disabled */
#define SBC_FS23_M_V3_S_DISABLED             ((uint16)((uint16)0x0000U << SBC_FS23_M_V3_S_SHIFT))
/* V3 is Enabled */
#define SBC_FS23_M_V3_S_ENABLED              ((uint16)((uint16)0x0001U << SBC_FS23_M_V3_S_SHIFT))

/* V2 is Disabled */
#define SBC_FS23_M_V2_S_DISABLED             ((uint16)((uint16)0x0000U << SBC_FS23_M_V2_S_SHIFT))
/* V2 is Enabled */
#define SBC_FS23_M_V2_S_ENABLED              ((uint16)((uint16)0x0001U << SBC_FS23_M_V2_S_SHIFT))

/* V1 is Disabled */
#define SBC_FS23_M_V1_S_DISABLED             ((uint16)((uint16)0x0000U << SBC_FS23_M_V1_S_SHIFT))
/* V1 is Enabled */
#define SBC_FS23_M_V1_S_ENABLED              ((uint16)((uint16)0x0001U << SBC_FS23_M_V1_S_SHIFT))

/* BUCK is in PWM mode or HVLDO1 PNP is enabled */
#define SBC_FS23_M_V1_MODE_PWM               ((uint16)((uint16)0x0000U << SBC_FS23_M_V1_MODE_SHIFT))
/* BUCK is in PFM mode or HVLDO1 PNP is disabled */
#define SBC_FS23_M_V1_MODE_PFM               ((uint16)((uint16)0x0001U << SBC_FS23_M_V1_MODE_SHIFT))

/* LVIO3 is Low */
#define SBC_FS23_M_LVIO3_S_LOW               ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO3_S_SHIFT))
/* LVIO3 is High */
#define SBC_FS23_M_LVIO3_S_HIGH              ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO3_S_SHIFT))

/* LVIO4 is Low */
#define SBC_FS23_M_LVIO4_S_LOW               ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO4_S_SHIFT))
/* LVIO4 is High */
#define SBC_FS23_M_LVIO4_S_HIGH              ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO4_S_SHIFT))

/* LVI5 is Low */
#define SBC_FS23_M_LVI5_S_LOW                ((uint16)((uint16)0x0000U << SBC_FS23_M_LVI5_S_SHIFT))
/* LVI5 is High */
#define SBC_FS23_M_LVI5_S_HIGH               ((uint16)((uint16)0x0001U << SBC_FS23_M_LVI5_S_SHIFT))

/* HVIO1 is Low */
#define SBC_FS23_M_HVIO1_S_LOW               ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO1_S_SHIFT))
/* HVIO1 is High */
#define SBC_FS23_M_HVIO1_S_HIGH              ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO1_S_SHIFT))

/* HVIO2 is Low */
#define SBC_FS23_M_HVIO2_S_LOW               ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO2_S_SHIFT))
/* HVIO2 is High */
#define SBC_FS23_M_HVIO2_S_HIGH              ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO2_S_SHIFT))

/* WAKE1 is Low */
#define SBC_FS23_M_WK1_S_LOW                 ((uint16)((uint16)0x0000U << SBC_FS23_M_WK1_S_SHIFT))
/* WAKE1 is High */
#define SBC_FS23_M_WK1_S_HIGH                ((uint16)((uint16)0x0001U << SBC_FS23_M_WK1_S_SHIFT))

/* WAKE2 is Low */
#define SBC_FS23_M_WK2_S_LOW                 ((uint16)((uint16)0x0000U << SBC_FS23_M_WK2_S_SHIFT))
/* WAKE2 is High */
#define SBC_FS23_M_WK2_S_HIGH                ((uint16)((uint16)0x0001U << SBC_FS23_M_WK2_S_SHIFT))

