wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* Device is Not in INIT mode */
#define SBC_FS23_M_INIT_S_NOT_INIT           ((uint16)((uint16)0x0000U << SBC_FS23_M_INIT_S_SHIFT))
/* Device is in INIT mode */
#define SBC_FS23_M_INIT_S_INIT               ((uint16)((uint16)0x0001U << SBC_FS23_M_INIT_S_SHIFT))

/* Device is Not in Normal mode */
#define SBC_FS23_M_NORMAL_S_NOT_NORMAL       ((uint16)((uint16)0x0000U << SBC_FS23_M_NORMAL_S_SHIFT))
/* Device is in Normal mode */
#define SBC_FS23_M_NORMAL_S_NORMAL           ((uint16)((uint16)0x0001U << SBC_FS23_M_NORMAL_S_SHIFT))

/* Device is Not in LPON mode */
#define SBC_FS23_M_LPON_S_NOT_LPON           ((uint16)((uint16)0x0000U << SBC_FS23_M_LPON_S_SHIFT))
/* Device is in LPON mode */
#define SBC_FS23_M_LPON_S_LPON               ((uint16)((uint16)0x0001U << SBC_FS23_M_LPON_S_SHIFT))

/* V1 temperature is below TjPW */
#define SBC_FS23_M_V1TWARN_S_BELOW           ((uint16)((uint16)0x0000U << SBC_FS23_M_V1TWARN_S_SHIFT))
/* V1 temperature is above TjPW */
#define SBC_FS23_M_V1TWARN_S_ABOVE           ((uint16)((uint16)0x0001U << SBC_FS23_M_V1TWARN_S_SHIFT))

/******************************************************************************/
/* M_SYS_CFG - Type: RW                                                       */
/******************************************************************************/

#define SBC_FS23_M_SYS_CFG_ADDR              ((uint8)(0x05U))
#define SBC_FS23_M_SYS_CFG_DEFAULT           ((uint16)(0x5000U))

/* Enable the Frequency Spread Spectrum */
#define SBC_FS23_M_MOD_EN_MASK               ((uint16)(0x0001U))
#define SBC_FS23_M_MOD_EN_SHIFT              ((uint16)(0x0000U))
/* Select the Spread Spectrum Modulation type */
#define SBC_FS23_M_MOD_CONF_MASK             ((uint16)(0x0002U))
#define SBC_FS23_M_MOD_CONF_SHIFT            ((uint16)(0x0001U))
/* Select INTB pulse duration */
#define SBC_FS23_M_INTB_DUR_MASK             ((uint16)(0x0008U))
#define SBC_FS23_M_INTB_DUR_SHIFT            ((uint16)(0x0003U))
/* Request INTB pulse */
#define SBC_FS23_M_INTB_REQ_MASK             ((uint16)(0x0010U))
#define SBC_FS23_M_INTB_REQ_SHIFT            ((uint16)(0x0004U))
/* Enable Interrupt Time Out wake-up capability */
#define SBC_FS23_M_INT_TO_WUEN_MASK          ((uint16)(0x0020U))
#define SBC_FS23_M_INT_TO_WUEN_SHIFT         ((uint16)(0x0005U))
/* Request to go in LPOFF mode from Normal mode */
#define SBC_FS23_M_GO2LPOFF_MASK             ((uint16)(0x0040U))
#define SBC_FS23_M_GO2LPOFF_SHIFT            ((uint16)(0x0006U))
/* Request to go in LPON mode from Normal mode */
#define SBC_FS23_M_GO2LPON_MASK              ((uint16)(0x0080U))
#define SBC_FS23_M_GO2LPON_SHIFT             ((uint16)(0x0007U))
/* Request to go in Normal mode from LPON mode */
#define SBC_FS23_M_GO2NORMAL_MASK            ((uint16)(0x0100U))
#define SBC_FS23_M_GO2NORMAL_SHIFT           ((uint16)(0x0008U))
/* Request to go in INIT phase */
#define SBC_FS23_M_GO2INIT_MASK              ((uint16)(0x0200U))
#define SBC_FS23_M_GO2INIT_SHIFT             ((uint16)(0x0009U))
/* Request LOCK_INIT bit to exit INIT phase */
#define SBC_FS23_M_LOCK_INIT_MASK            ((uint16)(0x0400U))
#define SBC_FS23_M_LOCK_INIT_SHIFT           ((uint16)(0x000AU))
/* Report a POR of the digital */
#define SBC_FS23_M_POR_MASK                  ((uint16)(0x1000U))
#define SBC_FS23_M_POR_SHIFT                 ((uint16)(0x000CU))
/* Report battery failure event (not reset by SOFTPOR_REQ) */
#define SBC_FS23_M_BAT_FAIL_MASK             ((uint16)(0x4000U))
#define SBC_FS23_M_BAT_FAIL_SHIFT            ((uint16)(0x000EU))

/* Spread spectrum is disabled */
#define SBC_FS23_M_MOD_EN_DISABLED           ((uint16)((uint16)0x0000U << SBC_FS23_M_MOD_EN_SHIFT))
/* Spread spectrum is enabled */
#define SBC_FS23_M_MOD_EN_ENABLED            ((uint16)((uint16)0x0001U << SBC_FS23_M_MOD_EN_SHIFT))

/* Triangular modulation is selected */
#define SBC_FS23_M_MOD_CONF_TRIANGULAR       ((uint16)((uint16)0x0000U << SBC_FS23_M_MOD_CONF_SHIFT))
/* Pseudo random modulation is selected */
#define SBC_FS23_M_MOD_CONF_PSEUDORANDOM     ((uint16)((uint16)0x0001U << SBC_FS23_M_MOD_CONF_SHIFT))

/* INTB pulse 25us */
#define SBC_FS23_M_INTB_DUR_25US             ((uint16)((uint16)0x0000U << SBC_FS23_M_INTB_DUR_SHIFT))
/* INTB pulse 100us */
#define SBC_FS23_M_INTB_DUR_100US            ((uint16)((uint16)0x0001U << SBC_FS23_M_INTB_DUR_SHIFT))

/* No effect */
#define SBC_FS23_M_INTB_REQ_NO_REQUEST       ((uint16)((uint16)0x0000U << SBC_FS23_M_INTB_REQ_SHIFT))
/* INTB pulse is requested */
#define SBC_FS23_M_INTB_REQ_REQUEST          ((uint16)((uint16)0x0001U << SBC_FS23_M_INTB_REQ_SHIFT))

/* Interrupt Time Out wake up capability is disabled */
#define SBC_FS23_M_INT_TO_WUEN_DISABLED      ((uint16)((uint16)0x0000U << SBC_FS23_M_INT_TO_WUEN_SHIFT))
/* Interrupt Time Out wake up capability is enabled */
#define SBC_FS23_M_INT_TO_WUEN_ENABLED       ((uint16)((uint16)0x0001U << SBC_FS23_M_INT_TO_WUEN_SHIFT))

/* No action */
#define SBC_FS23_M_GO2LPOFF_NO_ACTION        ((uint16)((uint16)0x0000U << SBC_FS23_M_GO2LPOFF_SHIFT))
/* Go to LPOFF mode */
#define SBC_FS23_M_GO2LPOFF_LPOFF            ((uint16)((uint16)0x0001U << SBC_FS23_M_GO2LPOFF_SHIFT))

/* No action */
#define SBC_FS23_M_GO2LPON_NO_ACTION         ((uint16)((uint16)0x0000U << SBC_FS23_M_GO2LPON_SHIFT))
/* Go to LPON mode */
#define SBC_FS23_M_GO2LPON_LPON              ((uint16)((uint16)0x0001U << SBC_FS23_M_GO2LPON_SHIFT))

/* No action */
#define SBC_FS23_M_GO2NORMAL_NO_ACTION       ((uint16)((uint16)0x0000U << SBC_FS23_M_GO2NORMAL_SHIFT))
/* Go to Normal mode */
#define SBC_FS23_M_GO2NORMAL_NORMAL          ((uint16)((uint16)0x0001U << SBC_FS23_M_GO2NORMAL_SHIFT))

/* No action */
#define SBC_FS23_M_GO2INIT_NO_ACTION         ((uint16)((uint16)0x0000U << SBC_FS23_M_GO2INIT_SHIFT))
/* Go to INIT phase */
#define SBC_FS23_M_GO2INIT_INIT              ((uint16)((uint16)0x0001U << SBC_FS23_M_GO2INIT_SHIFT))

/* No action */
#define SBC_FS23_M_LOCK_INIT_NO_ACTION       ((uint16)((uint16)0x0000U << SBC_FS23_M_LOCK_INIT_SHIFT))
/* Request LOCK_INIT bit to exit INIT phase */
#define SBC_FS23_M_LOCK_INIT_ACTION          ((uint16)((uint16)0x0001U << SBC_FS23_M_LOCK_INIT_SHIFT))

/* No POR event */
#define SBC_FS23_M_POR_NO_EVENT              ((uint16)((uint16)0x0000U << SBC_FS23_M_POR_SHIFT))
/* Digital POR event occurred */
#define SBC_FS23_M_POR_EVENT                 ((uint16)((uint16)0x0001U << SBC_FS23_M_POR_SHIFT))

