wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* No battery failure event */
#define SBC_FS23_M_BAT_FAIL_NO_EVENT         ((uint16)((uint16)0x0000U << SBC_FS23_M_BAT_FAIL_SHIFT))
/* Battery failure event occurred */
#define SBC_FS23_M_BAT_FAIL_EVENT            ((uint16)((uint16)0x0001U << SBC_FS23_M_BAT_FAIL_SHIFT))

/******************************************************************************/
/* M_SYS1_CFG - Type: RW                                                      */
/******************************************************************************/

#define SBC_FS23_M_SYS1_CFG_ADDR             ((uint8)(0x06U))
#define SBC_FS23_M_SYS1_CFG_DEFAULT          ((uint16)(0x0000U))

/* Real time status of OTP mode */
#define SBC_FS23_M_OTP_MODE_MASK             ((uint16)(0x0001U))
#define SBC_FS23_M_OTP_MODE_SHIFT            ((uint16)(0x0000U))
/* Leave OTP mode */
#define SBC_FS23_M_OTP_EXIT_MASK             ((uint16)(0x0002U))
#define SBC_FS23_M_OTP_EXIT_SHIFT            ((uint16)(0x0001U))
/* Real time status of Debug mode */
#define SBC_FS23_M_DBG_MODE_MASK             ((uint16)(0x0008U))
#define SBC_FS23_M_DBG_MODE_SHIFT            ((uint16)(0x0003U))
/* Leave DEBUG mode */
#define SBC_FS23_M_DBG_EXIT_MASK             ((uint16)(0x0010U))
#define SBC_FS23_M_DBG_EXIT_SHIFT            ((uint16)(0x0004U))
/* Request a Software POR of FS23 (reset the digital and restart from POR) */
#define SBC_FS23_M_SOFTPOR_REQ_MASK          ((uint16)(0x0040U))
#define SBC_FS23_M_SOFTPOR_REQ_SHIFT         ((uint16)(0x0006U))
/* Select the power down Time Slot */
#define SBC_FS23_M_TSLOT_DOWN_CFG_MASK       ((uint16)(0x0100U))
#define SBC_FS23_M_TSLOT_DOWN_CFG_SHIFT      ((uint16)(0x0008U))
/* Bypass the SLOT 2 during power up */
#define SBC_FS23_M_SLOT_BYP_MASK             ((uint16)(0x0200U))
#define SBC_FS23_M_SLOT_BYP_SHIFT            ((uint16)(0x0009U))
/* Bypass the OTP loading during power up */
#define SBC_FS23_M_LOAD_OTP_BYP_MASK         ((uint16)(0x0400U))
#define SBC_FS23_M_LOAD_OTP_BYP_SHIFT        ((uint16)(0x000AU))
/* VBOS to V1 switch always enabled */
#define SBC_FS23_M_VBOS2V1_SW_ALWAYS_EN_MASK  ((uint16)(0x1000U))
#define SBC_FS23_M_VBOS2V1_SW_ALWAYS_EN_SHIFT ((uint16)(0x000CU))

/* Device is not in OTP mode */
#define SBC_FS23_M_OTP_MODE_NOT_OTP          ((uint16)((uint16)0x0000U << SBC_FS23_M_OTP_MODE_SHIFT))
/* Device is in OTP mode */
#define SBC_FS23_M_OTP_MODE_OTP              ((uint16)((uint16)0x0001U << SBC_FS23_M_OTP_MODE_SHIFT))

/* No action */
#define SBC_FS23_M_OTP_EXIT_NO_ACTION        ((uint16)((uint16)0x0000U << SBC_FS23_M_OTP_EXIT_SHIFT))
/* Leave OTP mode */
#define SBC_FS23_M_OTP_EXIT_LEAVE            ((uint16)((uint16)0x0001U << SBC_FS23_M_OTP_EXIT_SHIFT))

/* Device is not in Debug mode */
#define SBC_FS23_M_DBG_MODE_NOT_DEBUG        ((uint16)((uint16)0x0000U << SBC_FS23_M_DBG_MODE_SHIFT))
/* Device is in Debug mode */
#define SBC_FS23_M_DBG_MODE_DEBUG            ((uint16)((uint16)0x0001U << SBC_FS23_M_DBG_MODE_SHIFT))

/* No action */
#define SBC_FS23_M_DBG_EXIT_NO_ACTION        ((uint16)((uint16)0x0000U << SBC_FS23_M_DBG_EXIT_SHIFT))
/* Leave DEBUG mode */
#define SBC_FS23_M_DBG_EXIT_LEAVE            ((uint16)((uint16)0x0001U << SBC_FS23_M_DBG_EXIT_SHIFT))

/* No action */
#define SBC_FS23_M_SOFTPOR_REQ_NO_ACTION     ((uint16)((uint16)0x0000U << SBC_FS23_M_SOFTPOR_REQ_SHIFT))
/* Software POR is requested */
#define SBC_FS23_M_SOFTPOR_REQ_POR           ((uint16)((uint16)0x0001U << SBC_FS23_M_SOFTPOR_REQ_SHIFT))

/* TSLOT 2ms */
#define SBC_FS23_M_TSLOT_DOWN_CFG_2MS        ((uint16)((uint16)0x0000U << SBC_FS23_M_TSLOT_DOWN_CFG_SHIFT))
/* TSLOT 0ms */
#define SBC_FS23_M_TSLOT_DOWN_CFG_0MS        ((uint16)((uint16)0x0001U << SBC_FS23_M_TSLOT_DOWN_CFG_SHIFT))

/* SLOT 2 is not bypassed */
#define SBC_FS23_M_SLOT_BYP_NOT_BYPASSED     ((uint16)((uint16)0x0000U << SBC_FS23_M_SLOT_BYP_SHIFT))
/* SLOT 2 is bypassed during power up */
#define SBC_FS23_M_SLOT_BYP_BYPASSED         ((uint16)((uint16)0x0001U << SBC_FS23_M_SLOT_BYP_SHIFT))

/* OTP loading is not bypassed */
#define SBC_FS23_M_LOAD_OTP_BYP_NOT_BYPASSED ((uint16)((uint16)0x0000U << SBC_FS23_M_LOAD_OTP_BYP_SHIFT))
/* OTP loading is bypassed */
#define SBC_FS23_M_LOAD_OTP_BYP_BYPASSED     ((uint16)((uint16)0x0001U << SBC_FS23_M_LOAD_OTP_BYP_SHIFT))

/* Not always enabled */
#define SBC_FS23_M_VBOS2V1_SW_ALWAYS_EN_NOT_ALWAYS ((uint16)((uint16)0x0000U << SBC_FS23_M_VBOS2V1_SW_ALWAYS_EN_SHIFT))
/* Always enabled */
#define SBC_FS23_M_VBOS2V1_SW_ALWAYS_EN_ALWAYS     ((uint16)((uint16)0x0001U << SBC_FS23_M_VBOS2V1_SW_ALWAYS_EN_SHIFT))

/******************************************************************************/
/* M_REG_CTRL - Type: RW                                                      */
/******************************************************************************/

#define SBC_FS23_M_REG_CTRL_ADDR             ((uint8)(0x07U))
#define SBC_FS23_M_REG_CTRL_DEFAULT          ((uint16)(0x0000U))

/* Request to disable V3 */
#define SBC_FS23_M_V3DIS_MASK                ((uint16)(0x0001U))
#define SBC_FS23_M_V3DIS_SHIFT               ((uint16)(0x0000U))
/* Request to enable V3 */
#define SBC_FS23_M_V3EN_MASK                 ((uint16)(0x0002U))
#define SBC_FS23_M_V3EN_SHIFT                ((uint16)(0x0001U))
/* Configure V3 state in LPON mode */
#define SBC_FS23_M_V3ON_LPON_MASK            ((uint16)(0x0004U))
#define SBC_FS23_M_V3ON_LPON_SHIFT           ((uint16)(0x0002U))
/* Request to disable V2 */
#define SBC_FS23_M_V2DIS_MASK                ((uint16)(0x0008U))
#define SBC_FS23_M_V2DIS_SHIFT               ((uint16)(0x0004U))
/* Request to enable V2 */
#define SBC_FS23_M_V2EN_MASK                 ((uint16)(0x0010U))
#define SBC_FS23_M_V2EN_SHIFT                ((uint16)(0x0005U))
/* Configure V2 state in LPON mode */
#define SBC_FS23_M_V2ON_LPON_MASK            ((uint16)(0x0020U))
#define SBC_FS23_M_V2ON_LPON_SHIFT           ((uint16)(0x0005U))
/* Select BUCK slew rate when the High Side turns ON */
#define SBC_FS23_M_BUCK_SRHSON_MASK          ((uint16)(0x0700U))
#define SBC_FS23_M_BUCK_SRHSON_SHIFT         ((uint16)(0x0008U))
/* Select BUCK slew rate when the High Side turns OFF */
#define SBC_FS23_M_BUCK_SRHSOFF_MASK         ((uint16)(0x1800U))
#define SBC_FS23_M_BUCK_SRHSOFF_SHIFT        ((uint16)(0x000BU))

