wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* No effect (Regulator remain in its current state) */
#define SBC_FS23_M_V3DIS_NO_EFFECT           ((uint16)((uint16)0x0000U << SBC_FS23_M_V3DIS_SHIFT))
/* Request to disable V3 */
#define SBC_FS23_M_V3DIS_DISABLE             ((uint16)((uint16)0x0001U << SBC_FS23_M_V3DIS_SHIFT))

/* No effect (Regulator remain in its current state) */
#define SBC_FS23_M_V3EN_NO_EFFECT            ((uint16)((uint16)0x0000U << SBC_FS23_M_V3EN_SHIFT))
/* Request to enable V3 */
#define SBC_FS23_M_V3EN_ENABLE               ((uint16)((uint16)0x0001U << SBC_FS23_M_V3EN_SHIFT))

/* Follow the power down slot configuration */
#define SBC_FS23_M_V3ON_LPON_FOLLOW          ((uint16)((uint16)0x0000U << SBC_FS23_M_V3ON_LPON_SHIFT))
/* Keep V3 ON in LPON if V3 was already ON in NORMAL mode */
#define SBC_FS23_M_V3ON_LPON_KEEP            ((uint16)((uint16)0x0001U << SBC_FS23_M_V3ON_LPON_SHIFT))

/* No effect (Regulator remain in its current state) */
#define SBC_FS23_M_V2DIS_NO_EFFECT           ((uint16)((uint16)0x0000U << SBC_FS23_M_V2DIS_SHIFT))
/* Request to disable V2 */
#define SBC_FS23_M_V2DIS_DISABLE             ((uint16)((uint16)0x0001U << SBC_FS23_M_V2DIS_SHIFT))

/* No effect (Regulator remain in its current state) */
#define SBC_FS23_M_V2EN_NO_EFFECT            ((uint16)((uint16)0x0000U << SBC_FS23_M_V2EN_SHIFT))
/* Request to enable V2 */
#define SBC_FS23_M_V2EN_DISABLE              ((uint16)((uint16)0x0001U << SBC_FS23_M_V2EN_SHIFT))

/* Follow the power down slot configuration */
#define SBC_FS23_M_V2ON_LPON_FOLLOW          ((uint16)((uint16)0x0000U << SBC_FS23_M_V2ON_LPON_SHIFT))
/* Keep V2 ON in LPON if V2 was already ON in NORMAL mode */
#define SBC_FS23_M_V2ON_LPON_KEEP            ((uint16)((uint16)0x0001U << SBC_FS23_M_V2ON_LPON_SHIFT))

/* HS rising slew rate is 20ns */
#define SBC_FS23_M_BUCK_SRHSON_20NS          ((uint16)((uint16)0x0001U << SBC_FS23_M_BUCK_SRHSON_SHIFT))
/* HS rising slew rate is 15ns */
#define SBC_FS23_M_BUCK_SRHSON_15NS          ((uint16)((uint16)0x0002U << SBC_FS23_M_BUCK_SRHSON_SHIFT))
/* HS rising slew rate is 10ns */
#define SBC_FS23_M_BUCK_SRHSON_10NS          ((uint16)((uint16)0x0003U << SBC_FS23_M_BUCK_SRHSON_SHIFT))
/* HS rising slew rate is 6.3ns */
#define SBC_FS23_M_BUCK_SRHSON_6NS           ((uint16)((uint16)0x0004U << SBC_FS23_M_BUCK_SRHSON_SHIFT))
/* HS rising slew rate is 5ns */
#define SBC_FS23_M_BUCK_SRHSON_5NS           ((uint16)((uint16)0x0005U << SBC_FS23_M_BUCK_SRHSON_SHIFT))
/* HS rising slew rate is 3ns */
#define SBC_FS23_M_BUCK_SRHSON_3NS           ((uint16)((uint16)0x0006U << SBC_FS23_M_BUCK_SRHSON_SHIFT))
/* HS rising slew rate is 2ns */
#define SBC_FS23_M_BUCK_SRHSON_2NS           ((uint16)((uint16)0x0007U << SBC_FS23_M_BUCK_SRHSON_SHIFT))

/* HS falling slew rate is 20ns */
#define SBC_FS23_M_BUCK_SRHSOFF_20NS         ((uint16)((uint16)0x0000U << SBC_FS23_M_BUCK_SRHSOFF_SHIFT))
/* HS falling slew rate is 15ns */
#define SBC_FS23_M_BUCK_SRHSOFF_15NS         ((uint16)((uint16)0x0001U << SBC_FS23_M_BUCK_SRHSOFF_SHIFT))
/* HS falling slew rate is 10ns */
#define SBC_FS23_M_BUCK_SRHSOFF_10NS         ((uint16)((uint16)0x0002U << SBC_FS23_M_BUCK_SRHSOFF_SHIFT))
/* HS falling slew rate is 5ns */
#define SBC_FS23_M_BUCK_SRHSOFF_5NS          ((uint16)((uint16)0x0003U << SBC_FS23_M_BUCK_SRHSOFF_SHIFT))

/******************************************************************************/
/* M_REG_FLG - Type: RW                                                       */
/******************************************************************************/

#define SBC_FS23_M_REG_FLG_ADDR              ((uint8)(0x0AU))
#define SBC_FS23_M_REG_FLG_DEFAULT           ((uint16)(0x0000U))

/* Report V3 Over Current event */
#define SBC_FS23_M_V3OC_I_MASK               ((uint16)(0x0001U))
#define SBC_FS23_M_V3OC_I_SHIFT              ((uint16)(0x0000U))
/* Report V2 Over Current event */
#define SBC_FS23_M_V2OC_I_MASK               ((uint16)(0x0002U))
#define SBC_FS23_M_V2OC_I_SHIFT              ((uint16)(0x0001U))
/* Report V1 Over Current event */
#define SBC_FS23_M_V1OC_I_MASK               ((uint16)(0x0004U))
#define SBC_FS23_M_V1OC_I_SHIFT              ((uint16)(0x0002U))
/* Report V3 Over Voltage event */
#define SBC_FS23_M_V3OV_I_MASK               ((uint16)(0x0008U))
#define SBC_FS23_M_V3OV_I_SHIFT              ((uint16)(0x0003U))
/* Report V2 Over Voltage event */
#define SBC_FS23_M_V2OV_I_MASK               ((uint16)(0x0010U))
#define SBC_FS23_M_V2OV_I_SHIFT              ((uint16)(0x0004U))
/* Report V1 Over Voltage event */
#define SBC_FS23_M_V1OV_I_MASK               ((uint16)(0x0020U))
#define SBC_FS23_M_V1OV_I_SHIFT              ((uint16)(0x0005U))
/* Report V3 Under Voltage event */
#define SBC_FS23_M_V3UV_I_MASK               ((uint16)(0x0040U))
#define SBC_FS23_M_V3UV_I_SHIFT              ((uint16)(0x0006U))
/* Report V2 Under Voltage event */
#define SBC_FS23_M_V2UV_I_MASK               ((uint16)(0x0080U))
#define SBC_FS23_M_V2UV_I_SHIFT              ((uint16)(0x0007U))
/* Report V1 Under Voltage event */
#define SBC_FS23_M_V1UV_I_MASK               ((uint16)(0x0100U))
#define SBC_FS23_M_V1UV_I_SHIFT              ((uint16)(0x0008U))
/* Report V2 open loop event */
#define SBC_FS23_M_V2OL_I_MASK               ((uint16)(0x0200U))
#define SBC_FS23_M_V2OL_I_SHIFT              ((uint16)(0x0009U))
/* Report V3 Thermal Shutdown event */
#define SBC_FS23_M_V3TSD_I_MASK              ((uint16)(0x0400U))
#define SBC_FS23_M_V3TSD_I_SHIFT             ((uint16)(0x000AU))
/* Report V2 Thermal Shutdown event */
#define SBC_FS23_M_V2TSD_I_MASK              ((uint16)(0x0800U))
#define SBC_FS23_M_V2TSD_I_SHIFT             ((uint16)(0x000BU))
/* Report V1 Thermal Shutdown event */
#define SBC_FS23_M_V1TSD_I_MASK              ((uint16)(0x1000U))
#define SBC_FS23_M_V1TSD_I_SHIFT             ((uint16)(0x000CU))
/* Report V1 Temperature Warning event */
#define SBC_FS23_M_V1TWARN_I_MASK            ((uint16)(0x2000U))
#define SBC_FS23_M_V1TWARN_I_SHIFT           ((uint16)(0x000DU))
/* Report VMON_EXT Over Voltage event */
#define SBC_FS23_M_V0OV_I_MASK               ((uint16)(0x4000U))
#define SBC_FS23_M_V0OV_I_SHIFT              ((uint16)(0x000EU))
/* Report VMON_EXT Under Voltage event */
#define SBC_FS23_M_V0UV_I_MASK               ((uint16)(0x8000U))
#define SBC_FS23_M_V0UV_I_SHIFT              ((uint16)(0x000FU))

/* No event detected */
#define SBC_FS23_M_V3OC_I_NO_EVENT           ((uint16)((uint16)0x0000U << SBC_FS23_M_V3OC_I_SHIFT))
/* V3 OC occurred */
#define SBC_FS23_M_V3OC_I_EVENT              ((uint16)((uint16)0x0001U << SBC_FS23_M_V3OC_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V2OC_I_NO_EVENT           ((uint16)((uint16)0x0000U << SBC_FS23_M_V2OC_I_SHIFT))
/* V2 OC occurred */
#define SBC_FS23_M_V2OC_I_EVENT              ((uint16)((uint16)0x0001U << SBC_FS23_M_V2OC_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V1OC_I_NO_EVENT           ((uint16)((uint16)0x0000U << SBC_FS23_M_V1OC_I_SHIFT))
/* V1 OC occurred */
#define SBC_FS23_M_V1OC_I_EVENT              ((uint16)((uint16)0x0001U << SBC_FS23_M_V1OC_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V3OV_I_NO_EVENT           ((uint16)((uint16)0x0000U << SBC_FS23_M_V3OV_I_SHIFT))
/* V3 OV occurred */
#define SBC_FS23_M_V3OV_I_EVENT              ((uint16)((uint16)0x0001U << SBC_FS23_M_V3OV_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V2OV_I_NO_EVENT           ((uint16)((uint16)0x0000U << SBC_FS23_M_V2OV_I_SHIFT))
/* V2 OV occurred */
#define SBC_FS23_M_V2OV_I_EVENT              ((uint16)((uint16)0x0001U << SBC_FS23_M_V2OV_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V1OV_I_NO_EVENT           ((uint16)((uint16)0x0000U << SBC_FS23_M_V1OV_I_SHIFT))
/* V1 OV occurred */
#define SBC_FS23_M_V1OV_I_EVENT              ((uint16)((uint16)0x0001U << SBC_FS23_M_V1OV_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V3UV_I_NO_EVENT           ((uint16)((uint16)0x0000U << SBC_FS23_M_V3UV_I_SHIFT))
/* V3 UV occurred */
#define SBC_FS23_M_V3UV_I_EVENT              ((uint16)((uint16)0x0001U << SBC_FS23_M_V3UV_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V2UV_I_NO_EVENT           ((uint16)((uint16)0x0000U << SBC_FS23_M_V2UV_I_SHIFT))
/* V2 UV occurred */
#define SBC_FS23_M_V2UV_I_EVENT              ((uint16)((uint16)0x0001U << SBC_FS23_M_V2UV_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V1UV_I_NO_EVENT           ((uint16)((uint16)0x0000U << SBC_FS23_M_V1UV_I_SHIFT))
/* V1 UV occurred */
#define SBC_FS23_M_V1UV_I_EVENT              ((uint16)((uint16)0x0001U << SBC_FS23_M_V1UV_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V2OL_I_NO_EVENT           ((uint16)((uint16)0x0000U << SBC_FS23_M_V2OL_I_SHIFT))
/* V2 OL occurred */
#define SBC_FS23_M_V2OL_I_EVENT              ((uint16)((uint16)0x0001U << SBC_FS23_M_V2OL_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V3TSD_I_NO_EVENT          ((uint16)((uint16)0x0000U << SBC_FS23_M_V3TSD_I_SHIFT))
/* V3 TSD occurred */
#define SBC_FS23_M_V3TSD_I_EVENT             ((uint16)((uint16)0x0001U << SBC_FS23_M_V3TSD_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V2TSD_I_NO_EVENT          ((uint16)((uint16)0x0000U << SBC_FS23_M_V2TSD_I_SHIFT))
/* V2 TSD occurred */
#define SBC_FS23_M_V2TSD_I_EVENT             ((uint16)((uint16)0x0001U << SBC_FS23_M_V2TSD_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V1TSD_I_NO_EVENT          ((uint16)((uint16)0x0000U << SBC_FS23_M_V1TSD_I_SHIFT))
/* V1 TSD occurred */
#define SBC_FS23_M_V1TSD_I_EVENT             ((uint16)((uint16)0x0001U << SBC_FS23_M_V1TSD_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V1TWARN_I_NO_EVENT        ((uint16)((uint16)0x0000U << SBC_FS23_M_V1TWARN_I_SHIFT))
/* Die V1 TWARN occurred */
#define SBC_FS23_M_V1TWARN_I_EVENT           ((uint16)((uint16)0x0001U << SBC_FS23_M_V1TWARN_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V0OV_I_NO_EVENT           ((uint16)((uint16)0x0000U << SBC_FS23_M_V0OV_I_SHIFT))
/* VMON_EXT OV occurred */
#define SBC_FS23_M_V0OV_I_EVENT              ((uint16)((uint16)0x0001U << SBC_FS23_M_V0OV_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_V0UV_I_NO_EVENT           ((uint16)((uint16)0x0000U << SBC_FS23_M_V0UV_I_SHIFT))
/* VMON_EXT UV occurred */
#define SBC_FS23_M_V0UV_I_EVENT              ((uint16)((uint16)0x0001U << SBC_FS23_M_V0UV_I_SHIFT))

/******************************************************************************/
/* M_REG_MSK - Type: RW                                                       */
/******************************************************************************/

#define SBC_FS23_M_REG_MSK_ADDR              ((uint8)(0x0BU))
#define SBC_FS23_M_REG_MSK_DEFAULT           ((uint16)(0x0000U))

