wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* Inhibit V3 Over Current interrupt */
#define SBC_FS23_M_V3OC_M_MASK               ((uint16)(0x0001U))
#define SBC_FS23_M_V3OC_M_SHIFT              ((uint16)(0x0000U))
/* Inhibit V2 Over Current interrupt */
#define SBC_FS23_M_V2OC_M_MASK               ((uint16)(0x0002U))
#define SBC_FS23_M_V2OC_M_SHIFT              ((uint16)(0x0001U))
/* Inhibit V1 Over Current interrupt */
#define SBC_FS23_M_V1OC_M_MASK               ((uint16)(0x0004U))
#define SBC_FS23_M_V1OC_M_SHIFT              ((uint16)(0x0002U))
/* Inhibit V3 Over Voltage interrupt */
#define SBC_FS23_M_V3OV_M_MASK               ((uint16)(0x0008U))
#define SBC_FS23_M_V3OV_M_SHIFT              ((uint16)(0x0003U))
/* Inhibit V2 Over Voltage interrupt */
#define SBC_FS23_M_V2OV_M_MASK               ((uint16)(0x0010U))
#define SBC_FS23_M_V2OV_M_SHIFT              ((uint16)(0x0004U))
/* Inhibit V1 Over Voltage interrupt */
#define SBC_FS23_M_V1OV_M_MASK               ((uint16)(0x0020U))
#define SBC_FS23_M_V1OV_M_SHIFT              ((uint16)(0x0005U))
/* Inhibit V3 Under Voltage interrupt */
#define SBC_FS23_M_V3UV_M_MASK               ((uint16)(0x0040U))
#define SBC_FS23_M_V3UV_M_SHIFT              ((uint16)(0x0006U))
/* Inhibit V2 Under Voltage interrupt */
#define SBC_FS23_M_V2UV_M_MASK               ((uint16)(0x0080U))
#define SBC_FS23_M_V2UV_M_SHIFT              ((uint16)(0x0007U))
/* Inhibit V1 Under Voltage interrupt */
#define SBC_FS23_M_V1UV_M_MASK               ((uint16)(0x0100U))
#define SBC_FS23_M_V1UV_M_SHIFT              ((uint16)(0x0008U))
/* Inhibit V2 Open Load interrupt */
#define SBC_FS23_M_V2OL_M_MASK               ((uint16)(0x0200U))
#define SBC_FS23_M_V2OL_M_SHIFT              ((uint16)(0x0009U))
/* Inhibit V3 Thermal Shutdown interrupt */
#define SBC_FS23_M_V3TSD_M_MASK              ((uint16)(0x0400U))
#define SBC_FS23_M_V3TSD_M_SHIFT             ((uint16)(0x000AU))
/* Inhibit V2 Thermal Shutdown interrupt */
#define SBC_FS23_M_V2TSD_M_MASK              ((uint16)(0x0800U))
#define SBC_FS23_M_V2TSD_M_SHIFT             ((uint16)(0x000BU))
/* Inhibit V1 Thermal Shutdown interrupt */
#define SBC_FS23_M_V1TSD_M_MASK              ((uint16)(0x1000U))
#define SBC_FS23_M_V1TSD_M_SHIFT             ((uint16)(0x000CU))
/* Inhibit V1 Thermal Warning interrupt */
#define SBC_FS23_M_V1TWARN_M_MASK            ((uint16)(0x2000U))
#define SBC_FS23_M_V1TWARN_M_SHIFT           ((uint16)(0x000DU))
/* Inhibit VMON_EXT Over Voltage interrupt */
#define SBC_FS23_M_V0OV_M_MASK               ((uint16)(0x4000U))
#define SBC_FS23_M_V0OV_M_SHIFT              ((uint16)(0x000EU))
/* Inhibit VMON_EXT Under Voltage interrupt */
#define SBC_FS23_M_V0UV_M_MASK               ((uint16)(0x8000U))
#define SBC_FS23_M_V0UV_M_SHIFT              ((uint16)(0x000FU))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V3OC_M_NOT_INHIBIT        ((uint16)((uint16)0x0000U << SBC_FS23_M_V3OC_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V3OC_M_INHIBIT            ((uint16)((uint16)0x0001U << SBC_FS23_M_V3OC_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V2OC_M_NOT_INHIBIT        ((uint16)((uint16)0x0000U << SBC_FS23_M_V2OC_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V2OC_M_INHIBIT            ((uint16)((uint16)0x0001U << SBC_FS23_M_V2OC_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V1OC_M_NOT_INHIBIT        ((uint16)((uint16)0x0000U << SBC_FS23_M_V1OC_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V1OC_M_INHIBIT            ((uint16)((uint16)0x0001U << SBC_FS23_M_V1OC_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V3OV_M_NOT_INHIBIT        ((uint16)((uint16)0x0000U << SBC_FS23_M_V3OV_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V3OV_M_INHIBIT            ((uint16)((uint16)0x0001U << SBC_FS23_M_V3OV_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V2OV_M_NOT_INHIBIT        ((uint16)((uint16)0x0000U << SBC_FS23_M_V2OV_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V2OV_M_INHIBIT            ((uint16)((uint16)0x0001U << SBC_FS23_M_V2OV_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V1OV_M_NOT_INHIBIT        ((uint16)((uint16)0x0000U << SBC_FS23_M_V1OV_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V1OV_M_INHIBIT            ((uint16)((uint16)0x0001U << SBC_FS23_M_V1OV_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V3UV_M_NOT_INHIBIT        ((uint16)((uint16)0x0000U << SBC_FS23_M_V3UV_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V3UV_M_INHIBIT            ((uint16)((uint16)0x0001U << SBC_FS23_M_V3UV_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V2UV_M_NOT_INHIBIT        ((uint16)((uint16)0x0000U << SBC_FS23_M_V2UV_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V2UV_M_INHIBIT            ((uint16)((uint16)0x0001U << SBC_FS23_M_V2UV_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V1UV_M_NOT_INHIBIT        ((uint16)((uint16)0x0000U << SBC_FS23_M_V1UV_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V1UV_M_INHIBIT            ((uint16)((uint16)0x0001U << SBC_FS23_M_V1UV_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V2OL_M_NOT_INHIBIT        ((uint16)((uint16)0x0000U << SBC_FS23_M_V2OL_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V2OL_M_INHIBIT            ((uint16)((uint16)0x0001U << SBC_FS23_M_V2OL_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V3TSD_M_NOT_INHIBIT       ((uint16)((uint16)0x0000U << SBC_FS23_M_V3TSD_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V3TSD_M_INHIBIT           ((uint16)((uint16)0x0001U << SBC_FS23_M_V3TSD_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V2TSD_M_NOT_INHIBIT       ((uint16)((uint16)0x0000U << SBC_FS23_M_V2TSD_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V2TSD_M_INHIBIT           ((uint16)((uint16)0x0001U << SBC_FS23_M_V2TSD_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V1TSD_M_NOT_INHIBIT       ((uint16)((uint16)0x0000U << SBC_FS23_M_V1TSD_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V1TSD_M_INHIBIT           ((uint16)((uint16)0x0001U << SBC_FS23_M_V1TSD_M_SHIFT))

