wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V1TWARN_M_NOT_INHIBIT     ((uint16)((uint16)0x0000U << SBC_FS23_M_V1TWARN_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V1TWARN_M_INHIBIT         ((uint16)((uint16)0x0001U << SBC_FS23_M_V1TWARN_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V0OV_M_NOT_INHIBIT        ((uint16)((uint16)0x0000U << SBC_FS23_M_V0OV_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V0OV_M_INHIBIT            ((uint16)((uint16)0x0001U << SBC_FS23_M_V0OV_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V0UV_M_NOT_INHIBIT        ((uint16)((uint16)0x0000U << SBC_FS23_M_V0UV_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V0UV_M_INHIBIT            ((uint16)((uint16)0x0001U << SBC_FS23_M_V0UV_M_SHIFT))

/******************************************************************************/
/* M_REG1_FLG - Type: RW                                                       */
/******************************************************************************/
#define SBC_FS23_M_REG1_FLG_ADDR            ((uint8)(0x0CU))
#define SBC_FS23_M_REG1_FLG_DEFAULT         ((uint16)(0x0000U))

/* Report V1 low side FET Over Current event (HVBUCK) */
#define SBC_FS23_M_V1_OCLS_I_MASK           ((uint16)(0x0001U))
#define SBC_FS23_M_V1_OCLS_I_SHIFT          ((uint16)(0x0000U))

/* No event detected */
#define SBC_FS23_M_V1_OCLS_I_NO_EVENT       ((uint16)((uint16)0x0000U << SBC_FS23_M_V1_OCLS_I_SHIFT))
/* V1 low side OC occured */
#define SBC_FS23_M_V1_OCLS_I_EVENT          ((uint16)((uint16)0x0001U << SBC_FS23_M_V1_OCLS_I_SHIFT))

/******************************************************************************/
/* M_REG1_MSK - Type: RW                                                       */
/******************************************************************************/
#define SBC_FS23_M_REG1_MSK_ADDR            ((uint8)(0x0DU))
#define SBC_FS23_M_REG1_MSK_DEFAULT         ((uint16)(0x0000U))

/* Inhibit V1 low side Over Current interrupt */
#define SBC_FS23_M_V1_OCLS_M_MASK           ((uint16)(0x0001U))
#define SBC_FS23_M_V1_OCLS_M_SHIFT          ((uint16)(0x0000U))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_V1_OCLS_M_NOT_INHIBIT    ((uint16)((uint16)0x0000U << SBC_FS23_M_V1_OCLS_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_V1_OCLS_M_INHIBIT        ((uint16)((uint16)0x0001U << SBC_FS23_M_V1_OCLS_M_SHIFT))


/******************************************************************************/
/* M_IO_CTRL - Type: RW                                                       */
/******************************************************************************/

#define SBC_FS23_M_IO_CTRL_ADDR              ((uint8)(0x0EU))
#define SBC_FS23_M_IO_CTRL_DEFAULT           ((uint16)(0x0000U))

/* Request to assert LVO6 when configured as an output */
#define SBC_FS23_M_LVO6LO_MASK               ((uint16)(0x0001U))
#define SBC_FS23_M_LVO6LO_SHIFT              ((uint16)(0x0000U))
/* Request to release LVO6 when configured as an output */
#define SBC_FS23_M_LVO6HI_MASK               ((uint16)(0x0002U))
#define SBC_FS23_M_LVO6HI_SHIFT              ((uint16)(0x0001U))
/* Request to assert LVIO4 when configured as an output */
#define SBC_FS23_M_LVIO4LO_MASK              ((uint16)(0x0004U))
#define SBC_FS23_M_LVIO4LO_SHIFT             ((uint16)(0x0002U))
/* Request to release LVIO4 when configured as an output */
#define SBC_FS23_M_LVIO4HI_MASK              ((uint16)(0x0008U))
#define SBC_FS23_M_LVIO4HI_SHIFT             ((uint16)(0x0003U))
/* Request to assert LVIO3 when configured as an output */
#define SBC_FS23_M_LVIO3LO_MASK              ((uint16)(0x0010U))
#define SBC_FS23_M_LVIO3LO_SHIFT             ((uint16)(0x0004U))
/* Request to release LVIO3 when configured as an output */
#define SBC_FS23_M_LVIO3HI_MASK              ((uint16)(0x0020U))
#define SBC_FS23_M_LVIO3HI_SHIFT             ((uint16)(0x0005U))
/* Request to assert HVIO2 when configured as an output */
#define SBC_FS23_M_HVIO2LO_MASK              ((uint16)(0x0040U))
#define SBC_FS23_M_HVIO2LO_SHIFT             ((uint16)(0x0006U))
/* Request to release HVIO2 when configured as an output */
#define SBC_FS23_M_HVIO2HI_MASK              ((uint16)(0x0080U))
#define SBC_FS23_M_HVIO2HI_SHIFT             ((uint16)(0x0007U))
/* Request to assert HVIO1 when configured as an output */
#define SBC_FS23_M_HVIO1LO_MASK              ((uint16)(0x0100U))
#define SBC_FS23_M_HVIO1LO_SHIFT             ((uint16)(0x0008U))
/* Request to release HVIO1 when configured as an output */
#define SBC_FS23_M_HVIO1HI_MASK              ((uint16)(0x0200U))
#define SBC_FS23_M_HVIO1HI_SHIFT             ((uint16)(0x0009U))

/* No effect (IO remain in its current state) */
#define SBC_FS23_M_LVO6LO_NO_REQUEST         ((uint16)((uint16)0x0000U << SBC_FS23_M_LVO6LO_SHIFT))
/* Request to assert LVO6 low */
#define SBC_FS23_M_LVO6LO_REQUEST            ((uint16)((uint16)0x0001U << SBC_FS23_M_LVO6LO_SHIFT))

/* No effect (IO remain in its current state) */
#define SBC_FS23_M_LVO6HI_NO_REQUEST         ((uint16)((uint16)0x0000U << SBC_FS23_M_LVO6HI_SHIFT))
/* Request to assert LVO6 high */
#define SBC_FS23_M_LVO6HI_REQUEST            ((uint16)((uint16)0x0001U << SBC_FS23_M_LVO6HI_SHIFT))

/* No effect (IO remain in its current state) */
#define SBC_FS23_M_LVIO4LO_NO_REQUEST        ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO4LO_SHIFT))
/* Request to assert LVIO4 low */
#define SBC_FS23_M_LVIO4LO_REQUEST           ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO4LO_SHIFT))

/* No effect (IO remain in its current state) */
#define SBC_FS23_M_LVIO4HI_NO_REQUEST        ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO4HI_SHIFT))
/* Request to assert LVIO4 high */
#define SBC_FS23_M_LVIO4HI_REQUEST           ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO4HI_SHIFT))

/* No effect (IO remain in its current state) */
#define SBC_FS23_M_LVIO3LO_NO_REQUEST        ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO3LO_SHIFT))
/* Request to assert LVIO3 low */
#define SBC_FS23_M_LVIO3LO_REQUEST           ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO3LO_SHIFT))

/* No effect (IO remain in its current state) */
#define SBC_FS23_M_LVIO3HI_NO_REQUEST        ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO3HI_SHIFT))
/* Request to assert LVIO3 high */
#define SBC_FS23_M_LVIO3HI_REQUEST           ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO3HI_SHIFT))

/* No effect (IO remain in its current state) */
#define SBC_FS23_M_HVIO2LO_NO_REQUEST        ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO2LO_SHIFT))
/* Request to assert HVIO2 low */
#define SBC_FS23_M_HVIO2LO_REQUEST           ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO2LO_SHIFT))

/* No effect (IO remain in its current state) */
#define SBC_FS23_M_HVIO2HI_NO_REQUEST        ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO2HI_SHIFT))
/* Request to assert HVIO2 high */
#define SBC_FS23_M_HVIO2HI_REQUEST           ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO2HI_SHIFT))

/* No effect (IO remain in its current state) */
#define SBC_FS23_M_HVIO1LO_NO_REQUEST        ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO1LO_SHIFT))
/* Request to assert HVIO1 low */
#define SBC_FS23_M_HVIO1LO_REQUEST           ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO1LO_SHIFT))

/* No effect (IO remain in its current state) */
#define SBC_FS23_M_HVIO1HI_NO_REQUEST        ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO1HI_SHIFT))
/* Request to assert HVIO1 high */
#define SBC_FS23_M_HVIO1HI_REQUEST           ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO1HI_SHIFT))

/******************************************************************************/
/* M_IO_TIMER_FLG - Type: RW                                                  */
/******************************************************************************/

#define SBC_FS23_M_IO_TIMER_FLG_ADDR         ((uint8)(0x0FU))
#define SBC_FS23_M_IO_TIMER_FLG_DEFAULT      ((uint16)(0x0000U))

/* Report WAKE1 input state change event if not masked */
#define SBC_FS23_M_WK1_I_MASK                ((uint16)(0x0001U))
#define SBC_FS23_M_WK1_I_SHIFT               ((uint16)(0x0000U))
/* Report WAKE2 input state change event if not masked */
#define SBC_FS23_M_WK2_I_MASK                ((uint16)(0x0002U))
#define SBC_FS23_M_WK2_I_SHIFT               ((uint16)(0x0001U))
/* Report HVIO1 input state change event if not masked */
#define SBC_FS23_M_HVIO1_I_MASK              ((uint16)(0x0008U))
#define SBC_FS23_M_HVIO1_I_SHIFT             ((uint16)(0x0003U))
/* Report HVIO2 input state change event if not masked */
#define SBC_FS23_M_HVIO2_I_MASK              ((uint16)(0x0010U))
#define SBC_FS23_M_HVIO2_I_SHIFT             ((uint16)(0x0004U))
/* Report LVIO3 input state change event if not masked */
#define SBC_FS23_M_LVIO3_I_MASK              ((uint16)(0x0020U))
#define SBC_FS23_M_LVIO3_I_SHIFT             ((uint16)(0x0005U))
/* Report LVIO4 input state change event if not masked */
#define SBC_FS23_M_LVIO4_I_MASK              ((uint16)(0x0040U))
#define SBC_FS23_M_LVIO4_I_SHIFT             ((uint16)(0x0006U))
/* Report LVI5 input state change event if not masked */
#define SBC_FS23_M_LVI5_I_MASK               ((uint16)(0x0080U))
#define SBC_FS23_M_LVI5_I_SHIFT              ((uint16)(0x0007U))
/* Report LDT event */
#define SBC_FS23_M_LDT_I_MASK                ((uint16)(0x0100U))
#define SBC_FS23_M_LDT_I_SHIFT               ((uint16)(0x0008U))

/* No event on WAKE1 */
#define SBC_FS23_M_WK1_I_NO_EVENT            ((uint16)((uint16)0x0000U << SBC_FS23_M_WK1_I_SHIFT))
/* Event on WAKE1 occurred */
#define SBC_FS23_M_WK1_I_EVENT               ((uint16)((uint16)0x0001U << SBC_FS23_M_WK1_I_SHIFT))

/* No event on WAKE2 */
#define SBC_FS23_M_WK2_I_NO_EVENT            ((uint16)((uint16)0x0000U << SBC_FS23_M_WK2_I_SHIFT))
/* Event on WAKE2 occurred */
#define SBC_FS23_M_WK2_I_EVENT               ((uint16)((uint16)0x0001U << SBC_FS23_M_WK2_I_SHIFT))

/* No event on HVIO1 */
#define SBC_FS23_M_HVIO1_I_NO_EVENT          ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO1_I_SHIFT))
/* Event on HVIO1 occurred */
#define SBC_FS23_M_HVIO1_I_EVENT             ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO1_I_SHIFT))

