wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* No event on HVIO2 */
#define SBC_FS23_M_HVIO2_I_NO_EVENT          ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO2_I_SHIFT))
/* Event on HVIO2 occurred */
#define SBC_FS23_M_HVIO2_I_EVENT             ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO2_I_SHIFT))

/* No event on LVIO3 */
#define SBC_FS23_M_LVIO3_I_NO_EVENT          ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO3_I_SHIFT))
/* Event on LVIO3 occurred */
#define SBC_FS23_M_LVIO3_I_EVENT             ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO3_I_SHIFT))

/* No event on LVIO4 */
#define SBC_FS23_M_LVIO4_I_NO_EVENT          ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO4_I_SHIFT))
/* Event on LVIO4 occurred */
#define SBC_FS23_M_LVIO4_I_EVENT             ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO4_I_SHIFT))

/* No event on LVI5 */
#define SBC_FS23_M_LVI5_I_NO_EVENT           ((uint16)((uint16)0x0000U << SBC_FS23_M_LVI5_I_SHIFT))
/* Event on LVI5 occurred */
#define SBC_FS23_M_LVI5_I_EVENT              ((uint16)((uint16)0x0001U << SBC_FS23_M_LVI5_I_SHIFT))

/* No event on LDT */
#define SBC_FS23_M_LDT_I_NO_EVENT            ((uint16)((uint16)0x0000U << SBC_FS23_M_LDT_I_SHIFT))
/* Event on LDT occurred */
#define SBC_FS23_M_LDT_I_EVENT               ((uint16)((uint16)0x0001U << SBC_FS23_M_LDT_I_SHIFT))

/******************************************************************************/
/* M_IO_TIMER_MSK - Type: RW                                                  */
/******************************************************************************/

#define SBC_FS23_M_IO_TIMER_MSK_ADDR         ((uint8)(0x10U))
#define SBC_FS23_M_IO_TIMER_MSK_DEFAULT      ((uint16)(0x0000U))

/* Inhibit WAKE1 input state change interrupt */
#define SBC_FS23_M_WK1_M_MASK                ((uint16)(0x0001U))
#define SBC_FS23_M_WK1_M_SHIFT               ((uint16)(0x0000U))
/* Inhibit WAKE2 input state change interrupt */
#define SBC_FS23_M_WK2_M_MASK                ((uint16)(0x0002U))
#define SBC_FS23_M_WK2_M_SHIFT               ((uint16)(0x0001U))
/* Inhibit HVIO1 input state change interrupt */
#define SBC_FS23_M_HVIO1_M_MASK              ((uint16)(0x0008U))
#define SBC_FS23_M_HVIO1_M_SHIFT             ((uint16)(0x0003U))
/* Inhibit HVIO2 input state change interrupt */
#define SBC_FS23_M_HVIO2_M_MASK              ((uint16)(0x0010U))
#define SBC_FS23_M_HVIO2_M_SHIFT             ((uint16)(0x0004U))
/* Inhibit LVIO3 input state change interrupt */
#define SBC_FS23_M_LVIO3_M_MASK              ((uint16)(0x0020U))
#define SBC_FS23_M_LVIO3_M_SHIFT             ((uint16)(0x0005U))
/* Inhibit LVIO4 input state change interrupt */
#define SBC_FS23_M_LVIO4_M_MASK              ((uint16)(0x0040U))
#define SBC_FS23_M_LVIO4_M_SHIFT             ((uint16)(0x0006U))
/* Inhibit LVI5 input state change interrupt */
#define SBC_FS23_M_LVI5_M_MASK               ((uint16)(0x0080U))
#define SBC_FS23_M_LVI5_M_SHIFT              ((uint16)(0x0007U))
/* Inhibit LDT event interrupt */
#define SBC_FS23_M_LDT_M_MASK                ((uint16)(0x0100U))
#define SBC_FS23_M_LDT_M_SHIFT               ((uint16)(0x0008U))

/* Interrupt is Not Inhibited in Normal mode */
#define SBC_FS23_M_WK1_M_NOT_INHIBIT         ((uint16)((uint16)0x0000U << SBC_FS23_M_WK1_M_SHIFT))
/* Interrupt is always Inhibited */
#define SBC_FS23_M_WK1_M_INHIBIT             ((uint16)((uint16)0x0001U << SBC_FS23_M_WK1_M_SHIFT))

/* Interrupt is Not Inhibited in Normal mode */
#define SBC_FS23_M_WK2_M_NOT_INHIBIT         ((uint16)((uint16)0x0000U << SBC_FS23_M_WK2_M_SHIFT))
/* Interrupt is always Inhibited */
#define SBC_FS23_M_WK2_M_INHIBIT             ((uint16)((uint16)0x0001U << SBC_FS23_M_WK2_M_SHIFT))

/* Interrupt is Not Inhibited in Normal mode */
#define SBC_FS23_M_HVIO1_M_NOT_INHIBIT       ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO1_M_SHIFT))
/* Interrupt is always Inhibited */
#define SBC_FS23_M_HVIO1_M_INHIBIT           ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO1_M_SHIFT))

/* Interrupt is Not Inhibited in Normal mode */
#define SBC_FS23_M_HVIO2_M_NOT_INHIBIT       ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO2_M_SHIFT))
/* Interrupt is always Inhibited */
#define SBC_FS23_M_HVIO2_M_INHIBIT           ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO2_M_SHIFT))

/* Interrupt is Not Inhibited in Normal mode */
#define SBC_FS23_M_LVIO3_M_NOT_INHIBIT       ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO3_M_SHIFT))
/* Interrupt is always Inhibited */
#define SBC_FS23_M_LVIO3_M_INHIBIT           ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO3_M_SHIFT))

/* Interrupt is Not Inhibited in Normal mode */
#define SBC_FS23_M_LVIO4_M_NOT_INHIBIT       ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO4_M_SHIFT))
/* Interrupt is always Inhibited */
#define SBC_FS23_M_LVIO4_M_INHIBIT           ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO4_M_SHIFT))

/* Interrupt is Not Inhibited in Normal mode */
#define SBC_FS23_M_LVI5_M_NOT_INHIBIT        ((uint16)((uint16)0x0000U << SBC_FS23_M_LVI5_M_SHIFT))
/* Interrupt is always Inhibited */
#define SBC_FS23_M_LVI5_M_INHIBIT            ((uint16)((uint16)0x0001U << SBC_FS23_M_LVI5_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_LDT_M_NOT_INHIBIT         ((uint16)((uint16)0x0000U << SBC_FS23_M_LDT_M_SHIFT))
/* Interrupt is always Inhibited */
#define SBC_FS23_M_LDT_M_INHIBIT             ((uint16)((uint16)0x0001U << SBC_FS23_M_LDT_M_SHIFT))

/******************************************************************************/
/* M_VSUP_COM_FLG - Type: RW                                                  */
/******************************************************************************/

#define SBC_FS23_M_VSUP_COM_FLG_ADDR         ((uint8)(0x11U))
#define SBC_FS23_M_VSUP_COM_FLG_DEFAULT      ((uint16)(0x0000U))

/* Report VSUP UV event */
#define SBC_FS23_M_VSUP_UV_I_MASK            ((uint16)(0x0001U))
#define SBC_FS23_M_VSUP_UV_I_SHIFT           ((uint16)(0x0000U))
/* Report VSUP OV event */
#define SBC_FS23_M_VSUP_OV_I_MASK            ((uint16)(0x0002U))
#define SBC_FS23_M_VSUP_OV_I_SHIFT           ((uint16)(0x0001U))
/* Report VSHS Under Voltage event */
#define SBC_FS23_M_VSHS_UV_I_MASK            ((uint16)(0x0004U))
#define SBC_FS23_M_VSHS_UV_I_SHIFT           ((uint16)(0x0002U))
/* Report VSHS Over Voltage event */
#define SBC_FS23_M_VSHS_OV_I_MASK            ((uint16)(0x0008U))
#define SBC_FS23_M_VSHS_OV_I_SHIFT           ((uint16)(0x0003U))
/* Report SPI request error due to writing or reading in an invalid register */
#define SBC_FS23_M_SPI_REQ_I_MASK            ((uint16)(0x0020U))
#define SBC_FS23_M_SPI_REQ_I_SHIFT           ((uint16)(0x0005U))
/* Report SPI clock error due to wrong number of clock pulses */
#define SBC_FS23_M_SPI_CLK_I_MASK            ((uint16)(0x0040U))
#define SBC_FS23_M_SPI_CLK_I_SHIFT           ((uint16)(0x0006U))
/* Report SPI CRC error due to incorrect CRC calculation */
#define SBC_FS23_M_SPI_CRC_I_MASK            ((uint16)(0x0080U))
#define SBC_FS23_M_SPI_CRC_I_SHIFT           ((uint16)(0x0007U))
/* Report I2C request error due to writing or reading in an invalid register */
#define SBC_FS23_M_I2C_REQ_I_MASK            ((uint16)(0x0100U))
#define SBC_FS23_M_I2C_REQ_I_SHIFT           ((uint16)(0x0008U))
/* Report I2C CRC error due to incorrect CRC calculation */
#define SBC_FS23_M_I2C_CRC_I_MASK            ((uint16)(0x0200U))
#define SBC_FS23_M_I2C_CRC_I_SHIFT           ((uint16)(0x0009U))
/* Report VBOS Under Voltage event */
#define SBC_FS23_M_VBOS_UV_MASK              ((uint16)(0x0800U))
#define SBC_FS23_M_VBOS_UV_SHIFT             ((uint16)(0x000BU))
/* Real time status of the switch between VBOS and V1 */
#define SBC_FS23_M_VBOS2V1SW_S_MASK          ((uint16)(0x1000U))
#define SBC_FS23_M_VBOS2V1SW_S_SHIFT         ((uint16)(0x000CU))

/* No VSUP Under Voltage event detected */
#define SBC_FS23_M_VSUP_UV_I_NO_EVENT        ((uint16)((uint16)0x0000U << SBC_FS23_M_VSUP_UV_I_SHIFT))
/* VSUP Under Voltage event occurred */
#define SBC_FS23_M_VSUP_UV_I_EVENT           ((uint16)((uint16)0x0001U << SBC_FS23_M_VSUP_UV_I_SHIFT))

/* No VSUP Over Voltage event detected */
#define SBC_FS23_M_VSUP_OV_I_NO_EVENT        ((uint16)((uint16)0x0000U << SBC_FS23_M_VSUP_OV_I_SHIFT))
/* VSUP Over Voltage event occurred */
#define SBC_FS23_M_VSUP_OV_I_EVENT           ((uint16)((uint16)0x0001U << SBC_FS23_M_VSUP_OV_I_SHIFT))

