wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* No VSHS Under Voltage event detected */
#define SBC_FS23_M_VSHS_UV_I_NO_EVENT        ((uint16)((uint16)0x0000U << SBC_FS23_M_VSHS_UV_I_SHIFT))
/* VSHS Under Voltage event occurred */
#define SBC_FS23_M_VSHS_UV_I_EVENT           ((uint16)((uint16)0x0001U << SBC_FS23_M_VSHS_UV_I_SHIFT))

/* No VSHS Under Voltage event detected */
#define SBC_FS23_M_VSHS_OV_I_NO_EVENT        ((uint16)((uint16)0x0000U << SBC_FS23_M_VSHS_OV_I_SHIFT))
/* VSHS Under Voltage event occurred */
#define SBC_FS23_M_VSHS_OV_I_EVENT           ((uint16)((uint16)0x0001U << SBC_FS23_M_VSHS_OV_I_SHIFT))

/* No error */
#define SBC_FS23_M_SPI_REQ_I_NO_ERROR        ((uint16)((uint16)0x0000U << SBC_FS23_M_SPI_REQ_I_SHIFT))
/* SPI request error reported */
#define SBC_FS23_M_SPI_REQ_I_ERROR           ((uint16)((uint16)0x0001U << SBC_FS23_M_SPI_REQ_I_SHIFT))

/* No error */
#define SBC_FS23_M_SPI_CLK_I_NO_ERROR        ((uint16)((uint16)0x0000U << SBC_FS23_M_SPI_CLK_I_SHIFT))
/* SPI clock error reported */
#define SBC_FS23_M_SPI_CLK_I_ERROR           ((uint16)((uint16)0x0001U << SBC_FS23_M_SPI_CLK_I_SHIFT))

/* No error */
#define SBC_FS23_M_SPI_CRC_I_NO_ERROR        ((uint16)((uint16)0x0000U << SBC_FS23_M_SPI_CRC_I_SHIFT))
/* SPI CRC error reported */
#define SBC_FS23_M_SPI_CRC_I_ERROR           ((uint16)((uint16)0x0001U << SBC_FS23_M_SPI_CRC_I_SHIFT))

/* No error */
#define SBC_FS23_M_I2C_REQ_I_NO_ERROR        ((uint16)((uint16)0x0000U << SBC_FS23_M_I2C_REQ_I_SHIFT))
/* I2C request error reported */
#define SBC_FS23_M_I2C_REQ_I_ERROR           ((uint16)((uint16)0x0001U << SBC_FS23_M_I2C_REQ_I_SHIFT))

/* No error */
#define SBC_FS23_M_I2C_CRC_I_NO_ERROR        ((uint16)((uint16)0x0000U << SBC_FS23_M_I2C_CRC_I_SHIFT))
/* I2C CRC error reported */
#define SBC_FS23_M_I2C_CRC_I_ERROR           ((uint16)((uint16)0x0001U << SBC_FS23_M_I2C_CRC_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_VBOS_UV_NO_EVENT          ((uint16)((uint16)0x0000U << SBC_FS23_M_VBOS_UV_SHIFT))
/* VBOS UV occurred */
#define SBC_FS23_M_VBOS_UV_EVENT             ((uint16)((uint16)0x0001U << SBC_FS23_M_VBOS_UV_SHIFT))

/* The switch is opened */
#define SBC_FS23_M_VBOS2V1SW_S_OPEN          ((uint16)((uint16)0x0000U << SBC_FS23_M_VBOS2V1SW_S_SHIFT))
/* The switch is closed */
#define SBC_FS23_M_VBOS2V1SW_S_CLOSED        ((uint16)((uint16)0x0001U << SBC_FS23_M_VBOS2V1SW_S_SHIFT))

/******************************************************************************/
/* M_VSUP_COM_MSK - Type: RW                                                  */
/******************************************************************************/

#define SBC_FS23_M_VSUP_COM_MSK_ADDR         ((uint8)(0x12U))
#define SBC_FS23_M_VSUP_COM_MSK_DEFAULT      ((uint16)(0x0000U))

/* Inhibit VSUP_UV Interrupt */
#define SBC_FS23_M_VSUP_UV_M_MASK            ((uint16)(0x0001U))
#define SBC_FS23_M_VSUP_UV_M_SHIFT           ((uint16)(0x0000U))
/* Inhibit VSUP_OV Interrupt */
#define SBC_FS23_M_VSUP_OV_M_MASK            ((uint16)(0x0002U))
#define SBC_FS23_M_VSUP_OV_M_SHIFT           ((uint16)(0x0001U))
/* Inhibit VSHS_UV Interrupt */
#define SBC_FS23_M_VSHS_UV_M_MASK            ((uint16)(0x0004U))
#define SBC_FS23_M_VSHS_UV_M_SHIFT           ((uint16)(0x0002U))
/* Inhibit VSHS_OV Interrupt */
#define SBC_FS23_M_VSHS_OV_M_MASK            ((uint16)(0x0008U))
#define SBC_FS23_M_VSHS_OV_M_SHIFT           ((uint16)(0x0003U))
/* Inhibit SPI request error Interrupt */
#define SBC_FS23_M_SPI_REQ_M_MASK            ((uint16)(0x0020U))
#define SBC_FS23_M_SPI_REQ_M_SHIFT           ((uint16)(0x0005U))
/* Inhibit SPI clock error Interrupt */
#define SBC_FS23_M_SPI_CLK_M_MASK            ((uint16)(0x0040U))
#define SBC_FS23_M_SPI_CLK_M_SHIFT           ((uint16)(0x0006U))
/* Inhibit SPI CRC error Interrupt */
#define SBC_FS23_M_SPI_CRC_M_MASK            ((uint16)(0x0080U))
#define SBC_FS23_M_SPI_CRC_M_SHIFT           ((uint16)(0x0007U))
/* Inhibit I2C request error Interrupt */
#define SBC_FS23_M_I2C_REQ_M_MASK            ((uint16)(0x0100U))
#define SBC_FS23_M_I2C_REQ_M_SHIFT           ((uint16)(0x0008U))
/* Inhibit I2C CRC error Interrupt */
#define SBC_FS23_M_I2C_CRC_M_MASK            ((uint16)(0x0200U))
#define SBC_FS23_M_I2C_CRC_M_SHIFT           ((uint16)(0x0009U))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_VSUP_UV_M_NOT_INHIBIT     ((uint16)((uint16)0x0000U << SBC_FS23_M_VSUP_UV_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_VSUP_UV_M_INHIBIT         ((uint16)((uint16)0x0001U << SBC_FS23_M_VSUP_UV_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_VSUP_OV_M_NOT_INHIBIT     ((uint16)((uint16)0x0000U << SBC_FS23_M_VSUP_OV_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_VSUP_OV_M_INHIBIT         ((uint16)((uint16)0x0001U << SBC_FS23_M_VSUP_OV_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_VSHS_UV_M_NOT_INHIBIT     ((uint16)((uint16)0x0000U << SBC_FS23_M_VSHS_UV_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_VSHS_UV_M_INHIBIT         ((uint16)((uint16)0x0001U << SBC_FS23_M_VSHS_UV_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_VSHS_OV_M_NOT_INHIBIT     ((uint16)((uint16)0x0000U << SBC_FS23_M_VSHS_OV_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_VSHS_OV_M_INHIBIT         ((uint16)((uint16)0x0001U << SBC_FS23_M_VSHS_OV_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_SPI_REQ_M_NOT_INHIBIT     ((uint16)((uint16)0x0000U << SBC_FS23_M_SPI_REQ_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_SPI_REQ_M_INHIBIT         ((uint16)((uint16)0x0001U << SBC_FS23_M_SPI_REQ_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_SPI_CLK_M_NOT_INHIBIT     ((uint16)((uint16)0x0000U << SBC_FS23_M_SPI_CLK_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_SPI_CLK_M_INHIBIT         ((uint16)((uint16)0x0001U << SBC_FS23_M_SPI_CLK_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_SPI_CRC_M_NOT_INHIBIT     ((uint16)((uint16)0x0000U << SBC_FS23_M_SPI_CRC_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_SPI_CRC_M_INHIBIT         ((uint16)((uint16)0x0001U << SBC_FS23_M_SPI_CRC_M_SHIFT))

