wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* Interrupt is Not Inhibited */
#define SBC_FS23_M_I2C_REQ_M_NOT_INHIBIT     ((uint16)((uint16)0x0000U << SBC_FS23_M_I2C_REQ_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_I2C_REQ_M_INHIBIT         ((uint16)((uint16)0x0001U << SBC_FS23_M_I2C_REQ_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_I2C_CRC_M_NOT_INHIBIT     ((uint16)((uint16)0x0000U << SBC_FS23_M_I2C_CRC_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_I2C_CRC_M_INHIBIT         ((uint16)((uint16)0x0001U << SBC_FS23_M_I2C_CRC_M_SHIFT))

/******************************************************************************/
/* M_IOWU_CFG - Type: RW                                                      */
/******************************************************************************/

#define SBC_FS23_M_IOWU_CFG_ADDR             ((uint8)(0x13U))
#define SBC_FS23_M_IOWU_CFG_DEFAULT          ((uint16)(0x0005U))

/* Configure WAKE1 wake-up polarity */
#define SBC_FS23_M_WK1_WUCFG_MASK            ((uint16)(0x0003U))
#define SBC_FS23_M_WK1_WUCFG_SHIFT           ((uint16)(0x0000U))
/* Configure WAKE2 wake-up polarity */
#define SBC_FS23_M_WK2_WUCFG_MASK            ((uint16)(0x000CU))
#define SBC_FS23_M_WK2_WUCFG_SHIFT           ((uint16)(0x0002U))
/* Configure HVIO1 wake-up polarity */
#define SBC_FS23_M_HVIO1_WUCFG_MASK          ((uint16)(0x0030U))
#define SBC_FS23_M_HVIO1_WUCFG_SHIFT         ((uint16)(0x0004U))
/* Configure HVIO2 wake-up polarity */
#define SBC_FS23_M_HVIO2_WUCFG_MASK          ((uint16)(0x00C0U))
#define SBC_FS23_M_HVIO2_WUCFG_SHIFT         ((uint16)(0x0006U))
/* Configure WAKE1 deglitcher time */
#define SBC_FS23_M_WK1_DGLT_MASK             ((uint16)(0x0100U))
#define SBC_FS23_M_WK1_DGLT_SHIFT            ((uint16)(0x0008U))
/* Configure WAKE2 deglitcher time */
#define SBC_FS23_M_WK2_DGLT_MASK             ((uint16)(0x0200U))
#define SBC_FS23_M_WK2_DGLT_SHIFT            ((uint16)(0x0009U))
/* Configure HVIO1 deglitcher time */
#define SBC_FS23_M_HVIO1_DGLT_MASK           ((uint16)(0x0400U))
#define SBC_FS23_M_HVIO1_DGLT_SHIFT          ((uint16)(0x000AU))
/* Configure HVIO2 deglitcher time */
#define SBC_FS23_M_HVIO2_DGLT_MASK           ((uint16)(0x0800U))
#define SBC_FS23_M_HVIO2_DGLT_SHIFT          ((uint16)(0x000BU))
/* Configure LVIO3 wake-up polarity */
#define SBC_FS23_M_LVIO3_WUCFG_MASK          ((uint16)(0x2000U))
#define SBC_FS23_M_LVIO3_WUCFG_SHIFT         ((uint16)(0x000DU))
/* Configure LVIO4 wake-up polarity */
#define SBC_FS23_M_LVIO4_WUCFG_MASK          ((uint16)(0x4000U))
#define SBC_FS23_M_LVIO4_WUCFG_SHIFT         ((uint16)(0x000EU))
/* Configure LVI5 wake-up polarity */
#define SBC_FS23_M_LVI5_WUCFG_MASK           ((uint16)(0x8000U))
#define SBC_FS23_M_LVI5_WUCFG_SHIFT          ((uint16)(0x000FU))

/* Input comparator disabled in LP modes only (no consumption) */
#define SBC_FS23_M_WK1_WUCFG_DISABLED        ((uint16)((uint16)0x0000U << SBC_FS23_M_WK1_WUCFG_SHIFT))
/* High level wake up is configured */
#define SBC_FS23_M_WK1_WUCFG_HIGH            ((uint16)((uint16)0x0001U << SBC_FS23_M_WK1_WUCFG_SHIFT))
/* Low level wake up is configured */
#define SBC_FS23_M_WK1_WUCFG_LOW             ((uint16)((uint16)0x0002U << SBC_FS23_M_WK1_WUCFG_SHIFT))
/* Cyclic sense wake up is configured */
#define SBC_FS23_M_WK1_WUCFG_CYCLIC          ((uint16)((uint16)0x0003U << SBC_FS23_M_WK1_WUCFG_SHIFT))

/* Input comparator disabled in LP modes only (no consumption) */
#define SBC_FS23_M_WK2_WUCFG_DISABLED        ((uint16)((uint16)0x0000U << SBC_FS23_M_WK2_WUCFG_SHIFT))
/* High level wake up is configured */
#define SBC_FS23_M_WK2_WUCFG_HIGH            ((uint16)((uint16)0x0001U << SBC_FS23_M_WK2_WUCFG_SHIFT))
/* Low level wake up is configured */
#define SBC_FS23_M_WK2_WUCFG_LOW             ((uint16)((uint16)0x0002U << SBC_FS23_M_WK2_WUCFG_SHIFT))
/* Cyclic sense wake up is configured */
#define SBC_FS23_M_WK2_WUCFG_CYCLIC          ((uint16)((uint16)0x0003U << SBC_FS23_M_WK2_WUCFG_SHIFT))

/* Input comparator disabled in LP modes only (no consumption) */
#define SBC_FS23_M_HVIO1_WUCFG_DISABLED      ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO1_WUCFG_SHIFT))
/* High level wake up is configured */
#define SBC_FS23_M_HVIO1_WUCFG_HIGH          ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO1_WUCFG_SHIFT))
/* Low level wake up is configured */
#define SBC_FS23_M_HVIO1_WUCFG_LOW           ((uint16)((uint16)0x0002U << SBC_FS23_M_HVIO1_WUCFG_SHIFT))
/* Cyclic sense wake up is configured */
#define SBC_FS23_M_HVIO1_WUCFG_CYCLIC        ((uint16)((uint16)0x0003U << SBC_FS23_M_HVIO1_WUCFG_SHIFT))

/* Input comparator disabled in LP modes only (no consumption) */
#define SBC_FS23_M_HVIO2_WUCFG_DISABLED      ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO2_WUCFG_SHIFT))
/* High level wake up is configured */
#define SBC_FS23_M_HVIO2_WUCFG_HIGH          ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO2_WUCFG_SHIFT))
/* Low level wake up is configured */
#define SBC_FS23_M_HVIO2_WUCFG_LOW           ((uint16)((uint16)0x0002U << SBC_FS23_M_HVIO2_WUCFG_SHIFT))
/* Cyclic sense wake up is configured */
#define SBC_FS23_M_HVIO2_WUCFG_CYCLIC        ((uint16)((uint16)0x0003U << SBC_FS23_M_HVIO2_WUCFG_SHIFT))

/* WAKE1 deglitcher = 15 us */
#define SBC_FS23_M_WK1_DGLT_15US             ((uint16)((uint16)0x0000U << SBC_FS23_M_WK1_DGLT_SHIFT))
/* WAKE1 deglitcher = 65 us */
#define SBC_FS23_M_WK1_DGLT_65US             ((uint16)((uint16)0x0001U << SBC_FS23_M_WK1_DGLT_SHIFT))

/* WAKE2 deglitcher = 15 us */
#define SBC_FS23_M_WK2_DGLT_15US             ((uint16)((uint16)0x0000U << SBC_FS23_M_WK2_DGLT_SHIFT))
/* WAKE2 deglitcher = 65 us */
#define SBC_FS23_M_WK2_DGLT_65US             ((uint16)((uint16)0x0001U << SBC_FS23_M_WK2_DGLT_SHIFT))

/* HVIO1 deglitcher = 15 us */
#define SBC_FS23_M_HVIO1_DGLT_15US           ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO1_DGLT_SHIFT))
/* HVIO1 deglitcher = 65 us */
#define SBC_FS23_M_HVIO1_DGLT_65US           ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO1_DGLT_SHIFT))

/* HVIO2 deglitcher = 15 us */
#define SBC_FS23_M_HVIO2_DGLT_15US           ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO2_DGLT_SHIFT))
/* HVIO2 deglitcher = 65 us */
#define SBC_FS23_M_HVIO2_DGLT_65US           ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO2_DGLT_SHIFT))

/* High level wake up is configured */
#define SBC_FS23_M_LVIO3_WUCFG_HIGH          ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO3_WUCFG_SHIFT))
/* Low level wake up is configured */
#define SBC_FS23_M_LVIO3_WUCFG_LOW           ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO3_WUCFG_SHIFT))

/* High level wake up is configured */
#define SBC_FS23_M_LVIO4_WUCFG_HIGH          ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO4_WUCFG_SHIFT))
/* Low level wake up is configured */
#define SBC_FS23_M_LVIO4_WUCFG_LOW           ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO4_WUCFG_SHIFT))

/* High level wake up is configured */
#define SBC_FS23_M_LVI5_WUCFG_HIGH           ((uint16)((uint16)0x0000U << SBC_FS23_M_LVI5_WUCFG_SHIFT))
/* Low level wake up is configured */
#define SBC_FS23_M_LVI5_WUCFG_LOW            ((uint16)((uint16)0x0001U << SBC_FS23_M_LVI5_WUCFG_SHIFT))

/******************************************************************************/
/* M_IOWU_EN - Type: RW                                                       */
/******************************************************************************/

#define SBC_FS23_M_IOWU_EN_ADDR              ((uint8)(0x14U))
#define SBC_FS23_M_IOWU_EN_DEFAULT           ((uint16)(0x00FFU))

/* Configure WAKE1 wake up and interrupt capability */
#define SBC_FS23_M_WK1_WUEN_MASK             ((uint16)(0x0003U))
#define SBC_FS23_M_WK1_WUEN_WAKEUP_MASK      ((uint16)(0x0001U ))
#define SBC_FS23_M_WK1_WUEN_INTERRUPT_MASK   ((uint16)(0x0002U))
#define SBC_FS23_M_WK1_WUEN_SHIFT            ((uint16)(0x0000U))
/* Configure WAKE2 wake up and interrupt capability */
#define SBC_FS23_M_WK2_WUEN_MASK             ((uint16)(0x000CU))
#define SBC_FS23_M_WK2_WUEN_WAKEUP_MASK      ((uint16)(0x0004U))
#define SBC_FS23_M_WK2_WUEN_INTERRUPT_MASK   ((uint16)(0x0008U))
#define SBC_FS23_M_WK2_WUEN_SHIFT            ((uint16)(0x0002U))
/* Configure HVIO1 wake up and interrupt capability */
#define SBC_FS23_M_HVIO1_WUEN_MASK           ((uint16)(0x0030U))
#define SBC_FS23_M_HVIO1_WUEN_WAKEUP_MASK    ((uint16)(0x0010U))
#define SBC_FS23_M_HVIO1_WUEN_INTERRUPT_MASK ((uint16)(0x0020U))
#define SBC_FS23_M_HVIO1_WUEN_SHIFT          ((uint16)(0x0004U))
/* Configure HVIO2 wake up and interrupt capability */
#define SBC_FS23_M_HVIO2_WUEN_MASK           ((uint16)(0x00C0U))
#define SBC_FS23_M_HVIO2_WUEN_WAKEUP_MASK    ((uint16)(0x0040U))
#define SBC_FS23_M_HVIO2_WUEN_INTERRUPT_MASK ((uint16)(0x0080U))
#define SBC_FS23_M_HVIO2_WUEN_SHIFT          ((uint16)(0x0006U))
/* Configure LVIO3 wake up and interrupt capability */
#define SBC_FS23_M_LVIO3_WUEN_MASK           ((uint16)(0x0300U))
#define SBC_FS23_M_LVIO3_WUEN_WAKEUP_MASK    ((uint16)(0x0100U))
#define SBC_FS23_M_LVIO3_WUEN_INTERRUPT_MASK ((uint16)(0x0200U))
#define SBC_FS23_M_LVIO3_WUEN_SHIFT          ((uint16)(0x0008U))
/* Configure LVIO4 wake up and interrupt capability */
#define SBC_FS23_M_LVIO4_WUEN_MASK           ((uint16)(0x0C00U))
#define SBC_FS23_M_LVIO4_WUEN_WAKEUP_MASK    ((uint16)(0x0400U))
#define SBC_FS23_M_LVIO4_WUEN_INTERRUPT_MASK ((uint16)(0x0800U))
#define SBC_FS23_M_LVIO4_WUEN_SHIFT          ((uint16)(0x000AU))
/* Configure LVI5 wake up and interrupt capability */
#define SBC_FS23_M_LVI5_WUEN_MASK            ((uint16)(0x3000U))
#define SBC_FS23_M_LVI5_WUEN_WAKEUP_MASK     ((uint16)(0x1000U))
#define SBC_FS23_M_LVI5_WUEN_INTERRUPT_MASK  ((uint16)(0x2000U))
#define SBC_FS23_M_LVI5_WUEN_SHIFT           ((uint16)(0x000CU))

/* No wake up and no interrupt */
#define SBC_FS23_M_WK1_WUEN_NONE             ((uint16)((uint16)0x0000U << SBC_FS23_M_WK1_WUEN_SHIFT))
/* Wake up only */
#define SBC_FS23_M_WK1_WUEN_WAKEUP           ((uint16)((uint16)0x0001U << SBC_FS23_M_WK1_WUEN_SHIFT))
/* Interrupt only */
#define SBC_FS23_M_WK1_WUEN_INTERRUPT        ((uint16)((uint16)0x0002U << SBC_FS23_M_WK1_WUEN_SHIFT))
/* Wake up and interrupt */
#define SBC_FS23_M_WK1_WUEN_BOTH             ((uint16)((uint16)0x0003U << SBC_FS23_M_WK1_WUEN_SHIFT))

/* No wake up and no interrupt */
#define SBC_FS23_M_WK2_WUEN_NONE             ((uint16)((uint16)0x0000U << SBC_FS23_M_WK2_WUEN_SHIFT))
/* Wake up only */
#define SBC_FS23_M_WK2_WUEN_WAKEUP           ((uint16)((uint16)0x0001U << SBC_FS23_M_WK2_WUEN_SHIFT))
/* Interrupt only */
#define SBC_FS23_M_WK2_WUEN_INTERRUPT        ((uint16)((uint16)0x0002U << SBC_FS23_M_WK2_WUEN_SHIFT))
/* Wake up and interrupt */
#define SBC_FS23_M_WK2_WUEN_BOTH             ((uint16)((uint16)0x0003U << SBC_FS23_M_WK2_WUEN_SHIFT))

/* No wake up and no interrupt */
#define SBC_FS23_M_HVIO1_WUEN_NONE           ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO1_WUEN_SHIFT))
/* Wake up only */
#define SBC_FS23_M_HVIO1_WUEN_WAKEUP         ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO1_WUEN_SHIFT))
/* Interrupt only */
#define SBC_FS23_M_HVIO1_WUEN_INTERRUPT      ((uint16)((uint16)0x0002U << SBC_FS23_M_HVIO1_WUEN_SHIFT))
/* Wake up and interrupt */
#define SBC_FS23_M_HVIO1_WUEN_BOTH           ((uint16)((uint16)0x0003U << SBC_FS23_M_HVIO1_WUEN_SHIFT))

/* No wake up and no interrupt */
#define SBC_FS23_M_HVIO2_WUEN_NONE           ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO2_WUEN_SHIFT))
/* Wake up only */
#define SBC_FS23_M_HVIO2_WUEN_WAKEUP         ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO2_WUEN_SHIFT))
/* Interrupt only */
#define SBC_FS23_M_HVIO2_WUEN_INTERRUPT      ((uint16)((uint16)0x0002U << SBC_FS23_M_HVIO2_WUEN_SHIFT))
/* Wake up and interrupt */
#define SBC_FS23_M_HVIO2_WUEN_BOTH           ((uint16)((uint16)0x0003U << SBC_FS23_M_HVIO2_WUEN_SHIFT))

/* No wake up and no interrupt */
#define SBC_FS23_M_LVIO3_WUEN_NONE           ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO3_WUEN_SHIFT))
/* Wake up only */
#define SBC_FS23_M_LVIO3_WUEN_WAKEUP         ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO3_WUEN_SHIFT))
/* Interrupt only */
#define SBC_FS23_M_LVIO3_WUEN_INTERRUPT      ((uint16)((uint16)0x0002U << SBC_FS23_M_LVIO3_WUEN_SHIFT))
/* Wake up and interrupt */
#define SBC_FS23_M_LVIO3_WUEN_BOTH           ((uint16)((uint16)0x0003U << SBC_FS23_M_LVIO3_WUEN_SHIFT))

/* No wake up and no interrupt */
#define SBC_FS23_M_LVIO4_WUEN_NONE           ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO4_WUEN_SHIFT))
/* Wake up only */
#define SBC_FS23_M_LVIO4_WUEN_WAKEUP         ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO4_WUEN_SHIFT))
/* Interrupt only */
#define SBC_FS23_M_LVIO4_WUEN_INTERRUPT      ((uint16)((uint16)0x0002U << SBC_FS23_M_LVIO4_WUEN_SHIFT))
/* Wake up and interrupt */
#define SBC_FS23_M_LVIO4_WUEN_BOTH           ((uint16)((uint16)0x0003U << SBC_FS23_M_LVIO4_WUEN_SHIFT))

/* No wake up and no interrupt */
#define SBC_FS23_M_LVI5_WUEN_NONE            ((uint16)((uint16)0x0000U << SBC_FS23_M_LVI5_WUEN_SHIFT))
/* Wake up only */
#define SBC_FS23_M_LVI5_WUEN_WAKEUP          ((uint16)((uint16)0x0001U << SBC_FS23_M_LVI5_WUEN_SHIFT))
/* Interrupt only */
#define SBC_FS23_M_LVI5_WUEN_INTERRUPT       ((uint16)((uint16)0x0002U << SBC_FS23_M_LVI5_WUEN_SHIFT))
/* Wake up and interrupt */
#define SBC_FS23_M_LVI5_WUEN_BOTH            ((uint16)((uint16)0x0003U << SBC_FS23_M_LVI5_WUEN_SHIFT))

/******************************************************************************/
/* M_IOWU_FLG - Type: RW                                                      */
/******************************************************************************/

#define SBC_FS23_M_IOWU_FLG_ADDR             ((uint8)(0x15U))
#define SBC_FS23_M_IOWU_FLG_DEFAULT          ((uint16)(0x0000U))

