wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* Report WAKE1 wake up event */
#define SBC_FS23_M_WK1_WU_I_MASK             ((uint16)(0x0001U))
#define SBC_FS23_M_WK1_WU_I_SHIFT            ((uint16)(0x0000U))
/* Report WAKE2 wake up event */
#define SBC_FS23_M_WK2_WU_I_MASK             ((uint16)(0x0002U))
#define SBC_FS23_M_WK2_WU_I_SHIFT            ((uint16)(0x0001U))
/* Report WAKE1 state at trigger point */
#define SBC_FS23_M_WK1_CYC_S_MASK            ((uint16)(0x0004U))
#define SBC_FS23_M_WK1_CYC_S_SHIFT           ((uint16)(0x0002U))
/* Report WAKE2 state at trigger point */
#define SBC_FS23_M_WK2_CYC_S_MASK            ((uint16)(0x0008U))
#define SBC_FS23_M_WK2_CYC_S_SHIFT           ((uint16)(0x0003U))
/* Report WAKE1 readiness for cyclic sense */
#define SBC_FS23_M_WK1_CYS_RDY_MASK          ((uint16)(0x0010U))
#define SBC_FS23_M_WK1_CYS_RDY_SHIFT         ((uint16)(0x0004U))
/* Report WAKE2 readiness for cyclic sense */
#define SBC_FS23_M_WK2_CYS_RDY_MASK          ((uint16)(0x0020U))
#define SBC_FS23_M_WK2_CYS_RDY_SHIFT         ((uint16)(0x0005U))
/* Report HVIO1 wake up event */
#define SBC_FS23_M_HVIO1_WU_I_MASK           ((uint16)(0x0040U))
#define SBC_FS23_M_HVIO1_WU_I_SHIFT          ((uint16)(0x0006U))
/* Report HVIO2 wake up event */
#define SBC_FS23_M_HVIO2_WU_I_MASK           ((uint16)(0x0080U))
#define SBC_FS23_M_HVIO2_WU_I_SHIFT          ((uint16)(0x0007U))
/* Report HVIO1 state at trigger point */
#define SBC_FS23_M_HVIO1_CYC_S_MASK          ((uint16)(0x0100U))
#define SBC_FS23_M_HVIO1_CYC_S_SHIFT         ((uint16)(0x0008U))
/* Report HVIO2 state at trigger point */
#define SBC_FS23_M_HVIO2_CYC_S_MASK          ((uint16)(0x0200U))
#define SBC_FS23_M_HVIO2_CYC_S_SHIFT         ((uint16)(0x0009U))
/* Report HVIO1 readiness for cyclic sense */
#define SBC_FS23_M_HVIO1_CYS_RDY_MASK        ((uint16)(0x0400U))
#define SBC_FS23_M_HVIO1_CYS_RDY_SHIFT       ((uint16)(0x000AU))
/* Report HVIO2 readiness for cyclic sense */
#define SBC_FS23_M_HVIO2_CYS_RDY_MASK        ((uint16)(0x0800U))
#define SBC_FS23_M_HVIO2_CYS_RDY_SHIFT       ((uint16)(0x000BU))
/* Report LVIO3 wake up event (outside NORMAL mode) */
#define SBC_FS23_M_LVIO3_WU_I_MASK           ((uint16)(0x2000U))
#define SBC_FS23_M_LVIO3_WU_I_SHIFT          ((uint16)(0x000DU))
/* Report LVIO4 wake up event (outside NORMAL mode) */
#define SBC_FS23_M_LVIO4_WU_I_MASK           ((uint16)(0x4000U))
#define SBC_FS23_M_LVIO4_WU_I_SHIFT          ((uint16)(0x000EU))
/* Report LVI5 wake up event (outside NORMAL mode) */
#define SBC_FS23_M_LVI5_WU_I_MASK            ((uint16)(0x8000U))
#define SBC_FS23_M_LVI5_WU_I_SHIFT           ((uint16)(0x000FU))

/* No wake up by WAKE1 (level) or WAKE1 pin state did not change between two trigger event (cyclic sense) */
#define SBC_FS23_M_WK1_WU_I_NO_WAKEUP        ((uint16)((uint16)0x0000U << SBC_FS23_M_WK1_WU_I_SHIFT))
/* Wake up by WAKE1 occurred (level) or WAKE1 pin state changed between two trigger event (cyclic sense) */
#define SBC_FS23_M_WK1_WU_I_WAKEUP           ((uint16)((uint16)0x0001U << SBC_FS23_M_WK1_WU_I_SHIFT))

/* No wake up by WAKE2 (level) or WAKE2 pin state did not change between two trigger event (cyclic sense) */
#define SBC_FS23_M_WK2_WU_I_NO_WAKEUP        ((uint16)((uint16)0x0000U << SBC_FS23_M_WK2_WU_I_SHIFT))
/* Wake up by WAKE2 occurred (level) or WAKE2 pin state changed between two trigger event (cyclic sense) */
#define SBC_FS23_M_WK2_WU_I_WAKEUP           ((uint16)((uint16)0x0001U << SBC_FS23_M_WK2_WU_I_SHIFT))

/* State at trigger point captured at 0 */
#define SBC_FS23_M_WK1_CYC_S_0               ((uint16)((uint16)0x0000U << SBC_FS23_M_WK1_CYC_S_SHIFT))
/* State at trigger point captured at 1 */
#define SBC_FS23_M_WK1_CYC_S_1               ((uint16)((uint16)0x0001U << SBC_FS23_M_WK1_CYC_S_SHIFT))

/* State at trigger point captured at 0 */
#define SBC_FS23_M_WK2_CYC_S_0               ((uint16)((uint16)0x0000U << SBC_FS23_M_WK2_CYC_S_SHIFT))
/* State at trigger point captured at 1 */
#define SBC_FS23_M_WK2_CYC_S_1               ((uint16)((uint16)0x0001U << SBC_FS23_M_WK2_CYC_S_SHIFT))

/* Cyclic sense not ready */
#define SBC_FS23_M_WK1_CYS_RDY_NOT_READY     ((uint16)((uint16)0x0000U << SBC_FS23_M_WK1_CYS_RDY_SHIFT))
/* Cyclic sense ready */
#define SBC_FS23_M_WK1_CYS_RDY_READY         ((uint16)((uint16)0x0001U << SBC_FS23_M_WK1_CYS_RDY_SHIFT))

/* Cyclic sense not ready */
#define SBC_FS23_M_WK2_CYS_RDY_NOT_READY     ((uint16)((uint16)0x0000U << SBC_FS23_M_WK2_CYS_RDY_SHIFT))
/* Cyclic sense ready */
#define SBC_FS23_M_WK2_CYS_RDY_READY         ((uint16)((uint16)0x0001U << SBC_FS23_M_WK2_CYS_RDY_SHIFT))

/* No wake up by HVIO1 (level) or HVIO1 pin state did not change between two trigger event (cyclic sense) */
#define SBC_FS23_M_HVIO1_WU_I_NO_WAKEUP      ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO1_WU_I_SHIFT))
/* Wake up by HVIO1 occurred (level) or HVIO1 pin state changed between two trigger event (cyclic sense) */
#define SBC_FS23_M_HVIO1_WU_I_WAKEUP         ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO1_WU_I_SHIFT))

/* No wake up by HVIO2 (level) or HVIO2 pin state did not change between two trigger event (cyclic sense) */
#define SBC_FS23_M_HVIO2_WU_I_NO_WAKEUP      ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO2_WU_I_SHIFT))
/* Wake up by HVIO2 occurred (level) or HVIO2 pin state changed between two trigger event (cyclic sense) */
#define SBC_FS23_M_HVIO2_WU_I_WAKEUP         ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO2_WU_I_SHIFT))

/* State at trigger point captured at 0 */
#define SBC_FS23_M_HVIO1_CYC_S_0             ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO1_CYC_S_SHIFT))
/* State at trigger point captured at 1 */
#define SBC_FS23_M_HVIO1_CYC_S_1             ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO1_CYC_S_SHIFT))

/* State at trigger point captured at 0 */
#define SBC_FS23_M_HVIO2_CYC_S_0             ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO2_CYC_S_SHIFT))
/* State at trigger point captured at 1 */
#define SBC_FS23_M_HVIO2_CYC_S_1             ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO2_CYC_S_SHIFT))

