wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* Cyclic sense not ready */
#define SBC_FS23_M_HVIO1_CYS_RDY_NOT_READY   ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO1_CYS_RDY_SHIFT))
/* Cyclic sense ready */
#define SBC_FS23_M_HVIO1_CYS_RDY_READY       ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO1_CYS_RDY_SHIFT))

/* Cyclic sense not ready */
#define SBC_FS23_M_HVIO2_CYS_RDY_NOT_READY   ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO2_CYS_RDY_SHIFT))
/* Cyclic sense ready */
#define SBC_FS23_M_HVIO2_CYS_RDY_READY       ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO2_CYS_RDY_SHIFT))

/* No wake up by LVIO3 */
#define SBC_FS23_M_LVIO3_WU_I_NO_WAKEUP      ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO3_WU_I_SHIFT))
/* Wake up by LVIO3 occurred */
#define SBC_FS23_M_LVIO3_WU_I_WAKEUP         ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO3_WU_I_SHIFT))

/* No wake up by LVIO4 */
#define SBC_FS23_M_LVIO4_WU_I_NO_WAKEUP      ((uint16)((uint16)0x0000U << SBC_FS23_M_LVIO4_WU_I_SHIFT))
/* Wake up by LVIO4 occurred */
#define SBC_FS23_M_LVIO4_WU_I_WAKEUP         ((uint16)((uint16)0x0001U << SBC_FS23_M_LVIO4_WU_I_SHIFT))

/* No wake up by LVI5 */
#define SBC_FS23_M_LVI5_WU_I_NO_WAKEUP       ((uint16)((uint16)0x0000U << SBC_FS23_M_LVI5_WU_I_SHIFT))
/* Wake up by LVI5 occurred */
#define SBC_FS23_M_LVI5_WU_I_WAKEUP          ((uint16)((uint16)0x0001U << SBC_FS23_M_LVI5_WU_I_SHIFT))

/******************************************************************************/
/* M_WU1_EN - Type: RW                                                        */
/******************************************************************************/

#define SBC_FS23_M_WU1_EN_ADDR               ((uint8)(0x16U))
#define SBC_FS23_M_WU1_EN_DEFAULT            ((uint16)(0x000FU))

/* Configure CAN wake up and interrupt capability */
#define SBC_FS23_M_CAN_WUEN_MASK             ((uint16)(0x0003U))
#define SBC_FS23_M_CAN_WUEN_WAKEUP_MASK      ((uint16)(0x0001U))
#define SBC_FS23_M_CAN_WUEN_INTERRUPT_MASK   ((uint16)(0x0002U))
#define SBC_FS23_M_CAN_WUEN_SHIFT            ((uint16)(0x0000U))
/* Configure LIN wake up and interrupt capability */
#define SBC_FS23_M_LIN_WUEN_MASK             ((uint16)(0x000CU))
#define SBC_FS23_M_LIN_WUEN_WAKEUP_MASK      ((uint16)(0x0004U))
#define SBC_FS23_M_LIN_WUEN_INTERRUPT_MASK   ((uint16)(0x0008U))
#define SBC_FS23_M_LIN_WUEN_SHIFT            ((uint16)(0x0002U))
/* Configure LDT wake up and interrupt capability */
#define SBC_FS23_M_LDT_WUEN_MASK             ((uint16)(0x0030U))
#define SBC_FS23_M_LDT_WUEN_WAKEUP_MASK      ((uint16)(0x0010U))
#define SBC_FS23_M_LDT_WUEN_INTERRUPT_MASK   ((uint16)(0x0020U))
#define SBC_FS23_M_LDT_WUEN_SHIFT            ((uint16)(0x0004U))

/* No wake up and no interrupt */
#define SBC_FS23_M_CAN_WUEN_NONE             ((uint16)((uint16)0x0000U << SBC_FS23_M_CAN_WUEN_SHIFT))
/* Wake up only */
#define SBC_FS23_M_CAN_WUEN_WAKEUP           ((uint16)((uint16)0x0001U << SBC_FS23_M_CAN_WUEN_SHIFT))
/* Interrupt only */
#define SBC_FS23_M_CAN_WUEN_INTERRUPT        ((uint16)((uint16)0x0002U << SBC_FS23_M_CAN_WUEN_SHIFT))
/* Wake up and interrupt */
#define SBC_FS23_M_CAN_WUEN_BOTH             ((uint16)((uint16)0x0003U << SBC_FS23_M_CAN_WUEN_SHIFT))

/* No wake up and no interrupt */
#define SBC_FS23_M_LIN_WUEN_NONE             ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_WUEN_SHIFT))
/* Wake up only */
#define SBC_FS23_M_LIN_WUEN_WAKEUP           ((uint16)((uint16)0x0001U << SBC_FS23_M_LIN_WUEN_SHIFT))
/* Interrupt only */
#define SBC_FS23_M_LIN_WUEN_INTERRUPT        ((uint16)((uint16)0x0002U << SBC_FS23_M_LIN_WUEN_SHIFT))
/* Wake up and interrupt */
#define SBC_FS23_M_LIN_WUEN_BOTH             ((uint16)((uint16)0x0003U << SBC_FS23_M_LIN_WUEN_SHIFT))

/* No wake up and no interrupt */
#define SBC_FS23_M_LDT_WUEN_NONE             ((uint16)((uint16)0x0000U << SBC_FS23_M_LDT_WUEN_SHIFT))
/* Wake up only */
#define SBC_FS23_M_LDT_WUEN_WAKEUP           ((uint16)((uint16)0x0001U << SBC_FS23_M_LDT_WUEN_SHIFT))
/* Interrupt only */
#define SBC_FS23_M_LDT_WUEN_INTERRUPT        ((uint16)((uint16)0x0002U << SBC_FS23_M_LDT_WUEN_SHIFT))
/* Wake up and interrupt */
#define SBC_FS23_M_LDT_WUEN_BOTH             ((uint16)((uint16)0x0003U << SBC_FS23_M_LDT_WUEN_SHIFT))

/******************************************************************************/
/* M_WU1_FLG - Type: RW                                                       */
/******************************************************************************/

#define SBC_FS23_M_WU1_FLG_ADDR              ((uint8)(0x17U))
#define SBC_FS23_M_WU1_FLG_DEFAULT           ((uint16)(0x0000U))

/* Report CAN wake up event */
#define SBC_FS23_M_CAN_WU_I_MASK             ((uint16)(0x0001U))
#define SBC_FS23_M_CAN_WU_I_SHIFT            ((uint16)(0x0000U))
/* Report LIN wake up event */
#define SBC_FS23_M_LIN_WU_I_MASK             ((uint16)(0x0002U))
#define SBC_FS23_M_LIN_WU_I_SHIFT            ((uint16)(0x0001U))
/* Report LDT wake up event */
#define SBC_FS23_M_LDT_WU_I_MASK             ((uint16)(0x0004U))
#define SBC_FS23_M_LDT_WU_I_SHIFT            ((uint16)(0x0002U))
/* Report GO2NORMAL request from MCU wake up event */
#define SBC_FS23_M_GO2NORMAL_WU_MASK         ((uint16)(0x0010U))
#define SBC_FS23_M_GO2NORMAL_WU_SHIFT        ((uint16)(0x0004U))
/* Report Interrupt Time Out wake up event */
#define SBC_FS23_M_INT_TO_WU_MASK            ((uint16)(0x0020U))
#define SBC_FS23_M_INT_TO_WU_SHIFT           ((uint16)(0x0005U))
/* Report V1 LPON under voltage wake up event */
#define SBC_FS23_M_V1_UVLP_WU_MASK           ((uint16)(0x0040U))
#define SBC_FS23_M_V1_UVLP_WU_SHIFT          ((uint16)(0x0006U))
/* Report Watchdog Max Error Failure wake up event */
#define SBC_FS23_M_WD_OFL_WU_MASK            ((uint16)(0x0080U))
#define SBC_FS23_M_WD_OFL_WU_SHIFT           ((uint16)(0x0007U))
/* Report RSTB assertion wake up event */
#define SBC_FS23_M_EXT_RSTB_WU_MASK          ((uint16)(0x0100U))
#define SBC_FS23_M_EXT_RSTB_WU_SHIFT         ((uint16)(0x0008U))
/* Report a Fail-safe event */
#define SBC_FS23_M_FS_EVT_MASK               ((uint16)(0x0200U))
#define SBC_FS23_M_FS_EVT_SHIFT              ((uint16)(0x0009U))

