wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* No wake up by CAN */
#define SBC_FS23_M_CAN_WU_I_NO_WAKEUP        ((uint16)((uint16)0x0000U << SBC_FS23_M_CAN_WU_I_SHIFT))
/* Wake up by CAN occurred */
#define SBC_FS23_M_CAN_WU_I_WAKEUP           ((uint16)((uint16)0x0001U << SBC_FS23_M_CAN_WU_I_SHIFT))

/* No wake up by LIN */
#define SBC_FS23_M_LIN_WU_I_NO_WAKEUP        ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_WU_I_SHIFT))
/* Wake up by LIN occurred */
#define SBC_FS23_M_LIN_WU_I_WAKEUP           ((uint16)((uint16)0x0001U << SBC_FS23_M_LIN_WU_I_SHIFT))

/* No wake up by LDT */
#define SBC_FS23_M_LDT_WU_I_NO_WAKEUP        ((uint16)((uint16)0x0000U << SBC_FS23_M_LDT_WU_I_SHIFT))
/* Wake up by LDT occurred */
#define SBC_FS23_M_LDT_WU_I_WAKEUP           ((uint16)((uint16)0x0001U << SBC_FS23_M_LDT_WU_I_SHIFT))

/* No wake up by MCU GO2NORMAL request */
#define SBC_FS23_M_GO2NORMAL_WU_NO_WAKEUP    ((uint16)((uint16)0x0000U << SBC_FS23_M_GO2NORMAL_WU_SHIFT))
/* Wake up by MCU GO2NORMAL request occurred */
#define SBC_FS23_M_GO2NORMAL_WU_WAKEUP       ((uint16)((uint16)0x0001U << SBC_FS23_M_GO2NORMAL_WU_SHIFT))

/* No wake up by Interrupt Time Out */
#define SBC_FS23_M_INT_TO_WU_NO_WAKEUP       ((uint16)((uint16)0x0000U << SBC_FS23_M_INT_TO_WU_SHIFT))
/* Wake up by Interrupt Time Out occurred */
#define SBC_FS23_M_INT_TO_WU_WAKEUP          ((uint16)((uint16)0x0001U << SBC_FS23_M_INT_TO_WU_SHIFT))

/* No wake up by V1 LPON under voltage */
#define SBC_FS23_M_V1_UVLP_WU_NO_WAKEUP      ((uint16)((uint16)0x0000U << SBC_FS23_M_V1_UVLP_WU_SHIFT))
/* Wake up by V1 LPON under voltage occurred */
#define SBC_FS23_M_V1_UVLP_WU_WAKEUP         ((uint16)((uint16)0x0001U << SBC_FS23_M_V1_UVLP_WU_SHIFT))

/* No wake up by Max Error Failure */
#define SBC_FS23_M_WD_OFL_WU_NO_WAKEUP       ((uint16)((uint16)0x0000U << SBC_FS23_M_WD_OFL_WU_SHIFT))
/* Wake up by Watchdog Max Error Failure occurred */
#define SBC_FS23_M_WD_OFL_WU_WAKEUP          ((uint16)((uint16)0x0001U << SBC_FS23_M_WD_OFL_WU_SHIFT))

/* No wake up by to RSTB assertion */
#define SBC_FS23_M_EXT_RSTB_WU_NO_WAKEUP     ((uint16)((uint16)0x0000U << SBC_FS23_M_EXT_RSTB_WU_SHIFT))
/* Wake up by to RSTB assertion occurred */
#define SBC_FS23_M_EXT_RSTB_WU_WAKEUP        ((uint16)((uint16)0x0001U << SBC_FS23_M_EXT_RSTB_WU_SHIFT))

/* No Fail-safe event */
#define SBC_FS23_M_FS_EVT_NO_EVENT           ((uint16)((uint16)0x0000U << SBC_FS23_M_FS_EVT_SHIFT))
/* Fail-safe event occurred (FSM went to Fail-safe state) */
#define SBC_FS23_M_FS_EVT_EVENT              ((uint16)((uint16)0x0001U << SBC_FS23_M_FS_EVT_SHIFT))

/******************************************************************************/
/* M_TIMER1_CFG - Type: RW                                                    */
/******************************************************************************/

#define SBC_FS23_M_TIMER1_CFG_ADDR           ((uint8)(0x18U))
#define SBC_FS23_M_TIMER1_CFG_DEFAULT        ((uint16)(0x0000U))

/* Configure the TIMER1 period */
#define SBC_FS23_M_TIMER1_PER_MASK           ((uint16)(0x0007U))
#define SBC_FS23_M_TIMER1_PER_SHIFT          ((uint16)(0x0000U))
/* Configure the TIMER1 ON time */
#define SBC_FS23_M_TIMER1_ON_MASK            ((uint16)(0x0078U))
#define SBC_FS23_M_TIMER1_ON_SHIFT           ((uint16)(0x0003U))
/* Configure the TIMER1 delay time (apply on rising edge only) */
#define SBC_FS23_M_TIMER1_DLY_MASK           ((uint16)(0x0180U))
#define SBC_FS23_M_TIMER1_DLY_SHIFT          ((uint16)(0x0007U))

/* TIMER1 period = 10.24 ms */
#define SBC_FS23_M_TIMER1_PER_10MS           ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER1_PER_SHIFT))
/* TIMER1 period = 20.48 ms */
#define SBC_FS23_M_TIMER1_PER_20MS           ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER1_PER_SHIFT))
/* TIMER1 period = 51.2 ms */
#define SBC_FS23_M_TIMER1_PER_51MS           ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER1_PER_SHIFT))
/* TIMER1 period = 102.4 ms */
#define SBC_FS23_M_TIMER1_PER_102MS          ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER1_PER_SHIFT))
/* TIMER1 period = 204.8 ms */
#define SBC_FS23_M_TIMER1_PER_204MS          ((uint16)((uint16)0x0004U << SBC_FS23_M_TIMER1_PER_SHIFT))
/* TIMER1 period = 512 ms */
#define SBC_FS23_M_TIMER1_PER_512MS          ((uint16)((uint16)0x0005U << SBC_FS23_M_TIMER1_PER_SHIFT))
/* TIMER1 period = 1024 ms */
#define SBC_FS23_M_TIMER1_PER_1024MS         ((uint16)((uint16)0x0006U << SBC_FS23_M_TIMER1_PER_SHIFT))
/* TIMER1 period = 2048 ms */
#define SBC_FS23_M_TIMER1_PER_2048MS         ((uint16)((uint16)0x0007U << SBC_FS23_M_TIMER1_PER_SHIFT))

/* TIMER1 ON time = 0 ms */
#define SBC_FS23_M_TIMER1_ON_0MS             ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = 0.128 ms */
#define SBC_FS23_M_TIMER1_ON_128US           ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = 0.256 ms */
#define SBC_FS23_M_TIMER1_ON_256US           ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = 1.024 ms */
#define SBC_FS23_M_TIMER1_ON_1024US          ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = 10.24 ms */
#define SBC_FS23_M_TIMER1_ON_10MS            ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = 20.48 ms */
#define SBC_FS23_M_TIMER1_ON_20MS            ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = 30.72 ms */
#define SBC_FS23_M_TIMER1_ON_30MS            ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = 40.96 ms */
#define SBC_FS23_M_TIMER1_ON_40MS            ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = 51.2 ms */
#define SBC_FS23_M_TIMER1_ON_51MS            ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = 61.44 ms */
#define SBC_FS23_M_TIMER1_ON_61MS            ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = 81.92 ms */
#define SBC_FS23_M_TIMER1_ON_81MS            ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = 102.4 ms */
#define SBC_FS23_M_TIMER1_ON_102MS           ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = 122.88 ms */
#define SBC_FS23_M_TIMER1_ON_122MS           ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = 153.6 ms */
#define SBC_FS23_M_TIMER1_ON_153MS           ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = 204.8 ms */
#define SBC_FS23_M_TIMER1_ON_204MS           ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER1_ON_SHIFT))
/* TIMER1 ON time = Infinite */
#define SBC_FS23_M_TIMER1_ON_INFINITE        ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER1_ON_SHIFT))

