wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* TIMER1 delay = 0 us */
#define SBC_FS23_M_TIMER1_DLY_0US            ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER1_DLY_SHIFT))
/* TIMER1 delay = 5 us */
#define SBC_FS23_M_TIMER1_DLY_5US            ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER1_DLY_SHIFT))
/* TIMER1 delay = 10 us */
#define SBC_FS23_M_TIMER1_DLY_10US           ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER1_DLY_SHIFT))
/* TIMER1 delay = 15 us */
#define SBC_FS23_M_TIMER1_DLY_15US           ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER1_DLY_SHIFT))

/******************************************************************************/
/* M_TIMER2_CFG - Type: RW                                                    */
/******************************************************************************/

#define SBC_FS23_M_TIMER2_CFG_ADDR           ((uint8)(0x19U))
#define SBC_FS23_M_TIMER2_CFG_DEFAULT        ((uint16)(0x0000U))

/* Configure the TIMER2 period */
#define SBC_FS23_M_TIMER2_PER_MASK           ((uint16)(0x0007U))
#define SBC_FS23_M_TIMER2_PER_SHIFT          ((uint16)(0x0000U))
/* Configure the TIMER2 ON time */
#define SBC_FS23_M_TIMER2_ON_MASK            ((uint16)(0x0078U))
#define SBC_FS23_M_TIMER2_ON_SHIFT           ((uint16)(0x0003U))
/* Configure the TIMER2 delay time (apply on rising edge only) */
#define SBC_FS23_M_TIMER2_DLY_MASK           ((uint16)(0x0180U))
#define SBC_FS23_M_TIMER2_DLY_SHIFT          ((uint16)(0x0007U))

/* TIMER2 period = 10.24 ms */
#define SBC_FS23_M_TIMER2_PER_10MS           ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER2_PER_SHIFT))
/* TIMER2 period = 20.48 ms */
#define SBC_FS23_M_TIMER2_PER_20MS           ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER2_PER_SHIFT))
/* TIMER2 period = 51.2 ms */
#define SBC_FS23_M_TIMER2_PER_51MS           ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER2_PER_SHIFT))
/* TIMER2 period = 102.4 ms */
#define SBC_FS23_M_TIMER2_PER_102MS          ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER2_PER_SHIFT))
/* TIMER2 period = 204.8 ms */
#define SBC_FS23_M_TIMER2_PER_204MS          ((uint16)((uint16)0x0004U << SBC_FS23_M_TIMER2_PER_SHIFT))
/* TIMER2 period = 512 ms */
#define SBC_FS23_M_TIMER2_PER_512MS          ((uint16)((uint16)0x0005U << SBC_FS23_M_TIMER2_PER_SHIFT))
/* TIMER2 period = 1024 ms */
#define SBC_FS23_M_TIMER2_PER_1024MS         ((uint16)((uint16)0x0006U << SBC_FS23_M_TIMER2_PER_SHIFT))
/* TIMER2 period = 2048 ms */
#define SBC_FS23_M_TIMER2_PER_2048MS         ((uint16)((uint16)0x0007U << SBC_FS23_M_TIMER2_PER_SHIFT))

/* TIMER2 ON time = 0 ms */
#define SBC_FS23_M_TIMER2_ON_0MS             ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = 0.128 ms */
#define SBC_FS23_M_TIMER2_ON_128US           ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = 0.256 ms */
#define SBC_FS23_M_TIMER2_ON_256US           ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = 1.024 ms */
#define SBC_FS23_M_TIMER2_ON_1024US          ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = 10.24 ms */
#define SBC_FS23_M_TIMER2_ON_10MS            ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = 20.48 ms */
#define SBC_FS23_M_TIMER2_ON_20MS            ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = 30.72 ms */
#define SBC_FS23_M_TIMER2_ON_30MS            ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = 40.96 ms */
#define SBC_FS23_M_TIMER2_ON_40MS            ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = 51.2 ms */
#define SBC_FS23_M_TIMER2_ON_51MS            ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = 61.44 ms */
#define SBC_FS23_M_TIMER2_ON_61MS            ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = 81.92 ms */
#define SBC_FS23_M_TIMER2_ON_81MS            ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = 102.4 ms */
#define SBC_FS23_M_TIMER2_ON_102MS           ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = 122.88 ms */
#define SBC_FS23_M_TIMER2_ON_122MS           ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = 153.6 ms */
#define SBC_FS23_M_TIMER2_ON_153MS           ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = 204.8 ms */
#define SBC_FS23_M_TIMER2_ON_204MS           ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER2_ON_SHIFT))
/* TIMER2 ON time = Infinite */
#define SBC_FS23_M_TIMER2_ON_INFINITE        ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER2_ON_SHIFT))

/* TIMER2 delay = 0 us */
#define SBC_FS23_M_TIMER2_DLY_0US            ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER2_DLY_SHIFT))
/* TIMER2 delay = 5 us */
#define SBC_FS23_M_TIMER2_DLY_5US            ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER2_DLY_SHIFT))
/* TIMER2 delay = 10 us */
#define SBC_FS23_M_TIMER2_DLY_10US           ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER2_DLY_SHIFT))
/* TIMER2 delay = 15 us */
#define SBC_FS23_M_TIMER2_DLY_15US           ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER2_DLY_SHIFT))

/******************************************************************************/
/* M_TIMER3_CFG - Type: RW                                                    */
/******************************************************************************/

#define SBC_FS23_M_TIMER3_CFG_ADDR           ((uint8)(0x1AU))
#define SBC_FS23_M_TIMER3_CFG_DEFAULT        ((uint16)(0x0000U))

/* Configure the TIMER3 period */
#define SBC_FS23_M_TIMER3_PER_MASK           ((uint16)(0x0007U))
#define SBC_FS23_M_TIMER3_PER_SHIFT          ((uint16)(0x0000U))
/* Configure the TIMER3 ON time */
#define SBC_FS23_M_TIMER3_ON_MASK            ((uint16)(0x0078U))
#define SBC_FS23_M_TIMER3_ON_SHIFT           ((uint16)(0x0003U))
/* Configure the TIMER3 delay time (apply on rising edge only) */
#define SBC_FS23_M_TIMER3_DLY_MASK           ((uint16)(0x0180U))
#define SBC_FS23_M_TIMER3_DLY_SHIFT          ((uint16)(0x0007U))

/* TIMER3 period = 10.24 ms */
#define SBC_FS23_M_TIMER3_PER_10MS           ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER3_PER_SHIFT))
/* TIMER3 period = 20.48 ms */
#define SBC_FS23_M_TIMER3_PER_20MS           ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER3_PER_SHIFT))
/* TIMER3 period = 51.2 ms */
#define SBC_FS23_M_TIMER3_PER_51MS           ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER3_PER_SHIFT))
/* TIMER3 period = 102.4 ms */
#define SBC_FS23_M_TIMER3_PER_102MS          ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER3_PER_SHIFT))
/* TIMER3 period = 204.8 ms */
#define SBC_FS23_M_TIMER3_PER_204MS          ((uint16)((uint16)0x0004U << SBC_FS23_M_TIMER3_PER_SHIFT))
/* TIMER3 period = 512 ms */
#define SBC_FS23_M_TIMER3_PER_512MS         ((uint16)((uint16)0x0005U << SBC_FS23_M_TIMER3_PER_SHIFT))
/* TIMER3 period = 1024 ms */
#define SBC_FS23_M_TIMER3_PER_1024MS         ((uint16)((uint16)0x0006U << SBC_FS23_M_TIMER3_PER_SHIFT))
/* TIMER3 period = 2048 ms */
#define SBC_FS23_M_TIMER3_PER_2048MS         ((uint16)((uint16)0x0007U << SBC_FS23_M_TIMER3_PER_SHIFT))

/* TIMER3 ON time = 0 ms */
#define SBC_FS23_M_TIMER3_ON_0MS             ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = 0.128 ms */
#define SBC_FS23_M_TIMER3_ON_128US           ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = 0.256 ms */
#define SBC_FS23_M_TIMER3_ON_256US           ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = 1.024 ms */
#define SBC_FS23_M_TIMER3_ON_1024US          ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = 10.24 ms */
#define SBC_FS23_M_TIMER3_ON_10MS            ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = 20.48 ms */
#define SBC_FS23_M_TIMER3_ON_20MS            ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = 30.72 ms */
#define SBC_FS23_M_TIMER3_ON_30MS            ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = 40.96 ms */
#define SBC_FS23_M_TIMER3_ON_40MS            ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = 51.2 ms */
#define SBC_FS23_M_TIMER3_ON_51MS            ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = 61.44 ms */
#define SBC_FS23_M_TIMER3_ON_61MS            ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = 81.92 ms */
#define SBC_FS23_M_TIMER3_ON_81MS            ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = 102.4 ms */
#define SBC_FS23_M_TIMER3_ON_102MS           ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = 122.88 ms */
#define SBC_FS23_M_TIMER3_ON_122MS           ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = 153.6 ms */
#define SBC_FS23_M_TIMER3_ON_153MS           ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = 204.8 ms */
#define SBC_FS23_M_TIMER3_ON_204MS           ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER3_ON_SHIFT))
/* TIMER3 ON time = Infinite */
#define SBC_FS23_M_TIMER3_ON_INFINITE        ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER3_ON_SHIFT))

/* TIMER3 delay = 0 us */
#define SBC_FS23_M_TIMER3_DLY_0US            ((uint16)((uint16)0x0000U << SBC_FS23_M_TIMER3_DLY_SHIFT))
/* TIMER3 delay = 5 us */
#define SBC_FS23_M_TIMER3_DLY_5US            ((uint16)((uint16)0x0001U << SBC_FS23_M_TIMER3_DLY_SHIFT))
/* TIMER3 delay = 10 us */
#define SBC_FS23_M_TIMER3_DLY_10US           ((uint16)((uint16)0x0002U << SBC_FS23_M_TIMER3_DLY_SHIFT))
/* TIMER3 delay = 15 us */
#define SBC_FS23_M_TIMER3_DLY_15US           ((uint16)((uint16)0x0003U << SBC_FS23_M_TIMER3_DLY_SHIFT))

/******************************************************************************/
/* M_PWM1_CFG - Type: RW                                                      */
/******************************************************************************/

#define SBC_FS23_M_PWM1_CFG_ADDR             ((uint8)(0x1BU))
#define SBC_FS23_M_PWM1_CFG_DEFAULT          ((uint16)(0x0000U))

