wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* Configure the PWM1 duty cycle (PWM1 duty cycle = 100 * PWM1_DC / 1000) */
#define SBC_FS23_M_PWM1_DC_MASK              ((uint16)(0x03FFU))
#define SBC_FS23_M_PWM1_DC_SHIFT             ((uint16)(0x0000U))
/* Configure the PWM1 frequency */
#define SBC_FS23_M_PWM1_F_MASK               ((uint16)(0x0400U))
#define SBC_FS23_M_PWM1_F_SHIFT              ((uint16)(0x000AU))
/* Configure the PWM1 delay time (applies on both edges) */
#define SBC_FS23_M_PWM1_DLY_MASK             ((uint16)(0x1800U))
#define SBC_FS23_M_PWM1_DLY_SHIFT            ((uint16)(0x000BU))

/* PWM1 frequency = 200 Hz */
#define SBC_FS23_M_PWM1_F_200HZ              ((uint16)((uint16)0x0000U << SBC_FS23_M_PWM1_F_SHIFT))
/* PWM1 frequency = 400 Hz */
#define SBC_FS23_M_PWM1_F_400HZ              ((uint16)((uint16)0x0001U << SBC_FS23_M_PWM1_F_SHIFT))

/* PWM1 delay = 0 us */
#define SBC_FS23_M_PWM1_DLY_0US              ((uint16)((uint16)0x0000U << SBC_FS23_M_PWM1_DLY_SHIFT))
/* PWM1 delay = 5 us */
#define SBC_FS23_M_PWM1_DLY_5US              ((uint16)((uint16)0x0001U << SBC_FS23_M_PWM1_DLY_SHIFT))
/* PWM1 delay = 10 us */
#define SBC_FS23_M_PWM1_DLY_10US             ((uint16)((uint16)0x0002U << SBC_FS23_M_PWM1_DLY_SHIFT))
/* PWM1 delay = 15 us */
#define SBC_FS23_M_PWM1_DLY_15US             ((uint16)((uint16)0x0003U << SBC_FS23_M_PWM1_DLY_SHIFT))

/******************************************************************************/
/* M_PWM2_CFG - Type: RW                                                      */
/******************************************************************************/

#define SBC_FS23_M_PWM2_CFG_ADDR             ((uint8)(0x1CU))
#define SBC_FS23_M_PWM2_CFG_DEFAULT          ((uint16)(0x0000U))

/* Configure the PWM2 duty cycle (PWM2 duty cycle = 100 * PWM2_DC / 1000) */
#define SBC_FS23_M_PWM2_DC_MASK              ((uint16)(0x03FFU))
#define SBC_FS23_M_PWM2_DC_SHIFT             ((uint16)(0x0000U))
/* Configure the PWM2 frequency */
#define SBC_FS23_M_PWM2_F_MASK               ((uint16)(0x0400U))
#define SBC_FS23_M_PWM2_F_SHIFT              ((uint16)(0x000AU))
/* Configure the PWM2 delay time (applies on both edges) */
#define SBC_FS23_M_PWM2_DLY_MASK             ((uint16)(0x1800U))
#define SBC_FS23_M_PWM2_DLY_SHIFT            ((uint16)(0x000BU))

/* PWM2 frequency = 200 Hz */
#define SBC_FS23_M_PWM2_F_200HZ              ((uint16)((uint16)0x0000U << SBC_FS23_M_PWM2_F_SHIFT))
/* PWM2 frequency = 400 Hz */
#define SBC_FS23_M_PWM2_F_400HZ              ((uint16)((uint16)0x0001U << SBC_FS23_M_PWM2_F_SHIFT))

/* PWM2 delay = 0 us */
#define SBC_FS23_M_PWM2_DLY_0US              ((uint16)((uint16)0x0000U << SBC_FS23_M_PWM2_DLY_SHIFT))
/* PWM2 delay = 5 us */
#define SBC_FS23_M_PWM2_DLY_5US              ((uint16)((uint16)0x0001U << SBC_FS23_M_PWM2_DLY_SHIFT))
/* PWM2 delay = 10 us */
#define SBC_FS23_M_PWM2_DLY_10US             ((uint16)((uint16)0x0002U << SBC_FS23_M_PWM2_DLY_SHIFT))
/* PWM2 delay = 15 us */
#define SBC_FS23_M_PWM2_DLY_15US             ((uint16)((uint16)0x0003U << SBC_FS23_M_PWM2_DLY_SHIFT))

/******************************************************************************/
/* M_PWM3_CFG - Type: RW                                                      */
/******************************************************************************/

#define SBC_FS23_M_PWM3_CFG_ADDR             ((uint8)(0x1DU))
#define SBC_FS23_M_PWM3_CFG_DEFAULT          ((uint16)(0x0000U))

/* Configure the PWM3 duty cycle (PWM3 duty cycle = 100 * PWM3_DC / 1000) */
#define SBC_FS23_M_PWM3_DC_MASK              ((uint16)(0x03FFU))
#define SBC_FS23_M_PWM3_DC_SHIFT             ((uint16)(0x0000U))
/* Configure the PWM3 frequency */
#define SBC_FS23_M_PWM3_F_MASK               ((uint16)(0x0400U))
#define SBC_FS23_M_PWM3_F_SHIFT              ((uint16)(0x000AU))
/* Configure the PWM3 delay time (applies on both edges) */
#define SBC_FS23_M_PWM3_DLY_MASK             ((uint16)(0x1800U))
#define SBC_FS23_M_PWM3_DLY_SHIFT            ((uint16)(0x000BU))

/* PWM3 frequency = 200 Hz */
#define SBC_FS23_M_PWM3_F_200HZ              ((uint16)((uint16)0x0000U << SBC_FS23_M_PWM3_F_SHIFT))
/* PWM3 frequency = 400 Hz */
#define SBC_FS23_M_PWM3_F_400HZ              ((uint16)((uint16)0x0001U << SBC_FS23_M_PWM3_F_SHIFT))

/* PWM3 delay = 0 us */
#define SBC_FS23_M_PWM3_DLY_0US              ((uint16)((uint16)0x0000U << SBC_FS23_M_PWM3_DLY_SHIFT))
/* PWM3 delay = 5 us */
#define SBC_FS23_M_PWM3_DLY_5US              ((uint16)((uint16)0x0001U << SBC_FS23_M_PWM3_DLY_SHIFT))
/* PWM3 delay = 10 us */
#define SBC_FS23_M_PWM3_DLY_10US             ((uint16)((uint16)0x0002U << SBC_FS23_M_PWM3_DLY_SHIFT))
/* PWM3 delay = 15 us */
#define SBC_FS23_M_PWM3_DLY_15US             ((uint16)((uint16)0x0003U << SBC_FS23_M_PWM3_DLY_SHIFT))

/******************************************************************************/
/* M_TIMER_PWM_CTRL - Type: RW                                                */
/******************************************************************************/

#define SBC_FS23_M_TIMER_PWM_CTRL_ADDR       ((uint8)(0x1EU))
#define SBC_FS23_M_TIMER_PWM_CTRL_DEFAULT    ((uint16)(0x0000U))

/* Enable the PWM3 */
#define SBC_FS23_M_PWM3_EN_MASK             ((uint16)(0x0001U))
#define SBC_FS23_M_PWM3_EN_SHIFT            ((uint16)(0x0000U))
/* Enable the PWM2 */
#define SBC_FS23_M_PWM2_EN_MASK             ((uint16)(0x0002U))
#define SBC_FS23_M_PWM2_EN_SHIFT            ((uint16)(0x0001U))
/* Enable the PWM1 */
#define SBC_FS23_M_PWM1_EN_MASK             ((uint16)(0x0004U))
#define SBC_FS23_M_PWM1_EN_SHIFT            ((uint16)(0x0002U))
/* Enable the TIMER3 */
#define SBC_FS23_M_TIM3_EN_MASK             ((uint16)(0x0010U))
#define SBC_FS23_M_TIM3_EN_SHIFT            ((uint16)(0x0004U))
/* Enable the TIMER2 */
#define SBC_FS23_M_TIM2_EN_MASK             ((uint16)(0x0020U))
#define SBC_FS23_M_TIM2_EN_SHIFT            ((uint16)(0x0005U))
/* Enable the TIMER1 */
#define SBC_FS23_M_TIM1_EN_MASK             ((uint16)(0x0040U))
#define SBC_FS23_M_TIM1_EN_SHIFT            ((uint16)(0x0006U))

/* PWM3 is disabled */
#define SBC_FS23_M_PWM3_EN_DISABLED         ((uint16)((uint16)0x0000U << SBC_FS23_M_PWM3_EN_SHIFT))
/* PWM3 is enabled */
#define SBC_FS23_M_PWM3_EN_ENABLED          ((uint16)((uint16)0x0001U << SBC_FS23_M_PWM3_EN_SHIFT))

/* PWM2 is disabled */
#define SBC_FS23_M_PWM2_EN_DISABLED         ((uint16)((uint16)0x0000U << SBC_FS23_M_PWM2_EN_SHIFT))
/* PWM2 is enabled */
#define SBC_FS23_M_PWM2_EN_ENABLED          ((uint16)((uint16)0x0001U << SBC_FS23_M_PWM2_EN_SHIFT))

