wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* PWM1 is disabled */
#define SBC_FS23_M_PWM1_EN_DISABLED         ((uint16)((uint16)0x0000U << SBC_FS23_M_PWM1_EN_SHIFT))
/* PWM1 is enabled */
#define SBC_FS23_M_PWM1_EN_ENABLED          ((uint16)((uint16)0x0001U << SBC_FS23_M_PWM1_EN_SHIFT))

/* TIMER3 is disabled */
#define SBC_FS23_M_TIM3_EN_DISABLED         ((uint16)((uint16)0x0000U << SBC_FS23_M_TIM3_EN_SHIFT))
/* TIMER3 is enabled */
#define SBC_FS23_M_TIM3_EN_ENABLED          ((uint16)((uint16)0x0001U << SBC_FS23_M_TIM3_EN_SHIFT))

/* TIMER2 is disabled */
#define SBC_FS23_M_TIM2_EN_DISABLED         ((uint16)((uint16)0x0000U << SBC_FS23_M_TIM2_EN_SHIFT))
/* TIMER2 is enabled */
#define SBC_FS23_M_TIM2_EN_ENABLED          ((uint16)((uint16)0x0001U << SBC_FS23_M_TIM2_EN_SHIFT))

/* TIMER1 is disabled */
#define SBC_FS23_M_TIM1_EN_DISABLED         ((uint16)((uint16)0x0000U << SBC_FS23_M_TIM1_EN_SHIFT))
/* TIMER1 is enabled */
#define SBC_FS23_M_TIM1_EN_ENABLED          ((uint16)((uint16)0x0001U << SBC_FS23_M_TIM1_EN_SHIFT))

/******************************************************************************/
/* M_CS_CFG - Type: RW                                                        */
/******************************************************************************/

#define SBC_FS23_M_CS_CFG_ADDR               ((uint8)(0x1FU))
#define SBC_FS23_M_CS_CFG_DEFAULT            ((uint16)(0x0000U))

/* Select the High Side connected to WAKE1 for cyclic sensing */
#define SBC_FS23_M_WK1_HS_SEL_MASK           ((uint16)(0x0003U))
#define SBC_FS23_M_WK1_HS_SEL_SHIFT          ((uint16)(0x0000U))
/* Select the High Side connected to WAKE2 for cyclic sensing */
#define SBC_FS23_M_WK2_HS_SEL_MASK           ((uint16)(0x000CU))
#define SBC_FS23_M_WK2_HS_SEL_SHIFT          ((uint16)(0x0002U))
/* Select the High Side connected to HVIO1 for cyclic sensing */
#define SBC_FS23_M_HVIO1_HS_SEL_MASK         ((uint16)(0x0030U))
#define SBC_FS23_M_HVIO1_HS_SEL_SHIFT        ((uint16)(0x0004U))
/* Select the High Side connected to HVIO2 for cyclic sensing */
#define SBC_FS23_M_HVIO2_HS_SEL_MASK         ((uint16)(0x00C0U))
#define SBC_FS23_M_HVIO2_HS_SEL_SHIFT        ((uint16)(0x0006U))
/* Select the reaction when a fault is detected on a High Side */
#define SBC_FS23_M_HS_FLT_WU_FORCE_MASK      ((uint16)(0x0200U))
#define SBC_FS23_M_HS_FLT_WU_FORCE_SHIFT     ((uint16)(0x0009U))

/* HS1 is connected to WAKE1 */
#define SBC_FS23_M_WK1_HS_SEL_HS1            ((uint16)((uint16)0x0000U << SBC_FS23_M_WK1_HS_SEL_SHIFT))
/* HS2 is connected to WAKE1 */
#define SBC_FS23_M_WK1_HS_SEL_HS2            ((uint16)((uint16)0x0001U << SBC_FS23_M_WK1_HS_SEL_SHIFT))
/* HS3 is connected to WAKE1 */
#define SBC_FS23_M_WK1_HS_SEL_HS3            ((uint16)((uint16)0x0002U << SBC_FS23_M_WK1_HS_SEL_SHIFT))
/* HS4 is connected to WAKE1 */
#define SBC_FS23_M_WK1_HS_SEL_HS4            ((uint16)((uint16)0x0003U << SBC_FS23_M_WK1_HS_SEL_SHIFT))

/* HS1 is connected to WAKE2 */
#define SBC_FS23_M_WK2_HS_SEL_HS1            ((uint16)((uint16)0x0000U << SBC_FS23_M_WK2_HS_SEL_SHIFT))
/* HS2 is connected to WAKE2 */
#define SBC_FS23_M_WK2_HS_SEL_HS2            ((uint16)((uint16)0x0001U << SBC_FS23_M_WK2_HS_SEL_SHIFT))
/* HS3 is connected to WAKE2 */
#define SBC_FS23_M_WK2_HS_SEL_HS3            ((uint16)((uint16)0x0002U << SBC_FS23_M_WK2_HS_SEL_SHIFT))
/* HS4 is connected to WAKE2 */
#define SBC_FS23_M_WK2_HS_SEL_HS4            ((uint16)((uint16)0x0003U << SBC_FS23_M_WK2_HS_SEL_SHIFT))

/* HS1 is connected to HVIO1 */
#define SBC_FS23_M_HVIO1_HS_SEL_HS1          ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO1_HS_SEL_SHIFT))
/* HS2 is connected to HVIO1 */
#define SBC_FS23_M_HVIO1_HS_SEL_HS2          ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO1_HS_SEL_SHIFT))
/* HS3 is connected to HVIO1 */
#define SBC_FS23_M_HVIO1_HS_SEL_HS3          ((uint16)((uint16)0x0002U << SBC_FS23_M_HVIO1_HS_SEL_SHIFT))
/* HS4 is connected to HVIO1 */
#define SBC_FS23_M_HVIO1_HS_SEL_HS4          ((uint16)((uint16)0x0003U << SBC_FS23_M_HVIO1_HS_SEL_SHIFT))

/* HS1 is connected to HVIO2 */
#define SBC_FS23_M_HVIO2_HS_SEL_HS1          ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO2_HS_SEL_SHIFT))
/* HS2 is connected to HVIO2 */
#define SBC_FS23_M_HVIO2_HS_SEL_HS2          ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO2_HS_SEL_SHIFT))
/* HS3 is connected to HVIO2 */
#define SBC_FS23_M_HVIO2_HS_SEL_HS3          ((uint16)((uint16)0x0002U << SBC_FS23_M_HVIO2_HS_SEL_SHIFT))
/* HS4 is connected to HVIO2 */
#define SBC_FS23_M_HVIO2_HS_SEL_HS4          ((uint16)((uint16)0x0003U << SBC_FS23_M_HVIO2_HS_SEL_SHIFT))

/* Disable the cyclic sense engine when the fault is present */
#define SBC_FS23_M_HS_FLT_WU_FORCE_DISABLE   ((uint16)((uint16)0x0000U << SBC_FS23_M_HS_FLT_WU_FORCE_SHIFT))
/* Force the wake up of the device when the fault is detected */
#define SBC_FS23_M_HS_FLT_WU_FORCE_WAKEUP    ((uint16)((uint16)0x0001U << SBC_FS23_M_HS_FLT_WU_FORCE_SHIFT))

/******************************************************************************/
/* M_CS_FLG_MSK - Type: RW                                                    */
/******************************************************************************/

#define SBC_FS23_M_CS_FLG_MSK_ADDR           ((uint8)(0x20U))
#define SBC_FS23_M_CS_FLG_MSK_DEFAULT        ((uint16)(0x0000U))

/* Report WAKE1 Open Load event */
#define SBC_FS23_M_WAKE1_OL_I_MASK           ((uint16)(0x0001U))
#define SBC_FS23_M_WAKE1_OL_I_SHIFT          ((uint16)(0x0000U))
/* Report WAKE2 Open Load event */
#define SBC_FS23_M_WAKE2_OL_I_MASK           ((uint16)(0x0002U))
#define SBC_FS23_M_WAKE2_OL_I_SHIFT          ((uint16)(0x0001U))
/* Report HVIO1 Open Load event */
#define SBC_FS23_M_HVIO1_OL_I_MASK           ((uint16)(0x0004U))
#define SBC_FS23_M_HVIO1_OL_I_SHIFT          ((uint16)(0x0002U))
/* Report HVIO2 Open Load event */
#define SBC_FS23_M_HVIO2_OL_I_MASK           ((uint16)(0x0008U))
#define SBC_FS23_M_HVIO2_OL_I_SHIFT          ((uint16)(0x0003U))
/* Inhibit WAKE1 Open Load Interrupt */
#define SBC_FS23_M_WAKE1_OL_M_MASK           ((uint16)(0x0020U))
#define SBC_FS23_M_WAKE1_OL_M_SHIFT          ((uint16)(0x0005U))
/* Inhibit WAKE2 Open Load Interrupt */
#define SBC_FS23_M_WAKE2_OL_M_MASK           ((uint16)(0x0040U))
#define SBC_FS23_M_WAKE2_OL_M_SHIFT          ((uint16)(0x0006U))
/* Inhibit HVIO1 Open Load Interrupt */
#define SBC_FS23_M_HVIO1_OL_M_MASK           ((uint16)(0x0080U))
#define SBC_FS23_M_HVIO1_OL_M_SHIFT          ((uint16)(0x0007U))
/* Inhibit HVIO2 Open Load Interrupt */
#define SBC_FS23_M_HVIO2_OL_M_MASK           ((uint16)(0x0100U))
#define SBC_FS23_M_HVIO2_OL_M_SHIFT          ((uint16)(0x0008U))

/* No event detected */
#define SBC_FS23_M_WAKE1_OL_I_NO_EVENT       ((uint16)((uint16)0x0000U << SBC_FS23_M_WAKE1_OL_I_SHIFT))
/* WAKE1 OL occurred */
#define SBC_FS23_M_WAKE1_OL_I_EVENT          ((uint16)((uint16)0x0001U << SBC_FS23_M_WAKE1_OL_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_WAKE2_OL_I_NO_EVENT       ((uint16)((uint16)0x0000U << SBC_FS23_M_WAKE2_OL_I_SHIFT))
/* WAKE2 OL occurred */
#define SBC_FS23_M_WAKE2_OL_I_EVENT          ((uint16)((uint16)0x0001U << SBC_FS23_M_WAKE2_OL_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_HVIO1_OL_I_NO_EVENT       ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO1_OL_I_SHIFT))
/* HVIO1 OL occurred */
#define SBC_FS23_M_HVIO1_OL_I_EVENT          ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO1_OL_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_HVIO2_OL_I_NO_EVENT       ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO2_OL_I_SHIFT))
/* HVIO2 OL occurred */
#define SBC_FS23_M_HVIO2_OL_I_EVENT          ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO2_OL_I_SHIFT))

