wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* Interrupt is Not Inhibited */
#define SBC_FS23_M_WAKE1_OL_M_NOT_INHIBIT    ((uint16)((uint16)0x0000U << SBC_FS23_M_WAKE1_OL_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_WAKE1_OL_M_INHIBIT        ((uint16)((uint16)0x0001U << SBC_FS23_M_WAKE1_OL_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_WAKE2_OL_M_NOT_INHIBIT    ((uint16)((uint16)0x0000U << SBC_FS23_M_WAKE2_OL_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_WAKE2_OL_M_INHIBIT        ((uint16)((uint16)0x0001U << SBC_FS23_M_WAKE2_OL_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_HVIO1_OL_M_NOT_INHIBIT    ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO1_OL_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_HVIO1_OL_M_INHIBIT        ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO1_OL_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_HVIO2_OL_M_NOT_INHIBIT    ((uint16)((uint16)0x0000U << SBC_FS23_M_HVIO2_OL_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_HVIO2_OL_M_INHIBIT        ((uint16)((uint16)0x0001U << SBC_FS23_M_HVIO2_OL_M_SHIFT))

/******************************************************************************/
/* M_HSX_SRC_CFG - Type: RW                                                   */
/******************************************************************************/

#define SBC_FS23_M_HSX_SRC_CFG_ADDR          ((uint8)(0x21U))
#define SBC_FS23_M_HSX_SRC_CFG_DEFAULT       ((uint16)(0x0000U))

/* Select HS1 source */
#define SBC_FS23_M_HS1_SRC_SEL_MASK             ((uint16)(0x000FU))
#define SBC_FS23_M_HS1_SRC_SEL_SHIFT            ((uint16)(0x0000U))
/* Select HS2 source */
#define SBC_FS23_M_HS2_SRC_SEL_MASK             ((uint16)(0x00F0U))
#define SBC_FS23_M_HS2_SRC_SEL_SHIFT            ((uint16)(0x0004U))
/* Select HS3 source */
#define SBC_FS23_M_HS3_SRC_SEL_MASK             ((uint16)(0x0F00U))
#define SBC_FS23_M_HS3_SRC_SEL_SHIFT            ((uint16)(0x0008U))
/* Select HS4 source */
#define SBC_FS23_M_HS4_SRC_SEL_MASK             ((uint16)(0xF000U))
#define SBC_FS23_M_HS4_SRC_SEL_SHIFT            ((uint16)(0x000CU))

/* High side is driven by HS1_EN and HS1_DIS register bits */
#define SBC_FS23_M_HS1_SRC_SEL_EN_DIS           ((uint16)((uint16)0x0000U << SBC_FS23_M_HS1_SRC_SEL_SHIFT))
/* HVIO1 is selected as direct drive pin */
#define SBC_FS23_M_HS1_SRC_SEL_HVIO1            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS1_SRC_SEL_SHIFT))
/* HVIO2 is selected as direct drive pin */
#define SBC_FS23_M_HS1_SRC_SEL_HVIO2            ((uint16)((uint16)0x0002U << SBC_FS23_M_HS1_SRC_SEL_SHIFT))
/* WAKE1 is selected as direct drive pin */
#define SBC_FS23_M_HS1_SRC_SEL_WAKE1            ((uint16)((uint16)0x0003U << SBC_FS23_M_HS1_SRC_SEL_SHIFT))
/* WAKE2 is selected as direct drive pin */
#define SBC_FS23_M_HS1_SRC_SEL_WAKE2            ((uint16)((uint16)0x0004U << SBC_FS23_M_HS1_SRC_SEL_SHIFT))
/* LVIO3 is selected as direct drive pin */
#define SBC_FS23_M_HS1_SRC_SEL_LVIO3            ((uint16)((uint16)0x0005U << SBC_FS23_M_HS1_SRC_SEL_SHIFT))
/* LVIO4 is selected as direct drive pin */
#define SBC_FS23_M_HS1_SRC_SEL_LVIO4            ((uint16)((uint16)0x0006U << SBC_FS23_M_HS1_SRC_SEL_SHIFT))
/* LVI5 is selected as direct drive pin */
#define SBC_FS23_M_HS1_SRC_SEL_LVI5             ((uint16)((uint16)0x0007U << SBC_FS23_M_HS1_SRC_SEL_SHIFT))
/* High side is driven by TIMER1 */
#define SBC_FS23_M_HS1_SRC_SEL_TIMER1           ((uint16)((uint16)0x0008U << SBC_FS23_M_HS1_SRC_SEL_SHIFT))
/* High side is driven by TIMER2 */
#define SBC_FS23_M_HS1_SRC_SEL_TIMER2           ((uint16)((uint16)0x0009U << SBC_FS23_M_HS1_SRC_SEL_SHIFT))
/* High side is driven by TIMER3 */
#define SBC_FS23_M_HS1_SRC_SEL_TIMER3           ((uint16)((uint16)0x000AU << SBC_FS23_M_HS1_SRC_SEL_SHIFT))
/* High side is driven by PWM1 */
#define SBC_FS23_M_HS1_SRC_SEL_PWM1             ((uint16)((uint16)0x000BU << SBC_FS23_M_HS1_SRC_SEL_SHIFT))
/* High side is driven by PWM2 */
#define SBC_FS23_M_HS1_SRC_SEL_PWM2             ((uint16)((uint16)0x000CU << SBC_FS23_M_HS1_SRC_SEL_SHIFT))
/* High side is driven by PWM3 */
#define SBC_FS23_M_HS1_SRC_SEL_PWM3             ((uint16)((uint16)0x000DU << SBC_FS23_M_HS1_SRC_SEL_SHIFT))

/* High side is driven by HS2_EN and HS2_DIS register bits */
#define SBC_FS23_M_HS2_SRC_SEL_EN_DIS           ((uint16)((uint16)0x0000U << SBC_FS23_M_HS2_SRC_SEL_SHIFT))
/* HVIO1 is selected as direct drive pin */
#define SBC_FS23_M_HS2_SRC_SEL_HVIO1            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS2_SRC_SEL_SHIFT))
/* HVIO2 is selected as direct drive pin */
#define SBC_FS23_M_HS2_SRC_SEL_HVIO2            ((uint16)((uint16)0x0002U << SBC_FS23_M_HS2_SRC_SEL_SHIFT))
/* WAKE1 is selected as direct drive pin */
#define SBC_FS23_M_HS2_SRC_SEL_WAKE1            ((uint16)((uint16)0x0003U << SBC_FS23_M_HS2_SRC_SEL_SHIFT))
/* WAKE2 is selected as direct drive pin */
#define SBC_FS23_M_HS2_SRC_SEL_WAKE2            ((uint16)((uint16)0x0004U << SBC_FS23_M_HS2_SRC_SEL_SHIFT))
/* LVIO3 is selected as direct drive pin */
#define SBC_FS23_M_HS2_SRC_SEL_LVIO3            ((uint16)((uint16)0x0005U << SBC_FS23_M_HS2_SRC_SEL_SHIFT))
/* LVIO4 is selected as direct drive pin */
#define SBC_FS23_M_HS2_SRC_SEL_LVIO4            ((uint16)((uint16)0x0006U << SBC_FS23_M_HS2_SRC_SEL_SHIFT))
/* LVI5 is selected as direct drive pin */
#define SBC_FS23_M_HS2_SRC_SEL_LVI5             ((uint16)((uint16)0x0007U << SBC_FS23_M_HS2_SRC_SEL_SHIFT))
/* High side is driven by TIMER1 */
#define SBC_FS23_M_HS2_SRC_SEL_TIMER1           ((uint16)((uint16)0x0008U << SBC_FS23_M_HS2_SRC_SEL_SHIFT))
/* High side is driven by TIMER2 */
#define SBC_FS23_M_HS2_SRC_SEL_TIMER2           ((uint16)((uint16)0x0009U << SBC_FS23_M_HS2_SRC_SEL_SHIFT))
/* High side is driven by TIMER3 */
#define SBC_FS23_M_HS2_SRC_SEL_TIMER3           ((uint16)((uint16)0x000AU << SBC_FS23_M_HS2_SRC_SEL_SHIFT))
/* High side is driven by PWM1 */
#define SBC_FS23_M_HS2_SRC_SEL_PWM1             ((uint16)((uint16)0x000BU << SBC_FS23_M_HS2_SRC_SEL_SHIFT))
/* High side is driven by PWM2 */
#define SBC_FS23_M_HS2_SRC_SEL_PWM2             ((uint16)((uint16)0x000CU << SBC_FS23_M_HS2_SRC_SEL_SHIFT))
/* High side is driven by PWM3 */
#define SBC_FS23_M_HS2_SRC_SEL_PWM3             ((uint16)((uint16)0x000DU << SBC_FS23_M_HS2_SRC_SEL_SHIFT))

/* High side is driven by HS3_EN and HS3_DIS register bits */
#define SBC_FS23_M_HS3_SRC_SEL_EN_DIS           ((uint16)((uint16)0x0000U << SBC_FS23_M_HS3_SRC_SEL_SHIFT))
/* HVIO1 is selected as direct drive pin */
#define SBC_FS23_M_HS3_SRC_SEL_HVIO1            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS3_SRC_SEL_SHIFT))
/* HVIO2 is selected as direct drive pin */
#define SBC_FS23_M_HS3_SRC_SEL_HVIO2            ((uint16)((uint16)0x0002U << SBC_FS23_M_HS3_SRC_SEL_SHIFT))
/* WAKE1 is selected as direct drive pin */
#define SBC_FS23_M_HS3_SRC_SEL_WAKE1            ((uint16)((uint16)0x0003U << SBC_FS23_M_HS3_SRC_SEL_SHIFT))
/* WAKE2 is selected as direct drive pin */
#define SBC_FS23_M_HS3_SRC_SEL_WAKE2            ((uint16)((uint16)0x0004U << SBC_FS23_M_HS3_SRC_SEL_SHIFT))
/* LVIO3 is selected as direct drive pin */
#define SBC_FS23_M_HS3_SRC_SEL_LVIO3            ((uint16)((uint16)0x0005U << SBC_FS23_M_HS3_SRC_SEL_SHIFT))
/* LVIO4 is selected as direct drive pin */
#define SBC_FS23_M_HS3_SRC_SEL_LVIO4            ((uint16)((uint16)0x0006U << SBC_FS23_M_HS3_SRC_SEL_SHIFT))
/* LVI5 is selected as direct drive pin */
#define SBC_FS23_M_HS3_SRC_SEL_LVI5             ((uint16)((uint16)0x0007U << SBC_FS23_M_HS3_SRC_SEL_SHIFT))
/* High side is driven by TIMER1 */
#define SBC_FS23_M_HS3_SRC_SEL_TIMER1           ((uint16)((uint16)0x0008U << SBC_FS23_M_HS3_SRC_SEL_SHIFT))
/* High side is driven by TIMER2 */
#define SBC_FS23_M_HS3_SRC_SEL_TIMER2           ((uint16)((uint16)0x0009U << SBC_FS23_M_HS3_SRC_SEL_SHIFT))
/* High side is driven by TIMER3 */
#define SBC_FS23_M_HS3_SRC_SEL_TIMER3           ((uint16)((uint16)0x000AU << SBC_FS23_M_HS3_SRC_SEL_SHIFT))
/* High side is driven by PWM1 */
#define SBC_FS23_M_HS3_SRC_SEL_PWM1             ((uint16)((uint16)0x000BU << SBC_FS23_M_HS3_SRC_SEL_SHIFT))
/* High side is driven by PWM2 */
#define SBC_FS23_M_HS3_SRC_SEL_PWM2             ((uint16)((uint16)0x000CU << SBC_FS23_M_HS3_SRC_SEL_SHIFT))
/* High side is driven by PWM3 */
#define SBC_FS23_M_HS3_SRC_SEL_PWM3             ((uint16)((uint16)0x000DU << SBC_FS23_M_HS3_SRC_SEL_SHIFT))

