wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* High side is driven by HS4_EN and HS4_DIS register bits */
#define SBC_FS23_M_HS4_SRC_SEL_EN_DIS           ((uint16)((uint16)0x0000U << SBC_FS23_M_HS4_SRC_SEL_SHIFT))
/* HVIO1 is selected as direct drive pin */
#define SBC_FS23_M_HS4_SRC_SEL_HVIO1            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS4_SRC_SEL_SHIFT))
/* HVIO2 is selected as direct drive pin */
#define SBC_FS23_M_HS4_SRC_SEL_HVIO2            ((uint16)((uint16)0x0002U << SBC_FS23_M_HS4_SRC_SEL_SHIFT))
/* WAKE1 is selected as direct drive pin */
#define SBC_FS23_M_HS4_SRC_SEL_WAKE1            ((uint16)((uint16)0x0003U << SBC_FS23_M_HS4_SRC_SEL_SHIFT))
/* WAKE2 is selected as direct drive pin */
#define SBC_FS23_M_HS4_SRC_SEL_WAKE2            ((uint16)((uint16)0x0004U << SBC_FS23_M_HS4_SRC_SEL_SHIFT))
/* LVIO3 is selected as direct drive pin */
#define SBC_FS23_M_HS4_SRC_SEL_LVIO3            ((uint16)((uint16)0x0005U << SBC_FS23_M_HS4_SRC_SEL_SHIFT))
/* LVIO4 is selected as direct drive pin */
#define SBC_FS23_M_HS4_SRC_SEL_LVIO4            ((uint16)((uint16)0x0006U << SBC_FS23_M_HS4_SRC_SEL_SHIFT))
/* LVI5 is selected as direct drive pin */
#define SBC_FS23_M_HS4_SRC_SEL_LVI5             ((uint16)((uint16)0x0007U << SBC_FS23_M_HS4_SRC_SEL_SHIFT))
/* High side is driven by TIMER1 */
#define SBC_FS23_M_HS4_SRC_SEL_TIMER1           ((uint16)((uint16)0x0008U << SBC_FS23_M_HS4_SRC_SEL_SHIFT))
/* High side is driven by TIMER2 */
#define SBC_FS23_M_HS4_SRC_SEL_TIMER2           ((uint16)((uint16)0x0009U << SBC_FS23_M_HS4_SRC_SEL_SHIFT))
/* High side is driven by TIMER3 */
#define SBC_FS23_M_HS4_SRC_SEL_TIMER3           ((uint16)((uint16)0x000AU << SBC_FS23_M_HS4_SRC_SEL_SHIFT))
/* High side is driven by PWM1 */
#define SBC_FS23_M_HS4_SRC_SEL_PWM1             ((uint16)((uint16)0x000BU << SBC_FS23_M_HS4_SRC_SEL_SHIFT))
/* High side is driven by PWM2 */
#define SBC_FS23_M_HS4_SRC_SEL_PWM2             ((uint16)((uint16)0x000CU << SBC_FS23_M_HS4_SRC_SEL_SHIFT))
/* High side is driven by PWM3 */
#define SBC_FS23_M_HS4_SRC_SEL_PWM3             ((uint16)((uint16)0x000DU << SBC_FS23_M_HS4_SRC_SEL_SHIFT))

/******************************************************************************/
/* M_HSX_CTRL - Type: RW                                                      */
/******************************************************************************/

#define SBC_FS23_M_HSX_CTRL_ADDR             ((uint8)(0x22U))
#define SBC_FS23_M_HSX_CTRL_DEFAULT          ((uint16)(0x0000U))

/* Enable the HS1 */
#define SBC_FS23_M_HS1_EN_MASK               ((uint16)(0x0001U))
#define SBC_FS23_M_HS1_EN_SHIFT              ((uint16)(0x0000U))
/* Enable the HS2 */
#define SBC_FS23_M_HS2_EN_MASK               ((uint16)(0x0004U))
#define SBC_FS23_M_HS2_EN_SHIFT              ((uint16)(0x0002U))
/* Enable the HS3 */
#define SBC_FS23_M_HS3_EN_MASK               ((uint16)(0x0010U))
#define SBC_FS23_M_HS3_EN_SHIFT              ((uint16)(0x0004U))
/* Enable the HS4 */
#define SBC_FS23_M_HS4_EN_MASK               ((uint16)(0x0040U))
#define SBC_FS23_M_HS4_EN_SHIFT              ((uint16)(0x0006U))
/* Disable HSx in case of VSHS over-voltage */
#define SBC_FS23_M_HS_VSHSOV_DIS_MASK        ((uint16)(0x1000U))
#define SBC_FS23_M_HS_VSHSOV_DIS_SHIFT       ((uint16)(0x000CU))
/* Disable HSx in case of VSHS under-voltage */
#define SBC_FS23_M_HS_VSHSUV_DIS_MASK        ((uint16)(0x2000U))
#define SBC_FS23_M_HS_VSHSUV_DIS_SHIFT       ((uint16)(0x000DU))
/* Configure the automatic recovery when HSx is disabled due to VSHS UV/OV */
#define SBC_FS23_M_HS_VSHSUVOV_REC_MASK      ((uint16)(0x4000U))
#define SBC_FS23_M_HS_VSHSUVOV_REC_SHIFT     ((uint16)(0x000EU))

/* HS1 is disabled */
#define SBC_FS23_M_HS1_EN_DISABLED           ((uint16)((uint16)0x0000U << SBC_FS23_M_HS1_EN_SHIFT))
/* HS1 is enabled */
#define SBC_FS23_M_HS1_EN_ENABLED            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS1_EN_SHIFT))

/* HS2 is disabled */
#define SBC_FS23_M_HS2_EN_DISABLED           ((uint16)((uint16)0x0000U << SBC_FS23_M_HS2_EN_SHIFT))
/* HS2 is enabled */
#define SBC_FS23_M_HS2_EN_ENABLED            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS2_EN_SHIFT))

/* HS3 is disabled */
#define SBC_FS23_M_HS3_EN_DISABLED           ((uint16)((uint16)0x0000U << SBC_FS23_M_HS3_EN_SHIFT))
/* HS3 is enabled */
#define SBC_FS23_M_HS3_EN_ENABLED            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS3_EN_SHIFT))

/* HS4 is disabled */
#define SBC_FS23_M_HS4_EN_DISABLED           ((uint16)((uint16)0x0000U << SBC_FS23_M_HS4_EN_SHIFT))
/* HS4 is enabled */
#define SBC_FS23_M_HS4_EN_ENABLED            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS4_EN_SHIFT))

/* HSx remains enabled in case of VSHS over-voltage */
#define SBC_FS23_M_HS_VSHSOV_DIS_ENABLED     ((uint16)((uint16)0x0000U << SBC_FS23_M_HS_VSHSOV_DIS_SHIFT))
/* HSx are disabled in case of VSHS over-voltage */
#define SBC_FS23_M_HS_VSHSOV_DIS_DISABLED    ((uint16)((uint16)0x0001U << SBC_FS23_M_HS_VSHSOV_DIS_SHIFT))

/* HSx remains enabled in case of VSHS under-voltage */
#define SBC_FS23_M_HS_VSHSUV_DIS_ENABLED     ((uint16)((uint16)0x0000U << SBC_FS23_M_HS_VSHSUV_DIS_SHIFT))
/* HSx are disabled in case of VSHS under-voltage */
#define SBC_FS23_M_HS_VSHSUV_DIS_DISABLED    ((uint16)((uint16)0x0001U << SBC_FS23_M_HS_VSHSUV_DIS_SHIFT))

/* No recovery */
#define SBC_FS23_M_HS_VSHSUVOV_REC_NO        ((uint16)((uint16)0x0000U << SBC_FS23_M_HS_VSHSUVOV_REC_SHIFT))
/* Automatic recovery when VSHS UV or OV is removed */
#define SBC_FS23_M_HS_VSHSUVOV_REC_AUTO      ((uint16)((uint16)0x0001U << SBC_FS23_M_HS_VSHSUVOV_REC_SHIFT))

/******************************************************************************/
/* M_HSX_FLG - Type: RW                                                       */
/******************************************************************************/

#define SBC_FS23_M_HSX_FLG_ADDR              ((uint8)(0x23U))
#define SBC_FS23_M_HSX_FLG_DEFAULT           ((uint16)(0x0000U))

/* Report HS1 or HS2 Thermal Shutdown event */
#define SBC_FS23_M_HS12_TSD_I_MASK           ((uint16)(0x0001U))
#define SBC_FS23_M_HS12_TSD_I_SHIFT          ((uint16)(0x0000U))
/* Report HS1 Over Current event */
#define SBC_FS23_M_HS1_OC_I_MASK             ((uint16)(0x0002U))
#define SBC_FS23_M_HS1_OC_I_SHIFT            ((uint16)(0x0001U))
/* Report HS1 Open Load event */
#define SBC_FS23_M_HS1_OL_I_MASK             ((uint16)(0x0004U))
#define SBC_FS23_M_HS1_OL_I_SHIFT            ((uint16)(0x0002U))
/* Report HS2 Over Current event */
#define SBC_FS23_M_HS2_OC_I_MASK             ((uint16)(0x0010U))
#define SBC_FS23_M_HS2_OC_I_SHIFT            ((uint16)(0x0004U))
/* Report HS2 Open Load event */
#define SBC_FS23_M_HS2_OL_I_MASK             ((uint16)(0x0020U))
#define SBC_FS23_M_HS2_OL_I_SHIFT            ((uint16)(0x0005U))
/* Report HS3 or HS4 Thermal Shutdown event */
#define SBC_FS23_M_HS34_TSD_I_MASK           ((uint16)(0x0080U))
#define SBC_FS23_M_HS34_TSD_I_SHIFT          ((uint16)(0x0007U))
/* Report HS3 Over Current event */
#define SBC_FS23_M_HS3_OC_I_MASK             ((uint16)(0x0100U))
#define SBC_FS23_M_HS3_OC_I_SHIFT            ((uint16)(0x0008U))
/* Report HS3 Open Load event */
#define SBC_FS23_M_HS3_OL_I_MASK             ((uint16)(0x0200U))
#define SBC_FS23_M_HS3_OL_I_SHIFT            ((uint16)(0x0009U))
/* Report HS4 Over Current event */
#define SBC_FS23_M_HS4_OC_I_MASK             ((uint16)(0x0800U))
#define SBC_FS23_M_HS4_OC_I_SHIFT            ((uint16)(0x000BU))
/* Report HS4 Open Load event */
#define SBC_FS23_M_HS4_OL_I_MASK             ((uint16)(0x1000U))
#define SBC_FS23_M_HS4_OL_I_SHIFT            ((uint16)(0x000CU))

/* No event detected */
#define SBC_FS23_M_HS12_TSD_I_NO_EVENT       ((uint16)((uint16)0x0000U << SBC_FS23_M_HS12_TSD_I_SHIFT))
/* HS1 or HS2 TSD occurred */
#define SBC_FS23_M_HS12_TSD_I_EVENT          ((uint16)((uint16)0x0001U << SBC_FS23_M_HS12_TSD_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_HS1_OC_I_NO_EVENT         ((uint16)((uint16)0x0000U << SBC_FS23_M_HS1_OC_I_SHIFT))
/* HS1 OC occurred */
#define SBC_FS23_M_HS1_OC_I_EVENT            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS1_OC_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_HS1_OL_I_NO_EVENT         ((uint16)((uint16)0x0000U << SBC_FS23_M_HS1_OL_I_SHIFT))
/* HS1 OL occurred */
#define SBC_FS23_M_HS1_OL_I_EVENT            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS1_OL_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_HS2_OC_I_NO_EVENT         ((uint16)((uint16)0x0000U << SBC_FS23_M_HS2_OC_I_SHIFT))
/* HS2 OC occurred */
#define SBC_FS23_M_HS2_OC_I_EVENT            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS2_OC_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_HS2_OL_I_NO_EVENT         ((uint16)((uint16)0x0000U << SBC_FS23_M_HS2_OL_I_SHIFT))
/* HS2 OL occu */
#define SBC_FS23_M_HS2_OL_I_EVENT            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS2_OL_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_HS34_TSD_I_NO_EVENT       ((uint16)((uint16)0x0000U << SBC_FS23_M_HS34_TSD_I_SHIFT))
/* HS3 or HS4 TSD occurred */
#define SBC_FS23_M_HS34_TSD_I_EVENT          ((uint16)((uint16)0x0001U << SBC_FS23_M_HS34_TSD_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_HS3_OC_I_NO_EVENT         ((uint16)((uint16)0x0000U << SBC_FS23_M_HS3_OC_I_SHIFT))
/* HS3 OC occurred */
#define SBC_FS23_M_HS3_OC_I_EVENT            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS3_OC_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_HS3_OL_I_NO_EVENT         ((uint16)((uint16)0x0000U << SBC_FS23_M_HS3_OL_I_SHIFT))
/* HS3 OL occurred */
#define SBC_FS23_M_HS3_OL_I_EVENT            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS3_OL_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_HS4_OC_I_NO_EVENT         ((uint16)((uint16)0x0000U << SBC_FS23_M_HS4_OC_I_SHIFT))
/* HS4 OC occurred */
#define SBC_FS23_M_HS4_OC_I_EVENT            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS4_OC_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_HS4_OL_I_NO_EVENT         ((uint16)((uint16)0x0000U << SBC_FS23_M_HS4_OL_I_SHIFT))
/* HS4 OL occurred */
#define SBC_FS23_M_HS4_OL_I_EVENT            ((uint16)((uint16)0x0001U << SBC_FS23_M_HS4_OL_I_SHIFT))

/******************************************************************************/
/* M_HSX_MSK - Type: RW                                                       */
/******************************************************************************/

