wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
#define SBC_FS23_M_HSX_MSK_ADDR              ((uint8)(0x24U))
#define SBC_FS23_M_HSX_MSK_DEFAULT           ((uint16)(0x0000U))

/* Inhibit HS1 and HS2 Thermal Shutdown Interrupt */
#define SBC_FS23_M_HS12_TSD_M_MASK           ((uint16)(0x0001U))
#define SBC_FS23_M_HS12_TSD_M_SHIFT          ((uint16)(0x0000U))
/* Inhibit HS1 Over Current Interrupt */
#define SBC_FS23_M_HS1_OC_M_MASK             ((uint16)(0x0002U))
#define SBC_FS23_M_HS1_OC_M_SHIFT            ((uint16)(0x0001U))
/* Inhibit HS1 Open Load Interrupt */
#define SBC_FS23_M_HS1_OL_M_MASK             ((uint16)(0x0004U))
#define SBC_FS23_M_HS1_OL_M_SHIFT            ((uint16)(0x0002U))
/* Inhibit HS2 Over Current Interrupt */
#define SBC_FS23_M_HS2_OC_M_MASK             ((uint16)(0x0010U))
#define SBC_FS23_M_HS2_OC_M_SHIFT            ((uint16)(0x0004U))
/* Inhibit HS2 Open Load Interrupt */
#define SBC_FS23_M_HS2_OL_M_MASK             ((uint16)(0x0020U))
#define SBC_FS23_M_HS2_OL_M_SHIFT            ((uint16)(0x0005U))
/* Inhibit HS3 and HS4 Thermal Shutdown Interrupt */
#define SBC_FS23_M_HS34_TSD_M_MASK           ((uint16)(0x0080U))
#define SBC_FS23_M_HS34_TSD_M_SHIFT          ((uint16)(0x0007U))
/* Inhibit HS3 Over Current Interrupt */
#define SBC_FS23_M_HS3_OC_M_MASK             ((uint16)(0x0100U))
#define SBC_FS23_M_HS3_OC_M_SHIFT            ((uint16)(0x0008U))
/* Inhibit HS3 Open Load Interrupt */
#define SBC_FS23_M_HS3_OL_M_MASK             ((uint16)(0x0200U))
#define SBC_FS23_M_HS3_OL_M_SHIFT            ((uint16)(0x0009U))
/* Inhibit HS4 Over Current Interrupt */
#define SBC_FS23_M_HS4_OC_M_MASK             ((uint16)(0x0800U))
#define SBC_FS23_M_HS4_OC_M_SHIFT            ((uint16)(0x000BU))
/* Inhibit HS4 Open Load Interrupt */
#define SBC_FS23_M_HS4_OL_M_MASK             ((uint16)(0x1000U))
#define SBC_FS23_M_HS4_OL_M_SHIFT            ((uint16)(0x000CU))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_HS12_TSD_M_NOT_INHIBIT    ((uint16)((uint16)0x0000U << SBC_FS23_M_HS12_TSD_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_HS12_TSD_M_INHIBIT        ((uint16)((uint16)0x0001U << SBC_FS23_M_HS12_TSD_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_HS1_OC_M_NOT_INHIBIT      ((uint16)((uint16)0x0000U << SBC_FS23_M_HS1_OC_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_HS1_OC_M_INHIBIT          ((uint16)((uint16)0x0001U << SBC_FS23_M_HS1_OC_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_HS1_OL_M_NOT_INHIBIT      ((uint16)((uint16)0x0000U << SBC_FS23_M_HS1_OL_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_HS1_OL_M_INHIBIT          ((uint16)((uint16)0x0001U << SBC_FS23_M_HS1_OL_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_HS2_OC_M_NOT_INHIBIT      ((uint16)((uint16)0x0000U << SBC_FS23_M_HS2_OC_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_HS2_OC_M_INHIBIT          ((uint16)((uint16)0x0001U << SBC_FS23_M_HS2_OC_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_HS2_OL_M_NOT_INHIBIT      ((uint16)((uint16)0x0000U << SBC_FS23_M_HS2_OL_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_HS2_OL_M_INHIBIT          ((uint16)((uint16)0x0001U << SBC_FS23_M_HS2_OL_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_HS34_TSD_M_NOT_INHIBIT    ((uint16)((uint16)0x0000U << SBC_FS23_M_HS34_TSD_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_HS34_TSD_M_INHIBIT        ((uint16)((uint16)0x0001U << SBC_FS23_M_HS34_TSD_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_HS3_OC_M_NOT_INHIBIT      ((uint16)((uint16)0x0000U << SBC_FS23_M_HS3_OC_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_HS3_OC_M_INHIBIT          ((uint16)((uint16)0x0001U << SBC_FS23_M_HS3_OC_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_HS3_OL_M_NOT_INHIBIT      ((uint16)((uint16)0x0000U << SBC_FS23_M_HS3_OL_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_HS3_OL_M_INHIBIT          ((uint16)((uint16)0x0001U << SBC_FS23_M_HS3_OL_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_HS4_OC_M_NOT_INHIBIT      ((uint16)((uint16)0x0000U << SBC_FS23_M_HS4_OC_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_HS4_OC_M_INHIBIT          ((uint16)((uint16)0x0001U << SBC_FS23_M_HS4_OC_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_HS4_OL_M_NOT_INHIBIT      ((uint16)((uint16)0x0000U << SBC_FS23_M_HS4_OL_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_HS4_OL_M_INHIBIT          ((uint16)((uint16)0x0001U << SBC_FS23_M_HS4_OL_M_SHIFT))

/******************************************************************************/
/* M_AMUX_CTRL - Type: RW                                                     */
/******************************************************************************/

#define SBC_FS23_M_AMUX_CTRL_ADDR            ((uint8)(0x25U))
#define SBC_FS23_M_AMUX_CTRL_DEFAULT         ((uint16)(0x0000U))

/* Select AMUX Input Channel */
#define SBC_FS23_M_AMUX_MASK                 ((uint16)(0x001FU))
#define SBC_FS23_M_AMUX_SHIFT                ((uint16)(0x0000U))
/* Select AMUX divider ratio for high voltage channels */
#define SBC_FS23_M_AMUX_DIV_MASK             ((uint16)(0x0100U))
#define SBC_FS23_M_AMUX_DIV_SHIFT            ((uint16)(0x0008U))
/* Enable AMUX block */
#define SBC_FS23_M_AMUX_EN_MASK              ((uint16)(0x0200U))
#define SBC_FS23_M_AMUX_EN_SHIFT             ((uint16)(0x0009U))

/* AGND is selected */
#define SBC_FS23_M_AMUX_GND                  ((uint16)((uint16)0x0000U << SBC_FS23_M_AMUX_SHIFT))
/* V1p6 internal voltage (VDIG) is selected */
#define SBC_FS23_M_AMUX_VDIG                 ((uint16)((uint16)0x0001U << SBC_FS23_M_AMUX_SHIFT))
/* V1 voltage is selected */
#define SBC_FS23_M_AMUX_V1                   ((uint16)((uint16)0x0002U << SBC_FS23_M_AMUX_SHIFT))
/* V2 voltage is selected */
#define SBC_FS23_M_AMUX_V2                   ((uint16)((uint16)0x0003U << SBC_FS23_M_AMUX_SHIFT))
/* V3 voltage is selected */
#define SBC_FS23_M_AMUX_V3                   ((uint16)((uint16)0x0004U << SBC_FS23_M_AMUX_SHIFT))
/* VBOS internal voltage is selected */
#define SBC_FS23_M_AMUX_VBOS                 ((uint16)((uint16)0x0005U << SBC_FS23_M_AMUX_SHIFT))
/* VSUP voltage is selected (divider ratio configurable by SPI/I2C) */
#define SBC_FS23_M_AMUX_VSUP                 ((uint16)((uint16)0x0006U << SBC_FS23_M_AMUX_SHIFT))
/* VSHS voltage is selected (divider ratio configurable by SPI/I2C) */
#define SBC_FS23_M_AMUX_VSHS                 ((uint16)((uint16)0x0007U << SBC_FS23_M_AMUX_SHIFT))
/* WAKE1 voltage is selected (divider ratio configurable by SPI/I2C) */
#define SBC_FS23_M_AMUX_WAKE1                ((uint16)((uint16)0x0008U << SBC_FS23_M_AMUX_SHIFT))
/* WAKE2 voltage is selected (divider ratio configurable by SPI/I2C) */
#define SBC_FS23_M_AMUX_WAKE2                ((uint16)((uint16)0x0009U << SBC_FS23_M_AMUX_SHIFT))
/* HVIO1 voltage is selected (divider ratio configurable by SPI/I2C) */
#define SBC_FS23_M_AMUX_HVIO1                ((uint16)((uint16)0x000AU << SBC_FS23_M_AMUX_SHIFT))
/* HVIO2 voltage is selected (divider ratio configurable by SPI/I2C) */
#define SBC_FS23_M_AMUX_HVIO2                ((uint16)((uint16)0x000BU << SBC_FS23_M_AMUX_SHIFT))
/* Die Temperature Sensor is selected : T(C) = (VAMUX � VTEMP25) / VTEMP_COEFF + 25 */
#define SBC_FS23_M_AMUX_TDIE                 ((uint16)((uint16)0x000CU << SBC_FS23_M_AMUX_SHIFT))
/* V1 Temperature sensor is selected */
#define SBC_FS23_M_AMUX_TV1                  ((uint16)((uint16)0x000DU << SBC_FS23_M_AMUX_SHIFT))
/* V2 Temperature sensor is selected */
#define SBC_FS23_M_AMUX_TV2                  ((uint16)((uint16)0x000EU << SBC_FS23_M_AMUX_SHIFT))
/* V3 Temperature sensor is selected */
#define SBC_FS23_M_AMUX_TV3                  ((uint16)((uint16)0x000FU << SBC_FS23_M_AMUX_SHIFT))
/* VDDIO not divided is selected */
#define SBC_FS23_M_AMUX_VDDIO                ((uint16)((uint16)0x0010U << SBC_FS23_M_AMUX_SHIFT))

