wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* Low divider ratio is selected (div by 7.5) */
#define SBC_FS23_M_AMUX_DIV_LOW              ((uint16)((uint16)0x0000U << SBC_FS23_M_AMUX_DIV_SHIFT))
/* High divider ratio is selected (div by 14) */
#define SBC_FS23_M_AMUX_DIV_HIGH             ((uint16)((uint16)0x0001U << SBC_FS23_M_AMUX_DIV_SHIFT))

/* AMUX is disabled (HIZ, int pull down) */
#define SBC_FS23_M_AMUX_EN_DISABLED          ((uint16)((uint16)0x0000U << SBC_FS23_M_AMUX_EN_SHIFT))
/* AMUX is enabled in Normal mode only */
#define SBC_FS23_M_AMUX_EN_ENABLED           ((uint16)((uint16)0x0001U << SBC_FS23_M_AMUX_EN_SHIFT))

/******************************************************************************/
/* M_LDT_CFG1 - Type: RW                                                      */
/******************************************************************************/

#define SBC_FS23_M_LDT_CFG1_ADDR             ((uint8)(0x26U))
#define SBC_FS23_M_LDT_CFG1_DEFAULT          ((uint16)(0x0000U))

/* Configure and read the After run LDT Timer */
#define SBC_FS23_M_LDT_AFTER_RUN_MASK        ((uint16)(0xFFFFU))
#define SBC_FS23_M_LDT_AFTER_RUN_SHIFT       ((uint16)(0x0000U))

/******************************************************************************/
/* M_LDT_CFG2 - Type: RW                                                      */
/******************************************************************************/

#define SBC_FS23_M_LDT_CFG2_ADDR             ((uint8)(0x27U))
#define SBC_FS23_M_LDT_CFG2_DEFAULT          ((uint16)(0x0000U))

/* Configure and read the 16 less significant bits of Wake-up LDT Timer */
#define SBC_FS23_M_LDT_WUP_L_MASK            ((uint16)(0xFFFFU))
#define SBC_FS23_M_LDT_WUP_L_SHIFT           ((uint16)(0x0000U))

/******************************************************************************/
/* M_LDT_CFG3 - Type: RW                                                      */
/******************************************************************************/

#define SBC_FS23_M_LDT_CFG3_ADDR             ((uint8)(0x28U))
#define SBC_FS23_M_LDT_CFG3_DEFAULT          ((uint16)(0x0000U))

/* Configure and read the 8 more significant bits of LDT Wake-up Timer */
#define SBC_FS23_M_LDT_WUP_H_MASK            ((uint16)(0x00FFU))
#define SBC_FS23_M_LDT_WUP_H_SHIFT           ((uint16)(0x0000U))

/******************************************************************************/
/* M_LDT_CTRL - Type: RW                                                      */
/******************************************************************************/

#define SBC_FS23_M_LDT_CTRL_ADDR             ((uint8)(0x29U))
#define SBC_FS23_M_LDT_CTRL_DEFAULT          ((uint16)(0x0000U))

/* LDT Status */
#define SBC_FS23_M_LDT_RUN_MASK              ((uint16)(0x0001U))
#define SBC_FS23_M_LDT_RUN_SHIFT             ((uint16)(0x0000U))
/* Start LDT Timer operation */
#define SBC_FS23_M_LDT_EN_MASK               ((uint16)(0x0002U))
#define SBC_FS23_M_LDT_EN_SHIFT              ((uint16)(0x0001U))
/* Set LDT operation mode */
#define SBC_FS23_M_LDT_MODE_MASK             ((uint16)(0x0004U))
#define SBC_FS23_M_LDT_MODE_SHIFT            ((uint16)(0x0002U))
/* Configure and read LDT timer selection */
#define SBC_FS23_M_LDT_SEL_MASK              ((uint16)(0x0008U))
#define SBC_FS23_M_LDT_SEL_SHIFT             ((uint16)(0x0003U))
/* Select LDT function */
#define SBC_FS23_M_LDT_FNCT_MASK             ((uint16)(0x0070U))
#define SBC_FS23_M_LDT_FNCT_SHIFT            ((uint16)(0x0004U))
/* Select LP mode transition from LDT F2 and F3 */
#define SBC_FS23_M_LDT2LP_MASK               ((uint16)(0x0080U))
#define SBC_FS23_M_LDT2LP_SHIFT              ((uint16)(0x0007U))

/* LDT is idle */
#define SBC_FS23_M_LDT_RUN_IDLE              ((uint16)((uint16)0x0000U << SBC_FS23_M_LDT_RUN_SHIFT))
/* LDT is busy */
#define SBC_FS23_M_LDT_RUN_BUSY              ((uint16)((uint16)0x0001U << SBC_FS23_M_LDT_RUN_SHIFT))

/* LDT is disabled */
#define SBC_FS23_M_LDT_EN_DISABLED           ((uint16)((uint16)0x0000U << SBC_FS23_M_LDT_EN_SHIFT))
/* LDT starts counting */
#define SBC_FS23_M_LDT_EN_ENABLED            ((uint16)((uint16)0x0001U << SBC_FS23_M_LDT_EN_SHIFT))

/* LDT is set to long count (1s) */
#define SBC_FS23_M_LDT_MODE_LONG             ((uint16)((uint16)0x0000U << SBC_FS23_M_LDT_MODE_SHIFT))
/* LDT is set to short count (128us) */
#define SBC_FS23_M_LDT_MODE_SHORT            ((uint16)((uint16)0x0001U << SBC_FS23_M_LDT_MODE_SHIFT))

/* Target value of Wake-up LDT timer can be read or write */
#define SBC_FS23_M_LDT_SEL_TARGET            ((uint16)((uint16)0x0000U << SBC_FS23_M_LDT_SEL_SHIFT))
/* Real time value of 24 bit Timer is reported (once LDT stopped) */
#define SBC_FS23_M_LDT_SEL_REALTIME          ((uint16)((uint16)0x0001U << SBC_FS23_M_LDT_SEL_SHIFT))

/* Function 1 is selected */
#define SBC_FS23_M_LDT_FNCT_1                ((uint16)((uint16)0x0000U << SBC_FS23_M_LDT_FNCT_SHIFT))
/* Function 2 is selected */
#define SBC_FS23_M_LDT_FNCT_2                ((uint16)((uint16)0x0001U << SBC_FS23_M_LDT_FNCT_SHIFT))
/* Function 3 is selected */
#define SBC_FS23_M_LDT_FNCT_3                ((uint16)((uint16)0x0002U << SBC_FS23_M_LDT_FNCT_SHIFT))
/* Function 4 is selected */
#define SBC_FS23_M_LDT_FNCT_4                ((uint16)((uint16)0x0003U << SBC_FS23_M_LDT_FNCT_SHIFT))
/* Function 5 is selected */
#define SBC_FS23_M_LDT_FNCT_5                ((uint16)((uint16)0x0004U << SBC_FS23_M_LDT_FNCT_SHIFT))

/* Go to LPOFF */
#define SBC_FS23_M_LDT2LP_LPOFF              ((uint16)((uint16)0x0000U << SBC_FS23_M_LDT2LP_SHIFT))
/* Go to LPON */
#define SBC_FS23_M_LDT2LP_LPON               ((uint16)((uint16)0x0001U << SBC_FS23_M_LDT2LP_SHIFT))

/******************************************************************************/
/* M_CAN - Type: RW                                                           */
/******************************************************************************/

#define SBC_FS23_M_CAN_ADDR                  ((uint8)(0x2AU))
#define SBC_FS23_M_CAN_DEFAULT               ((uint16)(0x0000U))

