wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* Report CAN Over Temperature event */
#define SBC_FS23_M_CAN_TSD_I_MASK            ((uint16)(0x0001U))
#define SBC_FS23_M_CAN_TSD_I_SHIFT           ((uint16)(0x0000U))
/* Report CAN TXD Dominant timeout event */
#define SBC_FS23_M_CAN_TXD_TO_I_MASK         ((uint16)(0x0002U))
#define SBC_FS23_M_CAN_TXD_TO_I_SHIFT        ((uint16)(0x0001U))
/* Disable the CAN when RSTB or LIMP0 or FS0B is activated */
#define SBC_FS23_M_CAN_FS_DIS_MASK           ((uint16)(0x0020U))
#define SBC_FS23_M_CAN_FS_DIS_SHIFT          ((uint16)(0x0005U))
/* Real Time status of CAN mode */
#define SBC_FS23_M_CAN_ACTIVE_MODE_S_MASK    ((uint16)(0x0080U))
#define SBC_FS23_M_CAN_ACTIVE_MODE_S_SHIFT   ((uint16)(0x0007U))
/* Select the CAN mode control */
#define SBC_FS23_M_CAN_MODE_MASK             ((uint16)(0x0300U))
#define SBC_FS23_M_CAN_MODE_SHIFT            ((uint16)(0x0008U))

/* No event detected */
#define SBC_FS23_M_CAN_TSD_I_NO_EVENT        ((uint16)((uint16)0x0000U << SBC_FS23_M_CAN_TSD_I_SHIFT))
/* CAN Thermal Shutdown occurred */
#define SBC_FS23_M_CAN_TSD_I_EVENT           ((uint16)((uint16)0x0001U << SBC_FS23_M_CAN_TSD_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_CAN_TXD_TO_I_NO_EVENT     ((uint16)((uint16)0x0000U << SBC_FS23_M_CAN_TXD_TO_I_SHIFT))
/* Dominant timeout occurred */
#define SBC_FS23_M_CAN_TXD_TO_I_EVENT        ((uint16)((uint16)0x0001U << SBC_FS23_M_CAN_TXD_TO_I_SHIFT))

/* CAN transceiver is offline */
#define SBC_FS23_M_CAN_FS_DIS_OFFLINE        ((uint16)((uint16)0x0000U << SBC_FS23_M_CAN_FS_DIS_SHIFT))
/* CAN transceiver keeps the current state */
#define SBC_FS23_M_CAN_FS_DIS_KEEP           ((uint16)((uint16)0x0001U << SBC_FS23_M_CAN_FS_DIS_SHIFT))

/* CAN is neither in LISTEN ONLY mode nor in NORMAL mode */
#define SBC_FS23_M_CAN_ACTIVE_MODE_S_NOT_ACTIVE ((uint16)((uint16)0x0000U << SBC_FS23_M_CAN_ACTIVE_MODE_S_SHIFT))
/* CAN is either in LISTEN ONLY mode or in NORMAL mode */
#define SBC_FS23_M_CAN_ACTIVE_MODE_S_ACTIVE  ((uint16)((uint16)0x0001U << SBC_FS23_M_CAN_ACTIVE_MODE_S_SHIFT))

/* Transceiver offline (TX and RX disabled) */
#define SBC_FS23_M_CAN_MODE_DISABLED         ((uint16)((uint16)0x0000U << SBC_FS23_M_CAN_MODE_SHIFT))
/* Transceiver receive only mode (TX disabled and RX enabled) */
#define SBC_FS23_M_CAN_MODE_RX_ONLY          ((uint16)((uint16)0x0001U << SBC_FS23_M_CAN_MODE_SHIFT))
/* Transceiver active mode (TX and RX enabled) reacting on V3UV */
#define SBC_FS23_M_CAN_MODE_ACTIVE           ((uint16)((uint16)0x0002U << SBC_FS23_M_CAN_MODE_SHIFT))

/******************************************************************************/
/* M_LIN - Type: RW                                                           */
/******************************************************************************/

#define SBC_FS23_M_LIN_ADDR                  ((uint8)(0x2BU))
#define SBC_FS23_M_LIN_DEFAULT               ((uint16)(0x0000U))

/* Report LIN Over Temperature event */
#define SBC_FS23_M_LIN_TSD_I_MASK            ((uint16)(0x0001U))
#define SBC_FS23_M_LIN_TSD_I_SHIFT           ((uint16)(0x0000U))
/* Report LIN TXD Dominant timeout event */
#define SBC_FS23_M_LIN_TXD_TO_I_MASK         ((uint16)(0x0002U))
#define SBC_FS23_M_LIN_TXD_TO_I_SHIFT        ((uint16)(0x0001U))
/* Report LIN short-circuit event */
#define SBC_FS23_M_LIN_SC_I_MASK             ((uint16)(0x0004U))
#define SBC_FS23_M_LIN_SC_I_SHIFT            ((uint16)(0x0002U))
/* Enable the TXD dominant timeout detection */
#define SBC_FS23_M_LIN_TXD_TO_MASK           ((uint16)(0x0080U))
#define SBC_FS23_M_LIN_TXD_TO_SHIFT          ((uint16)(0x0007U))
/* Disable the LIN short circuit detection */
#define SBC_FS23_M_LIN_SC_MASK               ((uint16)(0x0100U))
#define SBC_FS23_M_LIN_SC_SHIFT              ((uint16)(0x0008U))
/* Disable VSHS_UV impact on the LIN transceiver */
#define SBC_FS23_M_LIN_VSHSUV_DIS_MASK       ((uint16)(0x0200U))
#define SBC_FS23_M_LIN_VSHSUV_DIS_SHIFT      ((uint16)(0x0009U))
/* Disable the LIN when RSTB or LIMP0 or FS0B is activated */
#define SBC_FS23_M_LIN_FS_DIS_MASK           ((uint16)(0x0400U))
#define SBC_FS23_M_LIN_FS_DIS_SHIFT          ((uint16)(0x000AU))
/* Select the LIN slope control */
#define SBC_FS23_M_LIN_SLOPE_MASK            ((uint16)(0x1800U))
#define SBC_FS23_M_LIN_SLOPE_SHIFT           ((uint16)(0x000BU))
/* Select the LIN mode control */
#define SBC_FS23_M_LIN_MODE_MASK             ((uint16)(0x6000U))
#define SBC_FS23_M_LIN_MODE_SHIFT            ((uint16)(0x000DU))

/* No event detected */
#define SBC_FS23_M_LIN_TSD_I_NO_EVENT        ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_TSD_I_SHIFT))
/* LIN Thermal Shutdown occurred */
#define SBC_FS23_M_LIN_TSD_I_EVENT           ((uint16)((uint16)0x0001U << SBC_FS23_M_LIN_TSD_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_LIN_TXD_TO_I_NO_EVENT     ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_TXD_TO_I_SHIFT))
/* Dominant timeout occurred */
#define SBC_FS23_M_LIN_TXD_TO_I_EVENT        ((uint16)((uint16)0x0001U << SBC_FS23_M_LIN_TXD_TO_I_SHIFT))

/* No event detected */
#define SBC_FS23_M_LIN_SC_I_NO_EVENT         ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_SC_I_SHIFT))
/* Short-circuit timeout occurred */
#define SBC_FS23_M_LIN_SC_I_EVENT            ((uint16)((uint16)0x0001U << SBC_FS23_M_LIN_SC_I_SHIFT))

/* TXD dominant timeout detection is disabled */
#define SBC_FS23_M_LIN_TXD_TO_DISABLED       ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_TXD_TO_SHIFT))
/* TXD dominant timeout detection is enabled */
#define SBC_FS23_M_LIN_TXD_TO_ENABLED        ((uint16)((uint16)0x0001U << SBC_FS23_M_LIN_TXD_TO_SHIFT))

/* LIN short circuit protection is enabled */
#define SBC_FS23_M_LIN_SC_ENABLED            ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_SC_SHIFT))
/* LIN short circuit protection is disabled */
#define SBC_FS23_M_LIN_SC_DISABLED           ((uint16)((uint16)0x0001U << SBC_FS23_M_LIN_SC_SHIFT))

/* The LIN transceiver is OFF in case of VSHS under-voltage */
#define SBC_FS23_M_LIN_VSHSUV_DIS_OFF        ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_VSHSUV_DIS_SHIFT))
/* The LIN transceiver remains in active mode in case of VSHS under-voltage */
#define SBC_FS23_M_LIN_VSHSUV_DIS_ACTIVE     ((uint16)((uint16)0x0001U << SBC_FS23_M_LIN_VSHSUV_DIS_SHIFT))

