wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* LIN transceiver is offline */
#define SBC_FS23_M_LIN_FS_DIS_OFFLINE        ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_FS_DIS_SHIFT))
/* LIN transceiver keeps the current state */
#define SBC_FS23_M_LIN_FS_DIS_KEEP           ((uint16)((uint16)0x0001U << SBC_FS23_M_LIN_FS_DIS_SHIFT))

/* LIN normal slope is enabled */
#define SBC_FS23_M_LIN_SLOPE_NORMAL          ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_SLOPE_SHIFT))
/* LIN slow slope is enabled */
#define SBC_FS23_M_LIN_SLOPE_SLOW            ((uint16)((uint16)0x0002U << SBC_FS23_M_LIN_SLOPE_SHIFT))

/* Transceiver offline */
#define SBC_FS23_M_LIN_MODE_DISABLED         ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_MODE_SHIFT))
/* Transceiver receive only mode */
#define SBC_FS23_M_LIN_MODE_RX_ONLY          ((uint16)((uint16)0x0001U << SBC_FS23_M_LIN_MODE_SHIFT))
/* Transceiver active mode */
#define SBC_FS23_M_LIN_MODE_ACTIVE           ((uint16)((uint16)0x0002U << SBC_FS23_M_LIN_MODE_SHIFT))

/******************************************************************************/
/* M_CAN_LIN_MSK - Type: RW                                                   */
/******************************************************************************/

#define SBC_FS23_M_CAN_LIN_MSK_ADDR          ((uint8)(0x2CU))
#define SBC_FS23_M_CAN_LIN_MSK_DEFAULT       ((uint16)(0x0000U))

/* Inhibit CAN temperature shutdown Interrupt */
#define SBC_FS23_M_CAN_TSD_M_MASK            ((uint16)(0x0001U))
#define SBC_FS23_M_CAN_TSD_M_SHIFT           ((uint16)(0x0000U))
/* Inhibit CAN TXD Dominant timeout Interrupt */
#define SBC_FS23_M_CAN_TXD_TO_M_MASK         ((uint16)(0x0002U))
#define SBC_FS23_M_CAN_TXD_TO_M_SHIFT        ((uint16)(0x0001U))
/* Report the CAN state machine state */
#define SBC_FS23_M_CAN_FSM_STATE_S_MASK      ((uint16)(0x001CU))
#define SBC_FS23_M_CAN_FSM_STATE_S_SHIFT     ((uint16)(0x0002U))
/* Inhibit LIN temperature shutdown Interrupt */
#define SBC_FS23_M_LIN_TSD_M_MASK            ((uint16)(0x0040U))
#define SBC_FS23_M_LIN_TSD_M_SHIFT           ((uint16)(0x0006U))
/* Inhibit LIN TXD Dominant timeout Interrupt */
#define SBC_FS23_M_LIN_TXD_TO_M_MASK         ((uint16)(0x0080U))
#define SBC_FS23_M_LIN_TXD_TO_M_SHIFT        ((uint16)(0x0007U))
/* Inhibit LIN short-circuit Interrupt */
#define SBC_FS23_M_LIN_SC_M_MASK             ((uint16)(0x0100U))
#define SBC_FS23_M_LIN_SC_M_SHIFT            ((uint16)(0x0008U))
/* Report the LIN state machine state */
#define SBC_FS23_M_LIN_FSM_STATE_S_MASK      ((uint16)(0x3E00U))
#define SBC_FS23_M_LIN_FSM_STATE_S_SHIFT     ((uint16)(0x0009U))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_CAN_TSD_M_NOT_INHIBIT     ((uint16)((uint16)0x0000U << SBC_FS23_M_CAN_TSD_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_CAN_TSD_M_INHIBIT         ((uint16)((uint16)0x0001U << SBC_FS23_M_CAN_TSD_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_CAN_TXD_TO_M_NOT_INHIBIT  ((uint16)((uint16)0x0000U << SBC_FS23_M_CAN_TXD_TO_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_CAN_TXD_TO_M_INHIBIT      ((uint16)((uint16)0x0001U << SBC_FS23_M_CAN_TXD_TO_M_SHIFT))

/* OFF */
#define SBC_FS23_M_CAN_FSM_STATE_S_OFF       ((uint16)((uint16)0x0000U << SBC_FS23_M_CAN_FSM_STATE_S_SHIFT))
/* OFFLINE */
#define SBC_FS23_M_CAN_FSM_STATE_S_OFFLINE   ((uint16)((uint16)0x0001U << SBC_FS23_M_CAN_FSM_STATE_S_SHIFT))
/* OFFLINEVCCNOK */
#define SBC_FS23_M_CAN_FSM_STATE_S_OFFLINEVCCNOK ((uint16)((uint16)0x0003U << SBC_FS23_M_CAN_FSM_STATE_S_SHIFT))
/* GOACTIVE */
#define SBC_FS23_M_CAN_FSM_STATE_S_GOACTIVE  ((uint16)((uint16)0x0004U << SBC_FS23_M_CAN_FSM_STATE_S_SHIFT))
/* LISTEN */
#define SBC_FS23_M_CAN_FSM_STATE_S_LISTEN    ((uint16)((uint16)0x0005U << SBC_FS23_M_CAN_FSM_STATE_S_SHIFT))
/* NORMAL */
#define SBC_FS23_M_CAN_FSM_STATE_S_NORMAL    ((uint16)((uint16)0x0007U << SBC_FS23_M_CAN_FSM_STATE_S_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_LIN_TSD_M_NOT_INHIBIT     ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_TSD_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_LIN_TSD_M_INHIBIT         ((uint16)((uint16)0x0001U << SBC_FS23_M_LIN_TSD_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_LIN_TXD_TO_M_NOT_INHIBIT  ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_TXD_TO_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_LIN_TXD_TO_M_INHIBIT      ((uint16)((uint16)0x0001U << SBC_FS23_M_LIN_TXD_TO_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_M_LIN_SC_M_NOT_INHIBIT      ((uint16)((uint16)0x0000U << SBC_FS23_M_LIN_SC_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_M_LIN_SC_M_INHIBIT          ((uint16)((uint16)0x0001U << SBC_FS23_M_LIN_SC_M_SHIFT))

/* TRX_ON */
#define SBC_FS23_M_LIN_FSM_STATE_S_TRX_ON    ((uint16)((uint16)0x0003U << SBC_FS23_M_LIN_FSM_STATE_S_SHIFT))
/* TRX_RXONLY */
#define SBC_FS23_M_LIN_FSM_STATE_S_TRX_RXONLY ((uint16)((uint16)0x0006U << SBC_FS23_M_LIN_FSM_STATE_S_SHIFT))
/* TRX_PROTECT */
#define SBC_FS23_M_LIN_FSM_STATE_S_TRX_PROTECT ((uint16)((uint16)0x0007U << SBC_FS23_M_LIN_FSM_STATE_S_SHIFT))
/* TRX_DISABLE */
#define SBC_FS23_M_LIN_FSM_STATE_S_TRX_DISABLE ((uint16)((uint16)0x000CU << SBC_FS23_M_LIN_FSM_STATE_S_SHIFT))
/* TRX_POWERON */
#define SBC_FS23_M_LIN_FSM_STATE_S_TRX_POWERON ((uint16)((uint16)0x000FU << SBC_FS23_M_LIN_FSM_STATE_S_SHIFT))
/* TRX_MONITOR */
#define SBC_FS23_M_LIN_FSM_STATE_S_TRX_MONITOR ((uint16)((uint16)0x0013U << SBC_FS23_M_LIN_FSM_STATE_S_SHIFT))
/* TX_POWERON */
#define SBC_FS23_M_LIN_FSM_STATE_S_TX_POWERON ((uint16)((uint16)0x0017U << SBC_FS23_M_LIN_FSM_STATE_S_SHIFT))

/******************************************************************************/
/* M_MEMORY0 - Type: RW                                                       */
/******************************************************************************/

#define SBC_FS23_M_MEMORY0_ADDR              ((uint8)(0x2DU))
#define SBC_FS23_M_MEMORY0_DEFAULT           ((uint16)(0x0000U))

/* Read or write MEMORY0 memory bits */
#define SBC_FS23_M_MEMORY0_MASK              ((uint16)(0xFFFFU))
#define SBC_FS23_M_MEMORY0_SHIFT             ((uint16)(0x0000U))

/******************************************************************************/
/* M_MEMORY1 - Type: RW                                                       */
/******************************************************************************/

#define SBC_FS23_M_MEMORY1_ADDR              ((uint8)(0x2EU))
#define SBC_FS23_M_MEMORY1_DEFAULT           ((uint16)(0x0000U))

/* Read or write MEMORY1 memory bits */
#define SBC_FS23_M_MEMORY1_MASK              ((uint16)(0xFFFFU))
#define SBC_FS23_M_MEMORY1_SHIFT             ((uint16)(0x0000U))

/******************************************************************************/
/* FS_I_OVUV_CFG1 - Type: RW                                                  */
/******************************************************************************/

#define SBC_FS23_FS_I_OVUV_CFG1_ADDR         ((uint8)(0x32U))
#define SBC_FS23_FS_I_OVUV_CFG1_DEFAULT      ((uint16)(0x0D98U))

/* Configure V2MON UV impact on LIMP0 */
#define SBC_FS23_FS_V2MON_UV_LIMP0_IMPACT_MASK ((uint16)(0x0001U))
#define SBC_FS23_FS_V2MON_UV_LIMP0_IMPACT_SHIFT ((uint16)(0x0000U))
/* Configure V2MON UV impact on FS0B */
#define SBC_FS23_FS_V2MON_UV_FS0B_IMPACT_MASK ((uint16)(0x0002U))
#define SBC_FS23_FS_V2MON_UV_FS0B_IMPACT_SHIFT ((uint16)(0x0001U))
/* Configure V2MON UV impact on RSTB */
#define SBC_FS23_FS_V2MON_UV_RSTB_IMPACT_MASK ((uint16)(0x0004U))
#define SBC_FS23_FS_V2MON_UV_RSTB_IMPACT_SHIFT ((uint16)(0x0002U))
/* Configure V2MON OV impact on LIMP0 */
#define SBC_FS23_FS_V2MON_OV_LIMP0_IMPACT_MASK ((uint16)(0x0008U))
#define SBC_FS23_FS_V2MON_OV_LIMP0_IMPACT_SHIFT ((uint16)(0x0003U))
/* Configure V2MON OV impact on FS0B */
#define SBC_FS23_FS_V2MON_OV_FS0B_IMPACT_MASK ((uint16)(0x0010U))
#define SBC_FS23_FS_V2MON_OV_FS0B_IMPACT_SHIFT ((uint16)(0x0004U))
/* Configure V2MON OV impact on RSTB */
#define SBC_FS23_FS_V2MON_OV_RSTB_IMPACT_MASK ((uint16)(0x0020U))
#define SBC_FS23_FS_V2MON_OV_RSTB_IMPACT_SHIFT ((uint16)(0x0005U))
/* Configure V1MON UV impact on LIMP0 */
#define SBC_FS23_FS_V1MON_UV_LIMP0_IMPACT_MASK ((uint16)(0x0080U))
#define SBC_FS23_FS_V1MON_UV_LIMP0_IMPACT_SHIFT ((uint16)(0x0007U))
/* Configure V1MON UV impact on FS0B */
#define SBC_FS23_FS_V1MON_UV_FS0B_IMPACT_MASK ((uint16)(0x0100U))
#define SBC_FS23_FS_V1MON_UV_FS0B_IMPACT_SHIFT ((uint16)(0x0008U))
/* Configure V1MON UV impact on RSTB */
#define SBC_FS23_FS_V1MON_UV_RSTB_IMPACT_MASK ((uint16)(0x0200U))
#define SBC_FS23_FS_V1MON_UV_RSTB_IMPACT_SHIFT ((uint16)(0x0009U))
/* Configure V1MON OV impact on LIMP0 */
#define SBC_FS23_FS_V1MON_OV_LIMP0_IMPACT_MASK ((uint16)(0x0400U))
#define SBC_FS23_FS_V1MON_OV_LIMP0_IMPACT_SHIFT ((uint16)(0x000AU))
/* Configure V1MON OV impact on FS0B */
#define SBC_FS23_FS_V1MON_OV_FS0B_IMPACT_MASK ((uint16)(0x0800U))
#define SBC_FS23_FS_V1MON_OV_FS0B_IMPACT_SHIFT ((uint16)(0x000BU))
/* Configure V1MON OV impact on RSTB */
#define SBC_FS23_FS_V1MON_OV_RSTB_IMPACT_MASK ((uint16)(0x1000U))
#define SBC_FS23_FS_V1MON_OV_RSTB_IMPACT_SHIFT ((uint16)(0x000CU))

/* No Effect */
#define SBC_FS23_FS_V2MON_UV_LIMP0_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V2MON_UV_LIMP0_IMPACT_SHIFT))
/* LIMP0 Assertion */
#define SBC_FS23_FS_V2MON_UV_LIMP0_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V2MON_UV_LIMP0_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V2MON_UV_FS0B_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V2MON_UV_FS0B_IMPACT_SHIFT))
/* FS0B Assertion */
#define SBC_FS23_FS_V2MON_UV_FS0B_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V2MON_UV_FS0B_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V2MON_UV_RSTB_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V2MON_UV_RSTB_IMPACT_SHIFT))
/* RSTB Assertion */
#define SBC_FS23_FS_V2MON_UV_RSTB_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V2MON_UV_RSTB_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V2MON_OV_LIMP0_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V2MON_OV_LIMP0_IMPACT_SHIFT))
/* LIMP0 Assertion */
#define SBC_FS23_FS_V2MON_OV_LIMP0_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V2MON_OV_LIMP0_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V2MON_OV_FS0B_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V2MON_OV_FS0B_IMPACT_SHIFT))
/* FS0B Assertion */
#define SBC_FS23_FS_V2MON_OV_FS0B_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V2MON_OV_FS0B_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V2MON_OV_RSTB_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V2MON_OV_RSTB_IMPACT_SHIFT))
/* RSTB Assertion */
#define SBC_FS23_FS_V2MON_OV_RSTB_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V2MON_OV_RSTB_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V1MON_UV_LIMP0_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V1MON_UV_LIMP0_IMPACT_SHIFT))
/* LIMP0 Assertion */
#define SBC_FS23_FS_V1MON_UV_LIMP0_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V1MON_UV_LIMP0_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V1MON_UV_FS0B_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V1MON_UV_FS0B_IMPACT_SHIFT))
/* FS0B Assertion */
#define SBC_FS23_FS_V1MON_UV_FS0B_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V1MON_UV_FS0B_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V1MON_UV_RSTB_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V1MON_UV_RSTB_IMPACT_SHIFT))
/* RSTB Assertion */
#define SBC_FS23_FS_V1MON_UV_RSTB_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V1MON_UV_RSTB_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V1MON_OV_LIMP0_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V1MON_OV_LIMP0_IMPACT_SHIFT))
/* LIMP0 Assertion */
#define SBC_FS23_FS_V1MON_OV_LIMP0_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V1MON_OV_LIMP0_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V1MON_OV_FS0B_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V1MON_OV_FS0B_IMPACT_SHIFT))
/* FS0B Assertion */
#define SBC_FS23_FS_V1MON_OV_FS0B_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V1MON_OV_FS0B_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V1MON_OV_RSTB_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V1MON_OV_RSTB_IMPACT_SHIFT))
/* RSTB Assertion */
#define SBC_FS23_FS_V1MON_OV_RSTB_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V1MON_OV_RSTB_IMPACT_SHIFT))

/******************************************************************************/
/* FS_I_OVUV_CFG2 - Type: RW                                                  */
/******************************************************************************/

#define SBC_FS23_FS_I_OVUV_CFG2_ADDR         ((uint8)(0x33U))
#define SBC_FS23_FS_I_OVUV_CFG2_DEFAULT      ((uint16)(0x0D98U))

/* Configure V0MON UV impact on LIMP0 */
#define SBC_FS23_FS_V0MON_UV_LIMP0_IMPACT_MASK ((uint16)(0x0001U))
#define SBC_FS23_FS_V0MON_UV_LIMP0_IMPACT_SHIFT ((uint16)(0x0000U))
/* Configure V0MON UV impact on FS0B */
#define SBC_FS23_FS_V0MON_UV_FS0B_IMPACT_MASK ((uint16)(0x0002U))
#define SBC_FS23_FS_V0MON_UV_FS0B_IMPACT_SHIFT ((uint16)(0x0001U))
/* Configure V0MON UV impact on RSTB */
#define SBC_FS23_FS_V0MON_UV_RSTB_IMPACT_MASK ((uint16)(0x0004U))
#define SBC_FS23_FS_V0MON_UV_RSTB_IMPACT_SHIFT ((uint16)(0x0002U))
/* Configure V0MON OV impact on LIMP0 */
#define SBC_FS23_FS_V0MON_OV_LIMP0_IMPACT_MASK ((uint16)(0x0008U))
#define SBC_FS23_FS_V0MON_OV_LIMP0_IMPACT_SHIFT ((uint16)(0x0003U))
/* Configure V0MON OV impact on FS0B */
#define SBC_FS23_FS_V0MON_OV_FS0B_IMPACT_MASK ((uint16)(0x0010U))
#define SBC_FS23_FS_V0MON_OV_FS0B_IMPACT_SHIFT ((uint16)(0x0004U))
/* Configure V0MON OV impact on RSTB */
#define SBC_FS23_FS_V0MON_OV_RSTB_IMPACT_MASK ((uint16)(0x0020U))
#define SBC_FS23_FS_V0MON_OV_RSTB_IMPACT_SHIFT ((uint16)(0x0005U))
/* Configure V3MON UV impact on LIMP0 */
#define SBC_FS23_FS_V3MON_UV_LIMP0_IMPACT_MASK ((uint16)(0x0080U))
#define SBC_FS23_FS_V3MON_UV_LIMP0_IMPACT_SHIFT ((uint16)(0x0007U))
/* Configure V3MON UV impact on FS0B */
#define SBC_FS23_FS_V3MON_UV_FS0B_IMPACT_MASK ((uint16)(0x0100U))
#define SBC_FS23_FS_V3MON_UV_FS0B_IMPACT_SHIFT ((uint16)(0x0008U))
/* Configure V3MON UV impact on RSTB */
#define SBC_FS23_FS_V3MON_UV_RSTB_IMPACT_MASK ((uint16)(0x0200U))
#define SBC_FS23_FS_V3MON_UV_RSTB_IMPACT_SHIFT ((uint16)(0x0009U))
/* Configure V3MON OV impact on LIMP0 */
#define SBC_FS23_FS_V3MON_OV_LIMP0_IMPACT_MASK ((uint16)(0x0400U))
#define SBC_FS23_FS_V3MON_OV_LIMP0_IMPACT_SHIFT ((uint16)(0x000AU))
/* Configure V3MON OV impact on FS0B */
#define SBC_FS23_FS_V3MON_OV_FS0B_IMPACT_MASK ((uint16)(0x0800U))
#define SBC_FS23_FS_V3MON_OV_FS0B_IMPACT_SHIFT ((uint16)(0x000BU))
/* Configure V3MON OV impact on RSTB */
#define SBC_FS23_FS_V3MON_OV_RSTB_IMPACT_MASK ((uint16)(0x1000U))
#define SBC_FS23_FS_V3MON_OV_RSTB_IMPACT_SHIFT ((uint16)(0x000CU))

/* No Effect */
#define SBC_FS23_FS_V0MON_UV_LIMP0_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V0MON_UV_LIMP0_IMPACT_SHIFT))
/* LIMP0 Assertion */
#define SBC_FS23_FS_V0MON_UV_LIMP0_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V0MON_UV_LIMP0_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V0MON_UV_FS0B_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V0MON_UV_FS0B_IMPACT_SHIFT))
/* FS0B Assertion */
#define SBC_FS23_FS_V0MON_UV_FS0B_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V0MON_UV_FS0B_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V0MON_UV_RSTB_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V0MON_UV_RSTB_IMPACT_SHIFT))
/* RSTB Assertion */
#define SBC_FS23_FS_V0MON_UV_RSTB_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V0MON_UV_RSTB_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V0MON_OV_LIMP0_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V0MON_OV_LIMP0_IMPACT_SHIFT))
/* LIMP0 Assertion */
#define SBC_FS23_FS_V0MON_OV_LIMP0_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V0MON_OV_LIMP0_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V0MON_OV_FS0B_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V0MON_OV_FS0B_IMPACT_SHIFT))
/* FS0B Assertion */
#define SBC_FS23_FS_V0MON_OV_FS0B_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V0MON_OV_FS0B_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V0MON_OV_RSTB_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V0MON_OV_RSTB_IMPACT_SHIFT))
/* RSTB Assertion */
#define SBC_FS23_FS_V0MON_OV_RSTB_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V0MON_OV_RSTB_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V3MON_UV_LIMP0_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V3MON_UV_LIMP0_IMPACT_SHIFT))
/* LIMP0 Assertion */
#define SBC_FS23_FS_V3MON_UV_LIMP0_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V3MON_UV_LIMP0_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V3MON_UV_FS0B_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V3MON_UV_FS0B_IMPACT_SHIFT))
/* FS0B Assertion */
#define SBC_FS23_FS_V3MON_UV_FS0B_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V3MON_UV_FS0B_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V3MON_UV_RSTB_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V3MON_UV_RSTB_IMPACT_SHIFT))
/* RSTB Assertion */
#define SBC_FS23_FS_V3MON_UV_RSTB_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V3MON_UV_RSTB_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V3MON_OV_LIMP0_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V3MON_OV_LIMP0_IMPACT_SHIFT))
/* LIMP0 Assertion */
#define SBC_FS23_FS_V3MON_OV_LIMP0_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V3MON_OV_LIMP0_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V3MON_OV_FS0B_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V3MON_OV_FS0B_IMPACT_SHIFT))
/* FS0B Assertion */
#define SBC_FS23_FS_V3MON_OV_FS0B_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V3MON_OV_FS0B_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_V3MON_OV_RSTB_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_V3MON_OV_RSTB_IMPACT_SHIFT))
/* RSTB Assertion */
#define SBC_FS23_FS_V3MON_OV_RSTB_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_V3MON_OV_RSTB_IMPACT_SHIFT))

/******************************************************************************/
/* FS_I_FCCU_CFG - Type: RW                                                   */
/******************************************************************************/

