wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
#define SBC_FS23_FS_I_FCCU_CFG_ADDR          ((uint8)(0x34U))
#define SBC_FS23_FS_I_FCCU_CFG_DEFAULT       ((uint16)(0x103FU))

/* Configure FCCU1 impact on LIMP0 */
#define SBC_FS23_FS_FCCU1_LIMP0_IMPACT_MASK  ((uint16)(0x0001U))
#define SBC_FS23_FS_FCCU1_LIMP0_IMPACT_SHIFT ((uint16)(0x0000U))
/* Configure FCCU1 impact on FS0B */
#define SBC_FS23_FS_FCCU1_FS0B_IMPACT_MASK   ((uint16)(0x0002U))
#define SBC_FS23_FS_FCCU1_FS0B_IMPACT_SHIFT  ((uint16)(0x0001U))
/* Configure FCCU1 impact on RSTB */
#define SBC_FS23_FS_FCCU1_RSTB_IMPACT_MASK   ((uint16)(0x0004U))
#define SBC_FS23_FS_FCCU1_RSTB_IMPACT_SHIFT  ((uint16)(0x0002U))
/* Configure FCCU2 impact on LIMP0 */
#define SBC_FS23_FS_FCCU2_LIMP0_IMPACT_MASK  ((uint16)(0x0008U))
#define SBC_FS23_FS_FCCU2_LIMP0_IMPACT_SHIFT ((uint16)(0x0003U))
/* Configure FCCU2 impact on FS0B */
#define SBC_FS23_FS_FCCU2_FS0B_IMPACT_MASK   ((uint16)(0x0010U))
#define SBC_FS23_FS_FCCU2_FS0B_IMPACT_SHIFT  ((uint16)(0x0004U))
/* Configure FCCU2 impact on RSTB */
#define SBC_FS23_FS_FCCU2_RSTB_IMPACT_MASK   ((uint16)(0x0020U))
#define SBC_FS23_FS_FCCU2_RSTB_IMPACT_SHIFT  ((uint16)(0x0005U))
/* Configure FCCU1 Fault Polarity */
#define SBC_FS23_FS_FCCU1_FLT_POL_MASK       ((uint16)(0x0040U))
#define SBC_FS23_FS_FCCU1_FLT_POL_SHIFT      ((uint16)(0x0006U))
/* Configure FCCU2 Fault Polarity */
#define SBC_FS23_FS_FCCU2_FLT_POL_MASK       ((uint16)(0x0080U))
#define SBC_FS23_FS_FCCU2_FLT_POL_SHIFT      ((uint16)(0x0007U))
/* Configure FCCU12 Fault Polarity */
#define SBC_FS23_FS_FCCU12_FLT_POL_MASK      ((uint16)(0x0100U))
#define SBC_FS23_FS_FCCU12_FLT_POL_SHIFT     ((uint16)(0x0008U))
/* Assign FCCU2 function to an input pin */
#define SBC_FS23_FS_FCCU2_ASSIGN_MASK        ((uint16)(0x0E00U))
#define SBC_FS23_FS_FCCU2_ASSIGN_SHIFT       ((uint16)(0x0009U))
/* Configure FCCU Monitoring */
#define SBC_FS23_FS_FCCU_CFG_MASK            ((uint16)(0x7000U))
#define SBC_FS23_FS_FCCU_CFG_SHIFT           ((uint16)(0x000CU))

/* No Effect */
#define SBC_FS23_FS_FCCU1_LIMP0_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU1_LIMP0_IMPACT_SHIFT))
/* LIMP0 Assertion */
#define SBC_FS23_FS_FCCU1_LIMP0_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU1_LIMP0_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_FCCU1_FS0B_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU1_FS0B_IMPACT_SHIFT))
/* FS0B Assertion */
#define SBC_FS23_FS_FCCU1_FS0B_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU1_FS0B_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_FCCU1_RSTB_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU1_RSTB_IMPACT_SHIFT))
/* RSTB Assertion */
#define SBC_FS23_FS_FCCU1_RSTB_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU1_RSTB_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_FCCU2_LIMP0_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU2_LIMP0_IMPACT_SHIFT))
/* LIMP0 Assertion */
#define SBC_FS23_FS_FCCU2_LIMP0_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU2_LIMP0_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_FCCU2_FS0B_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU2_FS0B_IMPACT_SHIFT))
/* FS0B Assertion */
#define SBC_FS23_FS_FCCU2_FS0B_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU2_FS0B_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_FCCU2_RSTB_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU2_RSTB_IMPACT_SHIFT))
/* RSTB Assertion */
#define SBC_FS23_FS_FCCU2_RSTB_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU2_RSTB_IMPACT_SHIFT))

/* Low Level is a Fault */
#define SBC_FS23_FS_FCCU1_FLT_POL_LOW        ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU1_FLT_POL_SHIFT))
/* High Level is a Fault */
#define SBC_FS23_FS_FCCU1_FLT_POL_HIGH       ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU1_FLT_POL_SHIFT))

/* Low Level is a Fault */
#define SBC_FS23_FS_FCCU2_FLT_POL_LOW        ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU2_FLT_POL_SHIFT))
/* High Level is a Fault */
#define SBC_FS23_FS_FCCU2_FLT_POL_HIGH       ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU2_FLT_POL_SHIFT))

/* FCCU1=0 or FCCU2=1 level is a fault */
#define SBC_FS23_FS_FCCU12_FLT_POL_01        ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU12_FLT_POL_SHIFT))
/* FCCU1=1 or FCCU2=0 level is a fault */
#define SBC_FS23_FS_FCCU12_FLT_POL_10        ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU12_FLT_POL_SHIFT))

/* FCCU2 is disabled */
#define SBC_FS23_FS_FCCU2_ASSIGN_DISABLED    ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU2_ASSIGN_SHIFT))
/* FCCU2 is assigned to HVIO1 */
#define SBC_FS23_FS_FCCU2_ASSIGN_HVIO1       ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU2_ASSIGN_SHIFT))
/* FCCU2 is assigned to HVIO2 */
#define SBC_FS23_FS_FCCU2_ASSIGN_HVIO2       ((uint16)((uint16)0x0002U << SBC_FS23_FS_FCCU2_ASSIGN_SHIFT))
/* FCCU2 is assigned to LVIO3 */
#define SBC_FS23_FS_FCCU2_ASSIGN_LVIO3       ((uint16)((uint16)0x0003U << SBC_FS23_FS_FCCU2_ASSIGN_SHIFT))
/* FCCU2 is assigned to LVIO4 */
#define SBC_FS23_FS_FCCU2_ASSIGN_LVIO4       ((uint16)((uint16)0x0004U << SBC_FS23_FS_FCCU2_ASSIGN_SHIFT))
/* FCCU2 is assigned to LVI5 */
#define SBC_FS23_FS_FCCU2_ASSIGN_LVI5        ((uint16)((uint16)0x0005U << SBC_FS23_FS_FCCU2_ASSIGN_SHIFT))

/* No monitoring */
#define SBC_FS23_FS_FCCU_CFG_DISABLED        ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU_CFG_SHIFT))
/* FCCU1 and FCCU2 inputs monitoring activated by pair (bi-stable protocol) */
#define SBC_FS23_FS_FCCU_CFG_PAIR            ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU_CFG_SHIFT))
/* FCCU1 or FCCU2 single input monitoring activated */
#define SBC_FS23_FS_FCCU_CFG_SINGLE          ((uint16)((uint16)0x0002U << SBC_FS23_FS_FCCU_CFG_SHIFT))
/* FCCU1 input monitoring only, FCCU2 input not used */
#define SBC_FS23_FS_FCCU_CFG_FCCU1_ONLY      ((uint16)((uint16)0x0003U << SBC_FS23_FS_FCCU_CFG_SHIFT))
/* FCCU2 input monitoring only, FCCU1 input not used */
#define SBC_FS23_FS_FCCU_CFG_FCCU2_ONLY      ((uint16)((uint16)0x0004U << SBC_FS23_FS_FCCU_CFG_SHIFT))
/* FCCU1 or FCCU2 single input PWM monitoring activated */
#define SBC_FS23_FS_FCCU_CFG_SINGLE_PWM      ((uint16)((uint16)0x0005U << SBC_FS23_FS_FCCU_CFG_SHIFT))
/* FCCU1 input PWM monitoring only, FCCU2 input level monitoring */
#define SBC_FS23_FS_FCCU_CFG_FCCU1_PWM       ((uint16)((uint16)0x0006U << SBC_FS23_FS_FCCU_CFG_SHIFT))
/* FCCU2 input PWM monitoring only, FCCU1 input level monitoring */
#define SBC_FS23_FS_FCCU_CFG_FCCU2_PWM       ((uint16)((uint16)0x0007U << SBC_FS23_FS_FCCU_CFG_SHIFT))

/******************************************************************************/
/* FS_I_FSSM_CFG - Type: RW                                                   */
/******************************************************************************/

#define SBC_FS23_FS_I_FSSM_CFG_ADDR          ((uint8)(0x36U))
#define SBC_FS23_FS_I_FSSM_CFG_DEFAULT       ((uint16)(0x0AF1U))

