wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* Reflect the value of the Fault Error Counter */
#define SBC_FS23_FS_FLT_ERR_CNT_MASK         ((uint16)(0x000FU))
#define SBC_FS23_FS_FLT_ERR_CNT_SHIFT        ((uint16)(0x0000U))
/* Configure LIMP0 reaction when external reset is detected Fault Error Counter >= intermediate value */
#define SBC_FS23_FS_FLT_MID_LIMP0_IMPACT_MASK ((uint16)(0x0010U))
#define SBC_FS23_FS_FLT_MID_LIMP0_IMPACT_SHIFT ((uint16)(0x0004U))
/* Configure FS0B reaction when external reset is detected Fault Error Counter >= intermediate value */
#define SBC_FS23_FS_FLT_MID_FS0B_IMPACT_MASK ((uint16)(0x0020U))
#define SBC_FS23_FS_FLT_MID_FS0B_IMPACT_SHIFT ((uint16)(0x0005U))
/* Configure RSTB reaction when external reset is detected Fault Error Counter >= intermediate value */
#define SBC_FS23_FS_FLT_MID_RSTB_IMPACT_MASK ((uint16)(0x0040U))
#define SBC_FS23_FS_FLT_MID_RSTB_IMPACT_SHIFT ((uint16)(0x0006U))
/* Configure the Fault Error Counter max value */
#define SBC_FS23_FS_FLT_ERR_LIMIT_MASK       ((uint16)(0x0180U))
#define SBC_FS23_FS_FLT_ERR_LIMIT_SHIFT      ((uint16)(0x0007U))
/* Configure RSTB reaction when FS0B is detected shorted to high */
#define SBC_FS23_FS_FS0B_SC_RSTB_IMPACT_MASK ((uint16)(0x0200U))
#define SBC_FS23_FS_FS0B_SC_RSTB_IMPACT_SHIFT ((uint16)(0x0009U))
/* Configure FS0B reaction when external reset is detected */
#define SBC_FS23_FS_EXTRSTB_FS0B_IMPACT_MASK ((uint16)(0x0400U))
#define SBC_FS23_FS_EXTRSTB_FS0B_IMPACT_SHIFT ((uint16)(0x000AU))
/* Configure RSTB reaction when LIMP0 is detected shorted to high */
#define SBC_FS23_FS_LIMP0_SC_RSTB_IMPACT_MASK ((uint16)(0x0800U))
#define SBC_FS23_FS_LIMP0_SC_RSTB_IMPACT_SHIFT ((uint16)(0x000BU))
/* Configure RSTB pulse duration */
#define SBC_FS23_FS_RSTB_DUR_MASK            ((uint16)(0x1000U))
#define SBC_FS23_FS_RSTB_DUR_SHIFT           ((uint16)(0x000CU))
/* Disable the RSTB low 8s timer */
#define SBC_FS23_FS_RSTB8S_DIS_MASK          ((uint16)(0x2000U))
#define SBC_FS23_FS_RSTB8S_DIS_SHIFT         ((uint16)(0x000DU))
/* Disable the external RSTB monitoring in Normal mode (except RSTB8s time out) */
#define SBC_FS23_FS_EXT_RSTB_DIS_MASK        ((uint16)(0x4000U))
#define SBC_FS23_FS_EXT_RSTB_DIS_SHIFT       ((uint16)(0x000EU))

/* 0 */
#define SBC_FS23_FS_FLT_ERR_CNT_0            ((uint16)((uint16)0x0000U << SBC_FS23_FS_FLT_ERR_CNT_SHIFT))
/* 1 */
#define SBC_FS23_FS_FLT_ERR_CNT_1            ((uint16)((uint16)0x0001U << SBC_FS23_FS_FLT_ERR_CNT_SHIFT))
/* 2 */
#define SBC_FS23_FS_FLT_ERR_CNT_2            ((uint16)((uint16)0x0002U << SBC_FS23_FS_FLT_ERR_CNT_SHIFT))
/* 3 */
#define SBC_FS23_FS_FLT_ERR_CNT_3            ((uint16)((uint16)0x0003U << SBC_FS23_FS_FLT_ERR_CNT_SHIFT))
/* 4 */
#define SBC_FS23_FS_FLT_ERR_CNT_4            ((uint16)((uint16)0x0004U << SBC_FS23_FS_FLT_ERR_CNT_SHIFT))
/* 5 */
#define SBC_FS23_FS_FLT_ERR_CNT_5            ((uint16)((uint16)0x0005U << SBC_FS23_FS_FLT_ERR_CNT_SHIFT))
/* 6 */
#define SBC_FS23_FS_FLT_ERR_CNT_6            ((uint16)((uint16)0x0006U << SBC_FS23_FS_FLT_ERR_CNT_SHIFT))
/* 7 */
#define SBC_FS23_FS_FLT_ERR_CNT_7            ((uint16)((uint16)0x0007U << SBC_FS23_FS_FLT_ERR_CNT_SHIFT))
/* 8 */
#define SBC_FS23_FS_FLT_ERR_CNT_8            ((uint16)((uint16)0x0008U << SBC_FS23_FS_FLT_ERR_CNT_SHIFT))
/* 9 */
#define SBC_FS23_FS_FLT_ERR_CNT_9            ((uint16)((uint16)0x0009U << SBC_FS23_FS_FLT_ERR_CNT_SHIFT))
/* 10 */
#define SBC_FS23_FS_FLT_ERR_CNT_10           ((uint16)((uint16)0x000AU << SBC_FS23_FS_FLT_ERR_CNT_SHIFT))
/* 11 */
#define SBC_FS23_FS_FLT_ERR_CNT_11           ((uint16)((uint16)0x000BU << SBC_FS23_FS_FLT_ERR_CNT_SHIFT))
/* 12 */
#define SBC_FS23_FS_FLT_ERR_CNT_12           ((uint16)((uint16)0x000CU << SBC_FS23_FS_FLT_ERR_CNT_SHIFT))

/* No action */
#define SBC_FS23_FS_FLT_MID_LIMP0_IMPACT_NO_ACTION ((uint16)((uint16)0x0000U << SBC_FS23_FS_FLT_MID_LIMP0_IMPACT_SHIFT))
/* LIMP0 assertion */
#define SBC_FS23_FS_FLT_MID_LIMP0_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_FLT_MID_LIMP0_IMPACT_SHIFT))

/* No action */
#define SBC_FS23_FS_FLT_MID_FS0B_IMPACT_NO_ACTION ((uint16)((uint16)0x0000U << SBC_FS23_FS_FLT_MID_FS0B_IMPACT_SHIFT))
/* FS0B assertion */
#define SBC_FS23_FS_FLT_MID_FS0B_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_FLT_MID_FS0B_IMPACT_SHIFT))

/* No action */
#define SBC_FS23_FS_FLT_MID_RSTB_IMPACT_NO_ACTION ((uint16)((uint16)0x0000U << SBC_FS23_FS_FLT_MID_RSTB_IMPACT_SHIFT))
/* RSTB assertion */
#define SBC_FS23_FS_FLT_MID_RSTB_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_FLT_MID_RSTB_IMPACT_SHIFT))

/* Max Value = 2 */
#define SBC_FS23_FS_FLT_ERR_LIMIT_2          ((uint16)((uint16)0x0000U << SBC_FS23_FS_FLT_ERR_LIMIT_SHIFT))
/* Max Value = 6 */
#define SBC_FS23_FS_FLT_ERR_LIMIT_6          ((uint16)((uint16)0x0001U << SBC_FS23_FS_FLT_ERR_LIMIT_SHIFT))
/* Max Value = 8 */
#define SBC_FS23_FS_FLT_ERR_LIMIT_8          ((uint16)((uint16)0x0002U << SBC_FS23_FS_FLT_ERR_LIMIT_SHIFT))
/* Max Value = 12 */
#define SBC_FS23_FS_FLT_ERR_LIMIT_12         ((uint16)((uint16)0x0003U << SBC_FS23_FS_FLT_ERR_LIMIT_SHIFT))

/* No action */
#define SBC_FS23_FS_FS0B_SC_RSTB_IMPACT_NO_ACTION ((uint16)((uint16)0x0000U << SBC_FS23_FS_FS0B_SC_RSTB_IMPACT_SHIFT))
/* RSTB assertion */
#define SBC_FS23_FS_FS0B_SC_RSTB_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_FS0B_SC_RSTB_IMPACT_SHIFT))

/* No action */
#define SBC_FS23_FS_EXTRSTB_FS0B_IMPACT_NO_ACTION ((uint16)((uint16)0x0000U << SBC_FS23_FS_EXTRSTB_FS0B_IMPACT_SHIFT))
/* FS0B assertion */
#define SBC_FS23_FS_EXTRSTB_FS0B_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_EXTRSTB_FS0B_IMPACT_SHIFT))

/* No action */
#define SBC_FS23_FS_LIMP0_SC_RSTB_IMPACT_NO_ACTION ((uint16)((uint16)0x0000U << SBC_FS23_FS_LIMP0_SC_RSTB_IMPACT_SHIFT))
/* RSTB assertion */
#define SBC_FS23_FS_LIMP0_SC_RSTB_IMPACT_ASSERT ((uint16)((uint16)0x0001U << SBC_FS23_FS_LIMP0_SC_RSTB_IMPACT_SHIFT))

/* 10 ms */
#define SBC_FS23_FS_RSTB_DUR_10MS            ((uint16)((uint16)0x0000U << SBC_FS23_FS_RSTB_DUR_SHIFT))
/* 1 ms */
#define SBC_FS23_FS_RSTB_DUR_1MS             ((uint16)((uint16)0x0001U << SBC_FS23_FS_RSTB_DUR_SHIFT))

/* RSTB low 8s timer is enabled */
#define SBC_FS23_FS_RSTB8S_ENABLED           ((uint16)((uint16)0x0000U << SBC_FS23_FS_RSTB8S_DIS_SHIFT))
/* RSTB low 8s time is disabled */
#define SBC_FS23_FS_RSTB8S_DISABLED          ((uint16)((uint16)0x0001U << SBC_FS23_FS_RSTB8S_DIS_SHIFT))

/* External RSTB monitoring is enabled */
#define SBC_FS23_FS_EXT_RSTB_MON_ENABLED     ((uint16)((uint16)0x0000U << SBC_FS23_FS_EXT_RSTB_DIS_SHIFT))
/* External RSTB monitoring is disabled */
#define SBC_FS23_FS_EXT_RSTB_MON_DISABLED    ((uint16)((uint16)0x0001U << SBC_FS23_FS_EXT_RSTB_DIS_SHIFT))

/******************************************************************************/
/* FS_I_WD_CFG - Type: RW                                                     */
/******************************************************************************/

#define SBC_FS23_FS_I_WD_CFG_ADDR            ((uint8)(0x37U))
#define SBC_FS23_FS_I_WD_CFG_DEFAULT         ((uint16)(0x7080U))

/* Reflect the value of the Watchdog Error Counter */
#define SBC_FS23_FS_WD_ERR_CNT_MASK          ((uint16)(0x000FU))
#define SBC_FS23_FS_WD_ERR_CNT_SHIFT         ((uint16)(0x0000U))
/* Reflect the value of the Watchdog Refresh Counter */
#define SBC_FS23_FS_WD_RFR_CNT_MASK          ((uint16)(0x0070U))
#define SBC_FS23_FS_WD_RFR_CNT_SHIFT         ((uint16)(0x0004U))
/* Configure the Watchdog Error Counter Limit */
#define SBC_FS23_FS_WD_ERR_LIMIT_MASK        ((uint16)(0x0180U))
#define SBC_FS23_FS_WD_ERR_LIMIT_SHIFT       ((uint16)(0x0007U))
/* Configure the Watchdog Refresh Counter Limit */
#define SBC_FS23_FS_WD_RFR_LIMIT_MASK        ((uint16)(0x0600U))
#define SBC_FS23_FS_WD_RFR_LIMIT_SHIFT       ((uint16)(0x0009U))
/* Automatically disable the Watchdog in LPON mode (when GO2LPON) */
#define SBC_FS23_FS_WD_DIS_LPON_MASK         ((uint16)(0x0800U))
#define SBC_FS23_FS_WD_DIS_LPON_SHIFT        ((uint16)(0x000BU))
/* Configure Watchdog error impact on LIMP0 */
#define SBC_FS23_FS_WD_LIMP0_IMPACT_MASK     ((uint16)(0x1000U))
#define SBC_FS23_FS_WD_LIMP0_IMPACT_SHIFT    ((uint16)(0x000CU))
/* Configure Watchdog error impact on FS0B */
#define SBC_FS23_FS_WD_FS0B_IMPACT_MASK      ((uint16)(0x2000U))
#define SBC_FS23_FS_WD_FS0B_IMPACT_SHIFT     ((uint16)(0x000DU))
/* Configure Watchdog error impact on RSTB */
#define SBC_FS23_FS_WD_RSTB_IMPACT_MASK      ((uint16)(0x4000U))
#define SBC_FS23_FS_WD_RSTB_IMPACT_SHIFT     ((uint16)(0x000EU))

/* 0 */
#define SBC_FS23_FS_WD_ERR_CNT_0             ((uint16)((uint16)0x0000U << SBC_FS23_FS_WD_ERR_CNT_SHIFT))
/* 1 */
#define SBC_FS23_FS_WD_ERR_CNT_1             ((uint16)((uint16)0x0001U << SBC_FS23_FS_WD_ERR_CNT_SHIFT))
/* 2 */
#define SBC_FS23_FS_WD_ERR_CNT_2             ((uint16)((uint16)0x0002U << SBC_FS23_FS_WD_ERR_CNT_SHIFT))
/* 3 */
#define SBC_FS23_FS_WD_ERR_CNT_3             ((uint16)((uint16)0x0003U << SBC_FS23_FS_WD_ERR_CNT_SHIFT))
/* 4 */
#define SBC_FS23_FS_WD_ERR_CNT_4             ((uint16)((uint16)0x0004U << SBC_FS23_FS_WD_ERR_CNT_SHIFT))
/* 5 */
#define SBC_FS23_FS_WD_ERR_CNT_5             ((uint16)((uint16)0x0005U << SBC_FS23_FS_WD_ERR_CNT_SHIFT))
/* 6 */
#define SBC_FS23_FS_WD_ERR_CNT_6             ((uint16)((uint16)0x0006U << SBC_FS23_FS_WD_ERR_CNT_SHIFT))
/* 7 */
#define SBC_FS23_FS_WD_ERR_CNT_7             ((uint16)((uint16)0x0007U << SBC_FS23_FS_WD_ERR_CNT_SHIFT))
/* 8 */
#define SBC_FS23_FS_WD_ERR_CNT_8             ((uint16)((uint16)0x0008U << SBC_FS23_FS_WD_ERR_CNT_SHIFT))

/* 0 */
#define SBC_FS23_FS_WD_RFR_CNT_0             ((uint16)((uint16)0x0000U << SBC_FS23_FS_WD_RFR_CNT_SHIFT))
/* 1 */
#define SBC_FS23_FS_WD_RFR_CNT_1             ((uint16)((uint16)0x0001U << SBC_FS23_FS_WD_RFR_CNT_SHIFT))
/* 2 */
#define SBC_FS23_FS_WD_RFR_CNT_2             ((uint16)((uint16)0x0002U << SBC_FS23_FS_WD_RFR_CNT_SHIFT))
/* 3 */
#define SBC_FS23_FS_WD_RFR_CNT_3             ((uint16)((uint16)0x0003U << SBC_FS23_FS_WD_RFR_CNT_SHIFT))
/* 4 */
#define SBC_FS23_FS_WD_RFR_CNT_4             ((uint16)((uint16)0x0004U << SBC_FS23_FS_WD_RFR_CNT_SHIFT))
/* 5 */
#define SBC_FS23_FS_WD_RFR_CNT_5             ((uint16)((uint16)0x0005U << SBC_FS23_FS_WD_RFR_CNT_SHIFT))
/* 6 */
#define SBC_FS23_FS_WD_RFR_CNT_6             ((uint16)((uint16)0x0006U << SBC_FS23_FS_WD_RFR_CNT_SHIFT))

