wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* 8 */
#define SBC_FS23_FS_WD_ERR_LIMIT_8           ((uint16)((uint16)0x0000U << SBC_FS23_FS_WD_ERR_LIMIT_SHIFT))
/* 6 */
#define SBC_FS23_FS_WD_ERR_LIMIT_6           ((uint16)((uint16)0x0001U << SBC_FS23_FS_WD_ERR_LIMIT_SHIFT))
/* 4 */
#define SBC_FS23_FS_WD_ERR_LIMIT_4           ((uint16)((uint16)0x0002U << SBC_FS23_FS_WD_ERR_LIMIT_SHIFT))
/* 2 */
#define SBC_FS23_FS_WD_ERR_LIMIT_2           ((uint16)((uint16)0x0003U << SBC_FS23_FS_WD_ERR_LIMIT_SHIFT))

/* 6 */
#define SBC_FS23_FS_WD_RFR_LIMIT_6           ((uint16)((uint16)0x0000U << SBC_FS23_FS_WD_RFR_LIMIT_SHIFT))
/* 4 */
#define SBC_FS23_FS_WD_RFR_LIMIT_4           ((uint16)((uint16)0x0001U << SBC_FS23_FS_WD_RFR_LIMIT_SHIFT))
/* 2 */
#define SBC_FS23_FS_WD_RFR_LIMIT_2           ((uint16)((uint16)0x0002U << SBC_FS23_FS_WD_RFR_LIMIT_SHIFT))
/* 1 */
#define SBC_FS23_FS_WD_RFR_LIMIT_1           ((uint16)((uint16)0x0003U << SBC_FS23_FS_WD_RFR_LIMIT_SHIFT))

/* WD stays enabled in LPON */
#define SBC_FS23_FS_WD_DIS_LPON_NO_ACTION    ((uint16)((uint16)0x0000U << SBC_FS23_FS_WD_DIS_LPON_SHIFT))
/* WD is disabled in LPON */
#define SBC_FS23_FS_WD_DIS_LPON_DISABLE      ((uint16)((uint16)0x0001U << SBC_FS23_FS_WD_DIS_LPON_SHIFT))

/* No action */
#define SBC_FS23_FS_WD_LIMP0_IMPACT_NO_ACTION ((uint16)((uint16)0x0000U << SBC_FS23_FS_WD_LIMP0_IMPACT_SHIFT))
/* LIMP0 assertion */
#define SBC_FS23_FS_WD_LIMP0_IMPACT_ASSERT   ((uint16)((uint16)0x0001U << SBC_FS23_FS_WD_LIMP0_IMPACT_SHIFT))

/* No action */
#define SBC_FS23_FS_WD_FS0B_IMPACT_NO_ACTION ((uint16)((uint16)0x0000U << SBC_FS23_FS_WD_FS0B_IMPACT_SHIFT))
/* FS0B assertion */
#define SBC_FS23_FS_WD_FS0B_IMPACT_ASSERT    ((uint16)((uint16)0x0001U << SBC_FS23_FS_WD_FS0B_IMPACT_SHIFT))

/* No action */
#define SBC_FS23_FS_WD_RSTB_IMPACT_NO_ACTION ((uint16)((uint16)0x0000U << SBC_FS23_FS_WD_RSTB_IMPACT_SHIFT))
/* RSTB assertion */
#define SBC_FS23_FS_WD_RSTB_IMPACT_ASSERT    ((uint16)((uint16)0x0001U << SBC_FS23_FS_WD_RSTB_IMPACT_SHIFT))

/******************************************************************************/
/* FS_WDW_CFG - Type: RW                                                      */
/******************************************************************************/

#define SBC_FS23_FS_WDW_CFG_ADDR             ((uint8)(0x38U))
#define SBC_FS23_FS_WDW_CFG_DEFAULT          ((uint16)(0x01ABU))

/* Configure the Watchdog Window Recovery period */
#define SBC_FS23_FS_WDW_RECOVERY_MASK        ((uint16)(0x000FU))
#define SBC_FS23_FS_WDW_RECOVERY_SHIFT       ((uint16)(0x0000U))
/* Configure the Watchdog Window period */
#define SBC_FS23_FS_WDW_PERIOD_MASK          ((uint16)(0x01E0U))
#define SBC_FS23_FS_WDW_PERIOD_SHIFT         ((uint16)(0x0005U))
/* Enable the Watchdog Window */
#define SBC_FS23_FS_WDW_EN_MASK              ((uint16)(0x0400U))
#define SBC_FS23_FS_WDW_EN_SHIFT             ((uint16)(0x000AU))
/* Enable the Watchdog Recovery when FCCU fault is detected */
#define SBC_FS23_FS_WDW_REC_EN_MASK          ((uint16)(0x0800U))
#define SBC_FS23_FS_WDW_REC_EN_SHIFT         ((uint16)(0x000BU))

/* INFINITE Time Out, Window fully opened */
#define SBC_FS23_FS_WDW_INFINITE             ((uint16)0x0000U)
#define SBC_FS23_FS_WDW_PERIOD_INFINITE      ((uint16)(SBC_FS23_FS_WDW_INFINITE << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_INFINITE    ((uint16)(SBC_FS23_FS_WDW_INFINITE << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* 1 ms */
#define SBC_FS23_FS_WDW_1MS                  ((uint16)0x0001U)
#define SBC_FS23_FS_WDW_PERIOD_1MS           ((uint16)(SBC_FS23_FS_WDW_1MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_1MS         ((uint16)(SBC_FS23_FS_WDW_1MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* 2 ms */
#define SBC_FS23_FS_WDW_2MS                  ((uint16)0x0002U)
#define SBC_FS23_FS_WDW_PERIOD_2MS           ((uint16)(SBC_FS23_FS_WDW_2MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_2MS         ((uint16)(SBC_FS23_FS_WDW_2MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* 3 ms */
#define SBC_FS23_FS_WDW_3MS                  ((uint16)0x0003U)
#define SBC_FS23_FS_WDW_PERIOD_3MS           ((uint16)(SBC_FS23_FS_WDW_3MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_3MS         ((uint16)(SBC_FS23_FS_WDW_3MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* 4 ms */
#define SBC_FS23_FS_WDW_4MS                  ((uint16)0x0004U)
#define SBC_FS23_FS_WDW_PERIOD_4MS           ((uint16)(SBC_FS23_FS_WDW_4MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_4MS         ((uint16)(SBC_FS23_FS_WDW_4MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* 6 ms */
#define SBC_FS23_FS_WDW_6MS                  ((uint16)0x0005U)
#define SBC_FS23_FS_WDW_PERIOD_6MS           ((uint16)(SBC_FS23_FS_WDW_6MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_6MS         ((uint16)(SBC_FS23_FS_WDW_6MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* 8 ms */
#define SBC_FS23_FS_WDW_8MS                  ((uint16)0x0006U)
#define SBC_FS23_FS_WDW_PERIOD_8MS           ((uint16)(SBC_FS23_FS_WDW_8MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_8MS         ((uint16)(SBC_FS23_FS_WDW_8MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* 12 ms */
#define SBC_FS23_FS_WDW_12MS                 ((uint16)0x0007U)
#define SBC_FS23_FS_WDW_PERIOD_12MS          ((uint16)(SBC_FS23_FS_WDW_12MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_12MS        ((uint16)(SBC_FS23_FS_WDW_12MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* 16 ms */
#define SBC_FS23_FS_WDW_16MS                 ((uint16)0x0008U)
#define SBC_FS23_FS_WDW_PERIOD_16MS          ((uint16)(SBC_FS23_FS_WDW_16MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_16MS        ((uint16)(SBC_FS23_FS_WDW_16MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* 24 ms */
#define SBC_FS23_FS_WDW_24MS                 ((uint16)0x0009U)
#define SBC_FS23_FS_WDW_PERIOD_24MS          ((uint16)(SBC_FS23_FS_WDW_24MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_24MS        ((uint16)(SBC_FS23_FS_WDW_24MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* 32 ms */
#define SBC_FS23_FS_WDW_32MS                 ((uint16)0x000AU)
#define SBC_FS23_FS_WDW_PERIOD_32MS          ((uint16)(SBC_FS23_FS_WDW_32MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_32MS        ((uint16)(SBC_FS23_FS_WDW_32MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* 64 ms */
#define SBC_FS23_FS_WDW_64MS                 ((uint16)0x000BU)
#define SBC_FS23_FS_WDW_PERIOD_64MS          ((uint16)(SBC_FS23_FS_WDW_64MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_64MS        ((uint16)(SBC_FS23_FS_WDW_64MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

