wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* 128 ms */
#define SBC_FS23_FS_WDW_128MS                ((uint16)0x000CU)
#define SBC_FS23_FS_WDW_PERIOD_128MS         ((uint16)(SBC_FS23_FS_WDW_128MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_128MS       ((uint16)(SBC_FS23_FS_WDW_128MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* 256 ms */
#define SBC_FS23_FS_WDW_256MS                ((uint16)0x000DU)
#define SBC_FS23_FS_WDW_PERIOD_256MS         ((uint16)(SBC_FS23_FS_WDW_256MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_256MS       ((uint16)(SBC_FS23_FS_WDW_256MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* 512 ms */
#define SBC_FS23_FS_WDW_512MS                ((uint16)0x000EU)
#define SBC_FS23_FS_WDW_PERIOD_512MS         ((uint16)(SBC_FS23_FS_WDW_512MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_512MS       ((uint16)(SBC_FS23_FS_WDW_512MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* 1024 ms */
#define SBC_FS23_FS_WDW_1024MS               ((uint16)0x000FU)
#define SBC_FS23_FS_WDW_PERIOD_1024MS        ((uint16)(SBC_FS23_FS_WDW_1024MS << SBC_FS23_FS_WDW_PERIOD_SHIFT))
#define SBC_FS23_FS_WDW_RECOVERY_1024MS      ((uint16)(SBC_FS23_FS_WDW_1024MS << SBC_FS23_FS_WDW_RECOVERY_SHIFT))

/* Watchdog Window is disabled (Watchdog Time out) */
#define SBC_FS23_FS_WDW_EN_DISABLED          ((uint16)((uint16)0x0000U << SBC_FS23_FS_WDW_EN_SHIFT))
/* Watchdog Window is enabled (Watchdog Window 50%) */
#define SBC_FS23_FS_WDW_EN_ENABLED           ((uint16)((uint16)0x0001U << SBC_FS23_FS_WDW_EN_SHIFT))

/* Watchdog recovery is disabled */
#define SBC_FS23_FS_WDW_REC_EN_DISABLED      ((uint16)((uint16)0x0000U << SBC_FS23_FS_WDW_REC_EN_SHIFT))
/* Watchdog recovery is enabled */
#define SBC_FS23_FS_WDW_REC_EN_ENABLED       ((uint16)((uint16)0x0001U << SBC_FS23_FS_WDW_REC_EN_SHIFT))

/******************************************************************************/
/* FS_WD_TOKEN - Type: RW                                                     */
/******************************************************************************/

#define SBC_FS23_FS_WD_TOKEN_ADDR            ((uint8)(0x39U))
#define SBC_FS23_FS_WD_TOKEN_DEFAULT         ((uint16)(0x5AB2U))

/* Watchdog Token code */
#define SBC_FS23_FS_WD_TOKEN_MASK            ((uint16)(0xFFFFU))
#define SBC_FS23_FS_WD_TOKEN_SHIFT           ((uint16)(0x0000U))

/******************************************************************************/
/* FS_WD_ANSWER - Type: RW                                                    */
/******************************************************************************/

#define SBC_FS23_FS_WD_ANSWER_ADDR           ((uint8)(0x3AU))
#define SBC_FS23_FS_WD_ANSWER_DEFAULT        ((uint16)(0x0000U))

/* Watchdog Answer */
#define SBC_FS23_FS_WD_ANSWER_MASK           ((uint16)(0xFFFFU))
#define SBC_FS23_FS_WD_ANSWER_SHIFT          ((uint16)(0x0000U))

/******************************************************************************/
/* FS_LIMP12_CFG - Type: RW                                                   */
/******************************************************************************/

#define SBC_FS23_FS_LIMP12_CFG_ADDR          ((uint8)(0x3BU))
#define SBC_FS23_FS_LIMP12_CFG_DEFAULT       ((uint16)(0x0000U))

/* Request an assertion of LIMP1 */
#define SBC_FS23_FS_LIMP1_REQ_MASK           ((uint16)(0x0001U))
#define SBC_FS23_FS_LIMP1_REQ_SHIFT          ((uint16)(0x0000U))
/* Select LIMP1 polarity or PWM frequency */
#define SBC_FS23_FS_LIMP1_CFG_MASK           ((uint16)(0x0006U))
#define SBC_FS23_FS_LIMP1_CFG_SHIFT          ((uint16)(0x0001U))
/* Request an assertion of LIMP2 */
#define SBC_FS23_FS_LIMP2_REQ_MASK           ((uint16)(0x0010U))
#define SBC_FS23_FS_LIMP2_REQ_SHIFT          ((uint16)(0x0004U))
/* Select LIMP2 polarity or PWM frequency */
#define SBC_FS23_FS_LIMP2_CFG_MASK           ((uint16)(0x0060U))
#define SBC_FS23_FS_LIMP2_CFG_SHIFT          ((uint16)(0x0005U))
/* Select LIMP2 PWM duty cycle */
#define SBC_FS23_FS_LIMP2_DC_CFG_MASK        ((uint16)(0x0180U))
#define SBC_FS23_FS_LIMP2_DC_CFG_SHIFT       ((uint16)(0x0007U))

/* No action */
#define SBC_FS23_FS_LIMP1_REQ_NO_ACTION      ((uint16)((uint16)0x0000U << SBC_FS23_FS_LIMP1_REQ_SHIFT))
/* LIMP1 assertion */
#define SBC_FS23_FS_LIMP1_REQ_ASSERT         ((uint16)((uint16)0x0001U << SBC_FS23_FS_LIMP1_REQ_SHIFT))

/* PWM frequency = 1.25Hz with 50% duty cycle (Default high) */
#define SBC_FS23_FS_LIMP1_CFG_PWM_LOW        ((uint16)((uint16)0x0000U << SBC_FS23_FS_LIMP1_CFG_SHIFT))
/* Default High (Active low) */
#define SBC_FS23_FS_LIMP1_CFG_ACTIVE_LOW     ((uint16)((uint16)0x0001U << SBC_FS23_FS_LIMP1_CFG_SHIFT))
/* PWM frequency = 1.25Hz with 50% duty cycle (Default low) */
#define SBC_FS23_FS_LIMP1_CFG_PWM_HIGH       ((uint16)((uint16)0x0002U << SBC_FS23_FS_LIMP1_CFG_SHIFT))
/* Default Low (Active high) */
#define SBC_FS23_FS_LIMP1_CFG_ACTIVE_HIGH    ((uint16)((uint16)0x0003U << SBC_FS23_FS_LIMP1_CFG_SHIFT))

/* No action */
#define SBC_FS23_FS_LIMP2_REQ_NO_ACTION      ((uint16)((uint16)0x0000U << SBC_FS23_FS_LIMP2_REQ_SHIFT))
/* LIMP2 assertion */
#define SBC_FS23_FS_LIMP2_REQ_ASSERT         ((uint16)((uint16)0x0001U << SBC_FS23_FS_LIMP2_REQ_SHIFT))

/* PWM frequency = 1.25Hz with 50% duty cycle (Default high) */
#define SBC_FS23_FS_LIMP2_CFG_PWM_LOW        ((uint16)((uint16)0x0000U << SBC_FS23_FS_LIMP2_CFG_SHIFT))
/* Default High (Active low) */
#define SBC_FS23_FS_LIMP2_CFG_ACTIVE_LOW     ((uint16)((uint16)0x0001U << SBC_FS23_FS_LIMP2_CFG_SHIFT))
/* PWM frequency = 1.25Hz with 50% duty cycle (Default low) */
#define SBC_FS23_FS_LIMP2_CFG_PWM_HIGH       ((uint16)((uint16)0x0002U << SBC_FS23_FS_LIMP2_CFG_SHIFT))
/* Default Low (Active high) */
#define SBC_FS23_FS_LIMP2_CFG_ACTIVE_HIGH    ((uint16)((uint16)0x0003U << SBC_FS23_FS_LIMP2_CFG_SHIFT))

/* PWM duty cycle = 20% */
#define SBC_FS23_FS_LIMP2_DC_CFG_20          ((uint16)((uint16)0x0000U << SBC_FS23_FS_LIMP2_DC_CFG_SHIFT))
/* PWM duty cycle = 10% */
#define SBC_FS23_FS_LIMP2_DC_CFG_10          ((uint16)((uint16)0x0001U << SBC_FS23_FS_LIMP2_DC_CFG_SHIFT))
/* PWM duty cycle = 5% */
#define SBC_FS23_FS_LIMP2_DC_CFG_5           ((uint16)((uint16)0x0000U << SBC_FS23_FS_LIMP2_DC_CFG_SHIFT))
/* PWM duty cycle = 2.5% */
#define SBC_FS23_FS_LIMP2_DC_CFG_2           ((uint16)((uint16)0x0001U << SBC_FS23_FS_LIMP2_DC_CFG_SHIFT))

/******************************************************************************/
/* FS_FS0B_LIMP0_REL - Type: RW                                               */
/******************************************************************************/

