wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
#define SBC_FS23_FS_FS0B_LIMP0_REL_ADDR      ((uint8)(0x3CU))
#define SBC_FS23_FS_FS0B_LIMP0_REL_DEFAULT   ((uint16)(0x0000U))

/* Write secured 16 bits word to release FS0B and/or LIMP0 */
#define SBC_FS23_FS_RELEASE_FS0B_LIMP0_MASK  ((uint16)(0xFFFFU))
#define SBC_FS23_FS_RELEASE_FS0B_LIMP0_SHIFT ((uint16)(0x0000U))

/* Write 3'b011,~WD_TOKEN[0:12] to release FS0B */
#define SBC_FS23_FS_RELEASE_FS0B_LIMP0_FS0B  ((uint16)((uint16)0x6000U << SBC_FS23_FS_RELEASE_FS0B_LIMP0_SHIFT))
/* Write 3'b101,~WD_TOKEN[0:6],~WD_TOKEN[10:15] to release both FS0B and LIMP0 */
#define SBC_FS23_FS_RELEASE_FS0B_LIMP0_BOTH  ((uint16)((uint16)0xA000U << SBC_FS23_FS_RELEASE_FS0B_LIMP0_SHIFT))
/* Write 3'b110,~WD_TOKEN[3:15] to release LIMP0 */
#define SBC_FS23_FS_RELEASE_FS0B_LIMP0_LIMP0 ((uint16)((uint16)0xC000U << SBC_FS23_FS_RELEASE_FS0B_LIMP0_SHIFT))

/******************************************************************************/
/* FS_ABIST - Type: RW                                                        */
/******************************************************************************/

#define SBC_FS23_FS_ABIST_ADDR               ((uint8)(0x3DU))
#define SBC_FS23_FS_ABIST_DEFAULT            ((uint16)(0x0000U))

/* Request ABIST on V3MON */
#define SBC_FS23_FS_ABIST_V3MON_MASK         ((uint16)(0x0001U))
#define SBC_FS23_FS_ABIST_V3MON_SHIFT        ((uint16)(0x0000U))
/* Request ABIST on V2MON */
#define SBC_FS23_FS_ABIST_V2MON_MASK         ((uint16)(0x0002U))
#define SBC_FS23_FS_ABIST_V2MON_SHIFT        ((uint16)(0x0001U))
/* Request ABIST on V1MON */
#define SBC_FS23_FS_ABIST_V1MON_MASK         ((uint16)(0x0004U))
#define SBC_FS23_FS_ABIST_V1MON_SHIFT        ((uint16)(0x0002U))
/* Request ABIST on V1UVLP */
#define SBC_FS23_FS_ABIST_V1UVLP_MASK        ((uint16)(0x0008U))
#define SBC_FS23_FS_ABIST_V1UVLP_SHIFT       ((uint16)(0x0003U))
/* Request ABIST on V0MON */
#define SBC_FS23_FS_ABIST_V0MON_MASK         ((uint16)(0x0010U))
#define SBC_FS23_FS_ABIST_V0MON_SHIFT        ((uint16)(0x0004U))
/* Report ABIST status on V3MON */
#define SBC_FS23_FS_ABIST_V3MON_DIAG_MASK    ((uint16)(0x0040U))
#define SBC_FS23_FS_ABIST_V3MON_DIAG_SHIFT   ((uint16)(0x0006U))
/* Report ABIST status on V2MON */
#define SBC_FS23_FS_ABIST_V2MON_DIAG_MASK    ((uint16)(0x0080U))
#define SBC_FS23_FS_ABIST_V2MON_DIAG_SHIFT   ((uint16)(0x0007U))
/* Report ABIST status on V1MON */
#define SBC_FS23_FS_ABIST_V1MON_DIAG_MASK    ((uint16)(0x0100U))
#define SBC_FS23_FS_ABIST_V1MON_DIAG_SHIFT   ((uint16)(0x0008U))
/* Report ABIST status on V1UVLP */
#define SBC_FS23_FS_ABIST_V1UVLP_DIAG_MASK   ((uint16)(0x0200U))
#define SBC_FS23_FS_ABIST_V1UVLP_DIAG_SHIFT  ((uint16)(0x0009U))
/* Report ABIST status on V0MON */
#define SBC_FS23_FS_ABIST_V0MON_DIAG_MASK    ((uint16)(0x0400U))
#define SBC_FS23_FS_ABIST_V0MON_DIAG_SHIFT   ((uint16)(0x000AU))
/* Report ABIST On going status */
#define SBC_FS23_FS_ABIST_ONGOING_MASK       ((uint16)(0x0800U))
#define SBC_FS23_FS_ABIST_ONGOING_SHIFT      ((uint16)(0x000BU))
/* Diagnostic of ABIST on Demand */
#define SBC_FS23_FS_ABIST_DONE_MASK          ((uint16)(0x1000U))
#define SBC_FS23_FS_ABIST_DONE_SHIFT         ((uint16)(0x000CU))
/* Clear ABIST flags */
#define SBC_FS23_FS_CLEAR_ABIST_MASK         ((uint16)(0x2000U))
#define SBC_FS23_FS_CLEAR_ABIST_SHIFT        ((uint16)(0x000DU))
/* Launch ABIST on selected VMON */
#define SBC_FS23_FS_LAUNCH_ABIST_MASK        ((uint16)(0x4000U))
#define SBC_FS23_FS_LAUNCH_ABIST_SHIFT       ((uint16)(0x000EU))
/* Report ABIST Ready for launch */
#define SBC_FS23_FS_ABIST_READY_MASK         ((uint16)(0x8000U))
#define SBC_FS23_FS_ABIST_READY_SHIFT        ((uint16)(0x000FU))

/* No ABIST */
#define SBC_FS23_FS_ABIST_V3MON_NO_REQUEST   ((uint16)((uint16)0x0000U << SBC_FS23_FS_ABIST_V3MON_SHIFT))
/* ABIST on V3MON Requested */
#define SBC_FS23_FS_ABIST_V3MON_REQUEST      ((uint16)((uint16)0x0001U << SBC_FS23_FS_ABIST_V3MON_SHIFT))

/* No ABIST */
#define SBC_FS23_FS_ABIST_V2MON_NO_REQUEST   ((uint16)((uint16)0x0000U << SBC_FS23_FS_ABIST_V2MON_SHIFT))
/* ABIST on V2MON Requested */
#define SBC_FS23_FS_ABIST_V2MON_REQUEST      ((uint16)((uint16)0x0001U << SBC_FS23_FS_ABIST_V2MON_SHIFT))

/* No ABIST */
#define SBC_FS23_FS_ABIST_V1MON_NO_REQUEST   ((uint16)((uint16)0x0000U << SBC_FS23_FS_ABIST_V1MON_SHIFT))
/* ABIST on V1MON Requested */
#define SBC_FS23_FS_ABIST_V1MON_REQUEST      ((uint16)((uint16)0x0001U << SBC_FS23_FS_ABIST_V1MON_SHIFT))

/* No ABIST */
#define SBC_FS23_FS_ABIST_V1UVLP_NO_REQUEST  ((uint16)((uint16)0x0000U << SBC_FS23_FS_ABIST_V1UVLP_SHIFT))
/* ABIST on V1UVLP Requested */
#define SBC_FS23_FS_ABIST_V1UVLP_REQUEST     ((uint16)((uint16)0x0001U << SBC_FS23_FS_ABIST_V1UVLP_SHIFT))

/* No ABIST */
#define SBC_FS23_FS_ABIST_V0MON_NO_REQUEST   ((uint16)((uint16)0x0000U << SBC_FS23_FS_ABIST_V0MON_SHIFT))
/* ABIST on V0MON Requested */
#define SBC_FS23_FS_ABIST_V0MON_REQUEST      ((uint16)((uint16)0x0001U << SBC_FS23_FS_ABIST_V0MON_SHIFT))

/* ABIST not executed on V3MON or fail on V3MON */
#define SBC_FS23_FS_ABIST_V3MON_DIAG_FAIL    ((uint16)((uint16)0x0000U << SBC_FS23_FS_ABIST_V3MON_DIAG_SHIFT))
/* V3MON ABIST PASS */
#define SBC_FS23_FS_ABIST_V3MON_DIAG_PASS    ((uint16)((uint16)0x0001U << SBC_FS23_FS_ABIST_V3MON_DIAG_SHIFT))

/* ABIST not executed on V2MON or fail on V2MON */
#define SBC_FS23_FS_ABIST_V2MON_DIAG_FAIL    ((uint16)((uint16)0x0000U << SBC_FS23_FS_ABIST_V2MON_DIAG_SHIFT))
/* V2MON ABIST PASS */
#define SBC_FS23_FS_ABIST_V2MON_DIAG_PASS    ((uint16)((uint16)0x0001U << SBC_FS23_FS_ABIST_V2MON_DIAG_SHIFT))

/* ABIST not executed on V1MON or fail on V1MON */
#define SBC_FS23_FS_ABIST_V1MON_DIAG_FAIL    ((uint16)((uint16)0x0000U << SBC_FS23_FS_ABIST_V1MON_DIAG_SHIFT))
/* V1MON ABIST PASS */
#define SBC_FS23_FS_ABIST_V1MON_DIAG_PASS    ((uint16)((uint16)0x0001U << SBC_FS23_FS_ABIST_V1MON_DIAG_SHIFT))

/* ABIST not executed on V1UVLP or fail on V1UVLP */
#define SBC_FS23_FS_ABIST_V1UVLP_DIAG_FAIL   ((uint16)((uint16)0x0000U << SBC_FS23_FS_ABIST_V1UVLP_DIAG_SHIFT))
/* V1UVLP ABIST PASS */
#define SBC_FS23_FS_ABIST_V1UVLP_DIAG_PASS   ((uint16)((uint16)0x0001U << SBC_FS23_FS_ABIST_V1UVLP_DIAG_SHIFT))

/* ABIST not executed on V0MON or fail on V0MON */
#define SBC_FS23_FS_ABIST_V0MON_DIAG_FAIL    ((uint16)((uint16)0x0000U << SBC_FS23_FS_ABIST_V0MON_DIAG_SHIFT))
/* V0MON ABIST PASS */
#define SBC_FS23_FS_ABIST_V0MON_DIAG_PASS    ((uint16)((uint16)0x0001U << SBC_FS23_FS_ABIST_V0MON_DIAG_SHIFT))

