wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* No ABIST on going */
#define SBC_FS23_FS_ABIST_ONGOING_IDLE       ((uint16)((uint16)0x0000U << SBC_FS23_FS_ABIST_ONGOING_SHIFT))
/* ABIST on going */
#define SBC_FS23_FS_ABIST_ONGOING_BUSY       ((uint16)((uint16)0x0001U << SBC_FS23_FS_ABIST_ONGOING_SHIFT))

/* ABIST not executed */
#define SBC_FS23_FS_ABIST_DONE_NO_ABIST      ((uint16)((uint16)0x0000U << SBC_FS23_FS_ABIST_DONE_SHIFT))
/* ABIST executed */
#define SBC_FS23_FS_ABIST_DONE_ABIST         ((uint16)((uint16)0x0001U << SBC_FS23_FS_ABIST_DONE_SHIFT))

/* No action */
#define SBC_FS23_FS_CLEAR_ABIST_NO_ACTION    ((uint16)((uint16)0x0000U << SBC_FS23_FS_CLEAR_ABIST_SHIFT))
/* Clear ABIST flags (ABIST_DONE, ABIST_VxMON_DIAG, ABIST_V1UVLP_DIAG) */
#define SBC_FS23_FS_CLEAR_ABIST_CLEAR        ((uint16)((uint16)0x0001U << SBC_FS23_FS_CLEAR_ABIST_SHIFT))

/* No action */
#define SBC_FS23_FS_LAUNCH_ABIST_NO_ACTION   ((uint16)((uint16)0x0000U << SBC_FS23_FS_LAUNCH_ABIST_SHIFT))
/* Launch ABIST */
#define SBC_FS23_FS_LAUNCH_ABIST_LAUNCH      ((uint16)((uint16)0x0001U << SBC_FS23_FS_LAUNCH_ABIST_SHIFT))

/* ABIST not ready for launch */
#define SBC_FS23_FS_ABIST_READY_NOT_OK       ((uint16)((uint16)0x0000U << SBC_FS23_FS_ABIST_READY_SHIFT))
/* ABIST ready for launch */
#define SBC_FS23_FS_ABIST_READY_OK           ((uint16)((uint16)0x0001U << SBC_FS23_FS_ABIST_READY_SHIFT))

/******************************************************************************/
/* FS_SAFETY_OUTPUTS - Type: RW                                               */
/******************************************************************************/

#define SBC_FS23_FS_SAFETY_OUTPUTS_ADDR      ((uint8)(0x3FU))
#define SBC_FS23_FS_SAFETY_OUTPUTS_DEFAULT   ((uint16)(0x0000U))

/* Request an assertion of LIMP0 */
#define SBC_FS23_FS_LIMP0_REQ_MASK           ((uint16)(0x0001U))
#define SBC_FS23_FS_LIMP0_REQ_SHIFT          ((uint16)(0x0000U))
/* Report a LIMP0 short to HIGH */
#define SBC_FS23_FS_LIMP0_DIAG_MASK          ((uint16)(0x0002U))
#define SBC_FS23_FS_LIMP0_DIAG_SHIFT         ((uint16)(0x0001U))
/* Sense LIMP0 pad */
#define SBC_FS23_FS_LIMP0_SNS_MASK           ((uint16)(0x0004U))
#define SBC_FS23_FS_LIMP0_SNS_SHIFT          ((uint16)(0x0002U))
/* Report the digital command of LIMP0 driver */
#define SBC_FS23_FS_LIMP0_DRV_MASK           ((uint16)(0x0008U))
#define SBC_FS23_FS_LIMP0_DRV_SHIFT          ((uint16)(0x0003U))
/* Request an assertion of FS0B */
#define SBC_FS23_FS_FS0B_REQ_MASK            ((uint16)(0x0020U))
#define SBC_FS23_FS_FS0B_REQ_SHIFT           ((uint16)(0x0005U))
/* Report a FS0B short to HIGH */
#define SBC_FS23_FS_FS0B_DIAG_MASK           ((uint16)(0x0040U))
#define SBC_FS23_FS_FS0B_DIAG_SHIFT          ((uint16)(0x0006U))
/* Sense FS0B pad */
#define SBC_FS23_FS_FS0B_SNS_MASK            ((uint16)(0x0080U))
#define SBC_FS23_FS_FS0B_SNS_SHIFT           ((uint16)(0x0007U))
/* Report the digital command of FS0B driver */
#define SBC_FS23_FS_FS0B_DRV_MASK            ((uint16)(0x0100U))
#define SBC_FS23_FS_FS0B_DRV_SHIFT           ((uint16)(0x0008U))
/* Request an assertion of RSTB */
#define SBC_FS23_FS_RSTB_REQ_MASK            ((uint16)(0x0200U))
#define SBC_FS23_FS_RSTB_REQ_SHIFT           ((uint16)(0x0009U))
/* Report a RSTB short to HIGH */
#define SBC_FS23_FS_RSTB_DIAG_MASK           ((uint16)(0x0400U))
#define SBC_FS23_FS_RSTB_DIAG_SHIFT          ((uint16)(0x000AU))
/* Sense RSTB pad */
#define SBC_FS23_FS_RSTB_SNS_MASK            ((uint16)(0x0800U))
#define SBC_FS23_FS_RSTB_SNS_SHIFT           ((uint16)(0x000BU))
/* Report the digital command of RSTB driver */
#define SBC_FS23_FS_RSTB_DRV_MASK            ((uint16)(0x1000U))
#define SBC_FS23_FS_RSTB_DRV_SHIFT           ((uint16)(0x000CU))
/* Report a RSTB Event generated by FS23 */
#define SBC_FS23_FS_RSTB_EVT_MASK            ((uint16)(0x2000U))
#define SBC_FS23_FS_RSTB_EVT_SHIFT           ((uint16)(0x000DU))
/* Report a RSTB pin assertion */
#define SBC_FS23_FS_RSTB_EXT_MASK            ((uint16)(0x4000U))
#define SBC_FS23_FS_RSTB_EXT_SHIFT           ((uint16)(0x000EU))

/* No action */
#define SBC_FS23_FS_LIMP0_REQ_NO_ACTION      ((uint16)((uint16)0x0000U << SBC_FS23_FS_LIMP0_REQ_SHIFT))
/* LIMP0 assertion */
#define SBC_FS23_FS_LIMP0_REQ_ASSERT         ((uint16)((uint16)0x0001U << SBC_FS23_FS_LIMP0_REQ_SHIFT))

/* No Failure */
#define SBC_FS23_FS_LIMP0_DIAG_NO_FAIL       ((uint16)((uint16)0x0000U << SBC_FS23_FS_LIMP0_DIAG_SHIFT))
/* Short to High detected */
#define SBC_FS23_FS_LIMP0_DIAG_SHORT         ((uint16)((uint16)0x0001U << SBC_FS23_FS_LIMP0_DIAG_SHIFT))

/* LIMP0 pad is sensed low */
#define SBC_FS23_FS_LIMP0_SNS_LOW            ((uint16)((uint16)0x0000U << SBC_FS23_FS_LIMP0_SNS_SHIFT))
/* LIMP0 pad is sensed High */
#define SBC_FS23_FS_LIMP0_SNS_HIGH           ((uint16)((uint16)0x0001U << SBC_FS23_FS_LIMP0_SNS_SHIFT))

/* LIMP0 Driver command sensed Low */
#define SBC_FS23_FS_LIMP0_DRV_LOW            ((uint16)((uint16)0x0000U << SBC_FS23_FS_LIMP0_DRV_SHIFT))
/* LIMP0 Driver command sensed High */
#define SBC_FS23_FS_LIMP0_DRV_HIGH           ((uint16)((uint16)0x0001U << SBC_FS23_FS_LIMP0_DRV_SHIFT))

/* No action */
#define SBC_FS23_FS_FS0B_REQ_NO_ACTION       ((uint16)((uint16)0x0000U << SBC_FS23_FS_FS0B_REQ_SHIFT))
/* FS0B assertion */
#define SBC_FS23_FS_FS0B_REQ_ASSERT          ((uint16)((uint16)0x0001U << SBC_FS23_FS_FS0B_REQ_SHIFT))

/* No Failure */
#define SBC_FS23_FS_FS0B_DIAG_NO_FAIL        ((uint16)((uint16)0x0000U << SBC_FS23_FS_FS0B_DIAG_SHIFT))
/* Short to High detected */
#define SBC_FS23_FS_FS0B_DIAG_SHORT          ((uint16)((uint16)0x0001U << SBC_FS23_FS_FS0B_DIAG_SHIFT))

/* FS0B pad is sensed low */
#define SBC_FS23_FS_FS0B_SNS_LOW             ((uint16)((uint16)0x0000U << SBC_FS23_FS_FS0B_SNS_SHIFT))
/* FS0B pad is sensed High */
#define SBC_FS23_FS_FS0B_SNS_HIGH            ((uint16)((uint16)0x0001U << SBC_FS23_FS_FS0B_SNS_SHIFT))

/* FS0B Driver command sensed Low */
#define SBC_FS23_FS_FS0B_DRV_LOW             ((uint16)((uint16)0x0000U << SBC_FS23_FS_FS0B_DRV_SHIFT))
/* FS0B Driver command sensed High */
#define SBC_FS23_FS_FS0B_DRV_HIGH            ((uint16)((uint16)0x0001U << SBC_FS23_FS_FS0B_DRV_SHIFT))

/* No action */
#define SBC_FS23_FS_RSTB_REQ_NO_ACTION       ((uint16)((uint16)0x0000U << SBC_FS23_FS_RSTB_REQ_SHIFT))
/* RSTB assertion */
#define SBC_FS23_FS_RSTB_REQ_ASSERT          ((uint16)((uint16)0x0001U << SBC_FS23_FS_RSTB_REQ_SHIFT))

/* No Failure */
#define SBC_FS23_FS_RSTB_DIAG_NO_FAIL        ((uint16)((uint16)0x0000U << SBC_FS23_FS_RSTB_DIAG_SHIFT))
/* Short to High detected */
#define SBC_FS23_FS_RSTB_DIAG_SHORT          ((uint16)((uint16)0x0001U << SBC_FS23_FS_RSTB_DIAG_SHIFT))

/* RSTB pad is sensed low */
#define SBC_FS23_FS_RSTB_SNS_LOW             ((uint16)((uint16)0x0000U << SBC_FS23_FS_RSTB_SNS_SHIFT))
/* RSTB pad is sensed High */
#define SBC_FS23_FS_RSTB_SNS_HIGH            ((uint16)((uint16)0x0001U << SBC_FS23_FS_RSTB_SNS_SHIFT))

/* RSTB Driver command sensed Low */
#define SBC_FS23_FS_RSTB_DRV_LOW             ((uint16)((uint16)0x0000U << SBC_FS23_FS_RSTB_DRV_SHIFT))
/* RSTB Driver command sensed High */
#define SBC_FS23_FS_RSTB_DRV_HIGH            ((uint16)((uint16)0x0001U << SBC_FS23_FS_RSTB_DRV_SHIFT))

