wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* No RSTB event */
#define SBC_FS23_FS_RSTB_EVT_NO_EVENT        ((uint16)((uint16)0x0000U << SBC_FS23_FS_RSTB_EVT_SHIFT))
/* RSTB event Occurred */
#define SBC_FS23_FS_RSTB_EVT_EVENT           ((uint16)((uint16)0x0001U << SBC_FS23_FS_RSTB_EVT_SHIFT))

/* No RSTB pin assertion */
#define SBC_FS23_FS_RSTB_EXT_NOT_ASSERTED    ((uint16)((uint16)0x0000U << SBC_FS23_FS_RSTB_EXT_SHIFT))
/* RSTB pin assertion Occurred */
#define SBC_FS23_FS_RSTB_EXT_ASSERTED        ((uint16)((uint16)0x0001U << SBC_FS23_FS_RSTB_EXT_SHIFT))

/******************************************************************************/
/* FS_SAFETY_FLG - Type: RW                                                   */
/******************************************************************************/

#define SBC_FS23_FS_SAFETY_FLG_ADDR          ((uint8)(0x40U))
#define SBC_FS23_FS_SAFETY_FLG_DEFAULT       ((uint16)(0x0000U))

/* Sense FCCU2 pin state */
#define SBC_FS23_FS_FCCU2_S_MASK             ((uint16)(0x0001U))
#define SBC_FS23_FS_FCCU2_S_SHIFT            ((uint16)(0x0000U))
/* Sense FCCU1 pin state */
#define SBC_FS23_FS_FCCU1_S_MASK             ((uint16)(0x0002U))
#define SBC_FS23_FS_FCCU1_S_SHIFT            ((uint16)(0x0001U))
/* Report FCCU2 input error */
#define SBC_FS23_FS_FCCU2_I_MASK             ((uint16)(0x0004U))
#define SBC_FS23_FS_FCCU2_I_SHIFT            ((uint16)(0x0002U))
/* Report FCCU1 input error */
#define SBC_FS23_FS_FCCU1_I_MASK             ((uint16)(0x0008U))
#define SBC_FS23_FS_FCCU1_I_SHIFT            ((uint16)(0x0003U))
/* Report FCCU12 input error */
#define SBC_FS23_FS_FCCU12_I_MASK            ((uint16)(0x0010U))
#define SBC_FS23_FS_FCCU12_I_SHIFT           ((uint16)(0x0004U))
/* Inhibit FCCU2 Interrupt */
#define SBC_FS23_FS_FCCU2_M_MASK             ((uint16)(0x0020U))
#define SBC_FS23_FS_FCCU2_M_SHIFT            ((uint16)(0x0005U))
/* Inhibit FCCU1 Interrupt */
#define SBC_FS23_FS_FCCU1_M_MASK             ((uint16)(0x0040U))
#define SBC_FS23_FS_FCCU1_M_SHIFT            ((uint16)(0x0006U))
/* Inhibit FCCU12 Interrupt */
#define SBC_FS23_FS_FCCU12_M_MASK            ((uint16)(0x0080U))
#define SBC_FS23_FS_FCCU12_M_SHIFT           ((uint16)(0x0007U))
/* Report a Watchdog Refresh error */
#define SBC_FS23_FS_WD_NOK_I_MASK            ((uint16)(0x0200U))
#define SBC_FS23_FS_WD_NOK_I_SHIFT           ((uint16)(0x0009U))
/* Mask Watchdog Not OK Refresh Interrupt */
#define SBC_FS23_FS_WD_NOK_M_MASK            ((uint16)(0x0400U))
#define SBC_FS23_FS_WD_NOK_M_SHIFT           ((uint16)(0x000AU))
/* Report an INIT Register CRC error */
#define SBC_FS23_FS_INIT_CRC_NOK_I_MASK      ((uint16)(0x0800U))
#define SBC_FS23_FS_INIT_CRC_NOK_I_SHIFT     ((uint16)(0x000BU))
/* Mask CRC Not OK Interrupt */
#define SBC_FS23_FS_INIT_CRC_NOK_M_MASK      ((uint16)(0x1000U))
#define SBC_FS23_FS_INIT_CRC_NOK_M_SHIFT     ((uint16)(0x000CU))
/* Report real time FCCU2 error (generated by MCU) */
#define SBC_FS23_FS_FCCU2_ERR_S_MASK         ((uint16)(0x2000U))
#define SBC_FS23_FS_FCCU2_ERR_S_SHIFT        ((uint16)(0x000DU))
/* Report real time FCCU1 error (generated by MCU) */
#define SBC_FS23_FS_FCCU1_ERR_S_MASK         ((uint16)(0x4000U))
#define SBC_FS23_FS_FCCU1_ERR_S_SHIFT        ((uint16)(0x000EU))
/* Report real time FCCU12 error (generated by MCU) */
#define SBC_FS23_FS_FCCU12_ERR_S_MASK        ((uint16)(0x8000U))
#define SBC_FS23_FS_FCCU12_ERR_S_SHIFT       ((uint16)(0x000FU))

/* FCCU2 is Low */
#define SBC_FS23_FS_FCCU2_S_LOW              ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU2_S_SHIFT))
/* FCCU2 is High */
#define SBC_FS23_FS_FCCU2_S_HIGH             ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU2_S_SHIFT))

/* FCCU1 is Low */
#define SBC_FS23_FS_FCCU1_S_LOW              ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU1_S_SHIFT))
/* FCCU1 is High */
#define SBC_FS23_FS_FCCU1_S_HIGH             ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU1_S_SHIFT))

/* No error */
#define SBC_FS23_FS_FCCU2_I_NO_ERROR         ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU2_I_SHIFT))
/* FCCU2 error reported */
#define SBC_FS23_FS_FCCU2_I_ERROR            ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU2_I_SHIFT))

/* No error */
#define SBC_FS23_FS_FCCU1_I_NO_ERROR         ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU1_I_SHIFT))
/* FCCU1 error reported */
#define SBC_FS23_FS_FCCU1_I_ERROR            ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU1_I_SHIFT))

/* No error */
#define SBC_FS23_FS_FCCU12_I_NO_ERROR        ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU12_I_SHIFT))
/* FCCU12 error reported */
#define SBC_FS23_FS_FCCU12_I_ERROR           ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU12_I_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_FS_FCCU2_M_NOT_INHIBIT      ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU2_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_FS_FCCU2_M_INHIBIT          ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU2_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_FS_FCCU1_M_NOT_INHIBIT      ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU1_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_FS_FCCU1_M_INHIBIT          ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU1_M_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_FS_FCCU12_M_NOT_INHIBIT     ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU12_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_FS_FCCU12_M_INHIBIT         ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU12_M_SHIFT))

/* WD refresh OK */
#define SBC_FS23_FS_WD_NOK_I_OK              ((uint16)((uint16)0x0000U << SBC_FS23_FS_WD_NOK_I_SHIFT))
/* WD refresh not OK */
#define SBC_FS23_FS_WD_NOK_I_NOT_OK          ((uint16)((uint16)0x0001U << SBC_FS23_FS_WD_NOK_I_SHIFT))

/* Interrupt is Not Inhibited */
#define SBC_FS23_FS_WD_NOK_M_NOT_INHIBIT     ((uint16)((uint16)0x0000U << SBC_FS23_FS_WD_NOK_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_FS_WD_NOK_M_INHIBIT         ((uint16)((uint16)0x0001U << SBC_FS23_FS_WD_NOK_M_SHIFT))

/* No error detected */
#define SBC_FS23_FS_INIT_CRC_NOK_I_NO_ERROR  ((uint16)((uint16)0x0000U << SBC_FS23_FS_INIT_CRC_NOK_I_SHIFT))
/* INIT registers CRC error detected */
#define SBC_FS23_FS_INIT_CRC_NOK_I_ERROR     ((uint16)((uint16)0x0001U << SBC_FS23_FS_INIT_CRC_NOK_I_SHIFT))

