wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/CDD_Sbc_fs23_Regs.h
/* Interrupt is Not Inhibited */
#define SBC_FS23_FS_INIT_CRC_NOK_M_NOT_INHIBIT ((uint16)((uint16)0x0000U << SBC_FS23_FS_INIT_CRC_NOK_M_SHIFT))
/* Interrupt is Inhibited */
#define SBC_FS23_FS_INIT_CRC_NOK_M_INHIBIT   ((uint16)((uint16)0x0001U << SBC_FS23_FS_INIT_CRC_NOK_M_SHIFT))

/* No error */
#define SBC_FS23_FS_FCCU2_ERR_S_NO_ERROR     ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU2_ERR_S_SHIFT))
/* Real time error detected */
#define SBC_FS23_FS_FCCU2_ERR_S_ERROR        ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU2_ERR_S_SHIFT))

/* No error */
#define SBC_FS23_FS_FCCU1_ERR_S_NO_ERROR     ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCC1_ERR_S_SHIFT))
/* Real time error detected */
#define SBC_FS23_FS_FCCU1_ERR_S_ERROR        ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU1_ERR_S_SHIFT))

/* No error */
#define SBC_FS23_FS_FCCU12_ERR_S_NO_ERROR    ((uint16)((uint16)0x0000U << SBC_FS23_FS_FCCU12_ERR_S_SHIFT))
/* Real time error detected */
#define SBC_FS23_FS_FCCU12_ERR_S_ERROR       ((uint16)((uint16)0x0001U << SBC_FS23_FS_FCCU12_ERR_S_SHIFT))

/******************************************************************************/
/* FS_CRC - Type: RW                                                          */
/******************************************************************************/

#define SBC_FS23_FS_CRC_ADDR                        ((uint8)(0x41U))
#define SBC_FS23_FS_CRC_DEFAULT                     ((uint16)(0x0000U))

/* INIT registers CRC value calculated by the MCU (CRC check every 5ms in NORMAL mode only) */
#define SBC_FS23_FS_CRC_VALUE_MASK                  ((uint16)(0x00FFU))
#define SBC_FS23_FS_CRC_VALUE_SHIFT                 ((uint16)(0x0000U))
/* Configure CRC impact on LIMP0 */
#define SBC_FS23_FS_INIT_CRC_LIMP0_IMPACT_MASK      ((uint16)(0x0200U))
#define SBC_FS23_FS_INIT_CRC_LIMP0_IMPACT_SHIFT     ((uint16)(0x0009U))
/* Configure CRC impact on FS0B */
#define SBC_FS23_FS_INIT_CRC_FS0B_IMPACT_MASK       ((uint16)(0x0400U))
#define SBC_FS23_FS_INIT_CRC_FS0B_IMPACT_SHIFT      ((uint16)(0x000AU))
/* Request INIT CRC computation in INIT phase */
#define SBC_FS23_FS_INIT_CRC_INIT_CRC_REQ_MASK      ((uint16)(0x4000U))
#define SBC_FS23_FS_INIT_CRC_INIT_CRC_REQ_SHIFT     ((uint16)(0x000EU))

/* No Effect */
#define SBC_FS23_FS_INIT_CRC_LIMP0_IMPACT_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_INIT_CRC_LIMP0_IMPACT_SHIFT))
/* LIMP0 Assertion */
#define SBC_FS23_FS_INIT_CRC_LIMP0_IMPACT_ASSERT    ((uint16)((uint16)0x0001U << SBC_FS23_FS_INIT_CRC_LIMP0_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_INIT_CRC_FS0B_IMPACT_NO_EFFECT  ((uint16)((uint16)0x0000U << SBC_FS23_FS_INIT_CRC_FS0B_IMPACT_SHIFT))
/* FS0B Assertion */
#define SBC_FS23_FS_INIT_CRC_FS0B_IMPACT_ASSERT     ((uint16)((uint16)0x0001U << SBC_FS23_FS_INIT_CRC_FS0B_IMPACT_SHIFT))

/* No Effect */
#define SBC_FS23_FS_INIT_CRC_INIT_CRC_REQ_NO_EFFECT ((uint16)((uint16)0x0000U << SBC_FS23_FS_INIT_CRC_INIT_CRC_REQ_SHIFT))
/* Compuattion of the INIT CRC starts */
#define SBC_FS23_FS_INIT_CRC_INIT_CRC_REQ_COMPUTE   ((uint16)((uint16)0x0001U << SBC_FS23_FS_INIT_CRC_INIT_CRC_REQ_SHIFT))

#endif /* CDD_SBC_FS23_REGS_H_ */
